<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Unity3D第一人称射击游戏（推荐） | 田鹏飞的个人博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#xFF1A;&amp;#x7B80;&amp;#x4ECB;
&amp;#x8FD9;&amp;#x4E2A;&amp;#x6559;&amp;#x7A0B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4E86;&amp;#x89E3;&amp;#x4E0B;&amp;#x5982;&amp;#x4F55;&amp;#x5236;&amp;#x4F5C;&amp;#x4E00">
<meta property="og:type" content="article">
<meta property="og:title" content="Unity3D第一人称射击游戏（推荐）">
<meta property="og:url" content="http://yoursite.com/2016/05/14/Unity3D第一人称射击游戏(推荐)/index.html">
<meta property="og:site_name" content="田鹏飞的个人博客">
<meta property="og:description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#xFF1A;&amp;#x7B80;&amp;#x4ECB;
&amp;#x8FD9;&amp;#x4E2A;&amp;#x6559;&amp;#x7A0B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4E86;&amp;#x89E3;&amp;#x4E0B;&amp;#x5982;&amp;#x4F55;&amp;#x5236;&amp;#x4F5C;&amp;#x4E00">
<meta property="og:updated_time" content="2017-01-19T07:52:49.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Unity3D第一人称射击游戏（推荐）">
<meta name="twitter:description" content="&amp;#x7B2C;&amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#xFF1A;&amp;#x7B80;&amp;#x4ECB;
&amp;#x8FD9;&amp;#x4E2A;&amp;#x6559;&amp;#x7A0B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4E86;&amp;#x89E3;&amp;#x4E0B;&amp;#x5982;&amp;#x4F55;&amp;#x5236;&amp;#x4F5C;&amp;#x4E00">
  
    <link rel="alternate" href="/atom.xml" title="田鹏飞的个人博客" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">田鹏飞的个人博客</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">你若盛开，蝴蝶自来</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Søk"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-Unity3D第一人称射击游戏(推荐)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/05/14/Unity3D第一人称射击游戏(推荐)/" class="article-date">
  <time datetime="2016-05-14T14:08:26.000Z" itemprop="datePublished">2016-05-14</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Unity3D第一人称射击游戏（推荐）
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x7B80;&#x4ECB;</p>
<p>&#x8FD9;&#x4E2A;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x4E0B;&#x5982;&#x4F55;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B2C;&#x4E00;&#x4EBA;&#x79F0;&#x5C04;&#x51FB;&#x6E38;&#x620F;&#xFF08;FPS&#xFF09;&#x3002;&#x5176;&#x4E2D;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;3D&#x6E38;&#x620F;&#x7F16;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x600E;&#x6837;&#x5982;&#x6E38;&#x620F;&#x7A0B;&#x5E8F;&#x5458;&#x822C;&#x601D;&#x8003;&#x7684;&#x6280;&#x5DE7;&#x3002;</p>
<p>&#x524D;&#x63D0;</p>
<p>&#x8FD9;&#x4E2A;&#x6559;&#x7A0B;&#x5047;&#x5B9A;&#x4F60;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x8F6F;&#x4EF6;Unity&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x811A;&#x672C;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x65B0;&#x5DE5;&#x7A0B;</p>
<p>&#x4E0B;&#x8F7D;FPS_Tutorial.zip&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x538B;&#xFF0C;&#x5728;Unity&#x4E2D;&#x6253;&#x5F00;&#x5DE5;&#x7A0B;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x4ECE;Unity&#x5B89;&#x88C5;&#x76EE;&#x5F55;&#x5BFC;&#x5165;Standard Assets&#x8D44;&#x6E90;&#x5305;&#x3002;</p>
<p>&#x5BFC;&#x5165;&#x5DE5;&#x7A0B;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x5728;Unity&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x7684;&#x201C;Standard Assets&#x201D;&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x770B;&#x89C1;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x5185;&#x5BB9;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5BFC;&#x5165;&#x65B0;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x5B89;&#x88C5;&#x6309;&#x7167;&#x8D44;&#x6E90;&#x529F;&#x80FD;&#x5BF9;&#x5176;&#x5206;&#x7EC4;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x706B;&#x7BAD;&#x3001;&#x7206;&#x70B8;&#x3001;&#x97F3;&#x9891;&#x7B49;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x6E38;&#x620F;&#x73AF;&#x5883;</p>
<p>&#x5BFC;&#x5165;&#x8D44;&#x6E90;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5728;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x6587;&#x4EF6;&#x5939;&#x3002;</p>
<p>&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#xFF0C;&#x4ECE;&#x6587;&#x4EF6;&#x5939;&#x201C;Object/mainLevelMesh&#x201D;&#x4E2D;&#x9009;&#x62E9;&#x201C;mainLevelMesh&#x201D;&#x3002;</p>
<p>&#x5728;&#x53C2;&#x6570;&#x9762;&#x677F;&#xFF0C;FBXImporter&#x9009;&#x9879;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x201C;Generate Colliders&#x201D;&#x9009;&#x9879;&#xFF0C;&#x52FE;&#x9009;&#x6B64;&#x9009;&#x9879;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x505A;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x6E38;&#x620F;&#x4E2D;&#x73A9;&#x5BB6;&#x4F1A;&#x7A7F;&#x8D8A;&#x5730;&#x9762;&#x76F4;&#x63A5;&#x6389;&#x4E0B;&#x6DF1;&#x6E0A;&#xFF08;&#x5B9E;&#x9645;&#x662F;&#x5F00;&#x542F;&#x201C;&#x78B0;&#x649E;&#x201D;&#xFF0C;&#x4EA7;&#x751F;&#x4EA4;&#x4E92;&#xFF09;</p>
<p>&#x628A;&#x201C;mainLevelMesh&#x201D;&#x62D6;&#x653E;&#x5230;&#x573A;&#x666F;&#x4E2D;&#x3002;</p>
<p>&#x573A;&#x666F;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x706F;&#x5149;&#xFF0C;&#x8FD9;&#x5173;&#x5168;&#x90E8;&#x573A;&#x666F;&#x5DF2;&#x7ECF;&#x5168;&#x90E8;&#x5E94;&#x7528;&#x4E86;&#x706F;&#x5149;&#x8D34;&#x56FE;&#x3002;&#x6574;&#x4E2A;&#x573A;&#x666F;&#x5BF9;&#x6240;&#x6709;&#x706F;&#x5149;&#x8FDB;&#x884C;&#x4E86;&#x706F;&#x5149;&#x8D34;&#x56FE;&#x6E32;&#x67D3;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x201C;&#x9884;&#x70D8;&#x7119;&#x9634;&#x5F71;&#x201D;&#x3002;&#x706F;&#x5149;&#x8D34;&#x56FE;&#x5BF9;&#x663E;&#x793A;&#x6548;&#x679C;&#x6709;&#x5F88;&#x5927;&#x5E2E;&#x52A9;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x590D;&#x6742;&#x706F;&#x5149;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x53EF;&#x4EE5;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x4E86;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x4E3B;&#x8981;&#x89D2;&#x8272;</p>
<p>&#x4E0B;&#x9762;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x64CD;&#x63A7;&#x7684;&#x89D2;&#x8272;&#x7269;&#x4F53;&#x3002;Unity&#x9488;&#x5BF9;&#x7B2C;&#x4E00;&#x4EBA;&#x79F0;&#x5C04;&#x51FB;&#x6E38;&#x620F;&#x9884;&#x7F6E;&#x4E86;&#x8BB8;&#x591A;&#x5185;&#x7F6E;&#x7684;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x5728;&#x5DE5;&#x7A0B;&#x9762;&#x677F;Standard Assets-&gt;Prefabs&#x4E0B;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x7B2C;&#x4E00;&#x4EBA;&#x79F0;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x70B9;&#x51FB;&#x5DE5;&#x7A0B;&#x9762;&#x677F;Standard Assets&#x65C1;&#x8FB9;&#x7684;&#x5C0F;&#x4E09;&#x89D2;&#xFF0C;&#x5F39;&#x51FA;&#x8D44;&#x6E90;&#x5217;&#x8868;&#x3002;&#x627E;&#x5230;Prefabs&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x70B9;&#x51FB;&#x5C0F;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x5F39;&#x51FA;&#x8D44;&#x6E90;&#x5217;&#x8868;&#x3002;&#x628A;&#x201C;First person controller&#x201D;&#x62D6;&#x5230;&#x573A;&#x666F;&#x91CC;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x573A;&#x666F;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x73A9;&#x5BB6;&#x7684;&#x5706;&#x67F1;&#x4F53;&#xFF0C;&#x4E09;&#x4E2A;&#x5927;&#x7BAD;&#x5934;&#x4EE3;&#x8868;&#x7269;&#x4F53;&#x5728;3D&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x770B;&#x89C1;&#x7BAD;&#x5934;&#xFF0C;&#x9009;&#x62E9;&#x7269;&#x4F53;&#xFF0C;&#x6309;&#x201C;W&#x201D;&#x952E;&#xFF09;&#xFF0C;&#x767D;&#x8272;&#x9762;&#x4EE3;&#x8868;&#x7269;&#x4F53;&#x5F53;&#x524D;&#x89C6;&#x89D2;&#x3002;&#x73B0;&#x5728;FPS&#x63A7;&#x5236;&#x5668;&#x5904;&#x4E8E;&#x9ED8;&#x8BA4;&#x89C6;&#x89D2;&#x4F4D;&#x7F6E;&#xFF0C;&#x901A;&#x8FC7;&#x79FB;&#x52A8;&#x5B83;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x6E38;&#x620F;&#x89C6;&#x91CE;&#x3002;&#x628A;&#x89D2;&#x8272;&#x79FB;&#x52A8;&#x5230;&#x6E38;&#x620F;&#x73AF;&#x5883;&#x5173;&#x5361;&#x5730;&#x9762;&#x4E0A;&#x9762;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>Main Camera&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x7528;&#x5904;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5220;&#x6389;&#x4E86;&#x3002;</p>
<p>&#x70B9;&#x51FB;&#x201C;Play&#x201D;&#x952E;&#xFF0C;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x9F20;&#x6807;&#x548C;&#x952E;&#x76D8;&#x5728;&#x672C;&#x5173;&#x5361;&#x5730;&#x5F62;&#x4E2D;&#x56DB;&#x5904;&#x79FB;&#x52A8;&#x4E86;&#xFF08;&#x5149;&#x6807;&#x6216;&#x8005;&#x201C;W,A,S,D&#x201D;&#xFF09;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;FSP&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x7ED9;&#x89D2;&#x8272;&#x6DFB;&#x52A0;&#x6B66;&#x5668;&#x3002;</p>
<p>&#x589E;&#x52A0;&#x6B66;&#x5668;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x7ED9;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x69B4;&#x5F39;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x53D1;&#x5C04;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x6765;&#x5728;Unity&#x4E2D;&#x544A;&#x77E5;&#x8FD9;&#x4E2A;&#x6B66;&#x5668;&#x5982;&#x4F55;&#x52A8;&#x4F5C;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5177;&#x4F53;&#x8981;&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x8981;&#x4F7F;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x80FD;&#x5728;&#x6444;&#x50CF;&#x673A;&#x7684;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x5F00;&#x706B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x9996;&#x5148;&#x6765;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x548C;&#x6B66;&#x5668;&#x3002;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x6E38;&#x620F;&#x4E2D;&#x662F;&#x7B2C;&#x4E00;&#x4EBA;&#x79F0;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x6240;&#x4EE5;&#x6444;&#x50CF;&#x673A;&#x7684;&#x4F4D;&#x7F6E;&#x4E0E;&#x773C;&#x775B;&#x5E73;&#x884C;&#x3002;&#x5982;&#x679C;&#x73A9;&#x5BB6;&#x4F7F;&#x7528;&#x6B66;&#x5668;&#x5C04;&#x51FB;&#xFF0C;&#x6B66;&#x5668;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x89D2;&#x8272;&#x7684;&#x624B;&#x90E8;&#x4F4D;&#x7F6E;&#x5F00;&#x706B;&#x800C;&#x4E0D;&#x662F;&#x773C;&#x775B;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x201C;game object&#x201D;&#xFF08;&#x6E38;&#x620F;&#x7269;&#x4F53;&#xFF09;&#x6765;&#x4EE3;&#x8868;&#x69B4;&#x5F39;&#x53D1;&#x5C04;&#x5668;&#xFF0C;&#x540C;&#x65F6;&#x628A;&#x5B83;&#x653E;&#x7F6E;&#x5728;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x624B;&#x6301;&#x6B66;&#x5668;&#x65F6;&#x6B66;&#x5668;&#x6240;&#x5904;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x5F00;&#x706B;&#x7684;&#x4F4D;&#x7F6E;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x6B66;&#x5668;&#x53D1;&#x5C04;&#x5668;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x201C;game object&#x201D;&#x4EE3;&#x8868;&#x69B4;&#x5F39;&#x53D1;&#x5C04;&#x5668;&#x3002;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x662F;3D&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x4EFB;&#x4E00;&#x7269;&#x4F53;&#xFF08;&#x89D2;&#x8272;&#x3001;&#x5173;&#x5361;&#x3001;&#x58F0;&#x97F3;&#xFF09;&#xFF0C;&#x96F6;&#x4EF6;&#x5C31;&#x662F;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x6DFB;&#x52A0;&#x96F6;&#x4EF6;&#xFF1A;</p>
<p>&#x4ECE;&#x4E3B;&#x83DC;&#x5355;&#x680F;&#x9009;&#x62E9;GameObject&gt;Great Empty&#xFF0C;&#x5E76;&#x5728;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#xFF08;Hierarchy&#xFF09;&#x547D;&#x540D;&#x4E3A;&#x201C;Launcher&#x201D;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x7A7A;&#x7269;&#x4F53;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x662F;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x5B83;&#x6765;&#x4F5C;&#x653E;&#x7F6E;&#x98DE;&#x5F39;&#x53D1;&#x5C04;&#x5668;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x628A;&#x89C6;&#x91CE;&#x63A8;&#x8FD1;&#x5230;FPS&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x4FBF;&#x4E8E;&#x6211;&#x4EEC;&#x653E;&#x7F6E;&#x6B66;&#x5668;&#x53D1;&#x5C04;&#x5668;&#x3002;</p>
<p>&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x9009;&#x62E9;FPS&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x786E;&#x4FDD;&#x9F20;&#x6807;&#x5904;&#x4E8E;&#x573A;&#x666F;&#x89C6;&#x56FE;&#x4E2D;&#xFF0C;&#x6309;&#x201C;F&#x201D;&#x952E;&#x3002;&#x4F7F;&#x7A97;&#x53E3;&#x4EE5;&#x5F53;&#x524D;&#x9009;&#x62E9;&#x7684;&#x7269;&#x4F53;&#x4E3A;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x9009;&#x62E9;&#x53D1;&#x5C04;&#x5668;&#xFF0C;&#x4E3B;&#x83DC;&#x5355;&#x680F;&#x9009;&#x62E9;Game Object&gt;Move to view&#x3002;&#x6CE8;&#x610F;&#x53D1;&#x5C04;&#x5668;&#x5982;&#x4F55;&#x79FB;&#x52A8;&#x5230;FPS&#x63A7;&#x5236;&#x5668;&#x9644;&#x8FD1;&#x7684;&#x3002;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x624B;&#x67C4;&#xFF0C;&#x628A;&#x53D1;&#x5C04;&#x5668;&#x79FB;&#x52A8;&#x5230;&#x5927;&#x6982;&#x89D2;&#x8272;&#x624B;&#x90E8;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x7269;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#x6765;&#x8BBE;&#x5B9A;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x662F;&#x5DE6;&#x6487;&#x5B50;&#x8FD8;&#x662F;&#x53F3;&#x6487;&#x5B50;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5199;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4F7F;Unity&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x662F;&#x201C;2by3&#x201D;&#x6A21;&#x5F0F;&#xFF08;window&gt;Layouts&gt;2by3&#xFF09;&#xFF0C;&#x70B9;&#x51FB;&#x64AD;&#x653E;&#x952E;&#xFF08;play&#xFF09;&#x3002;&#x786E;&#x4FDD;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x70B9;&#x9009;&#x4E86;&#x53D1;&#x5C04;&#x5668;&#xFF0C;&#x56DB;&#x5904;&#x79FB;&#x52A8;&#x89D2;&#x8272;&#xFF0C;&#x540C;&#x65F6;&#x89C2;&#x5BDF;&#x573A;&#x666F;&#x7A97;&#x53E3;&#x3002;&#x4F60;&#x5C06;&#x53D1;&#x73B0;&#x53D1;&#x5C04;&#x5668;&#x5E76;&#x6CA1;&#x6709;&#x968F;&#x7740;&#x89D2;&#x8272;&#x4E00;&#x8D77;&#x8FD0;&#x52A8;&#xFF08;&#x73B0;&#x5728;&#x518D;&#x6B21;&#x70B9;&#x51FB;&#x64AD;&#x653E;&#x952E;&#x505C;&#x6B62;&#x8FD0;&#x884C;&#x6E38;&#x620F;&#xFF09;</p>
<p>&#x4E0B;&#x9762;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#xFF0C;&#x628A;&#x53D1;&#x5C04;&#x5668;&#x62D6;&#x653E;&#x5230;FPS&#x63A7;&#x5236;&#x5668;&#x4E0B;&#x9762;&#x7684;&#x4E3B;&#x6444;&#x50CF;&#x673A;&#x4E0A;&#x3002;&#x5F39;&#x51FA;&#x7684;&#x5BF9;&#x8BDD;&#x6846;&#x70B9;&#x51FB;&#x201C;&#x662F;&#x201D;&#x3002;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x6E38;&#x620F;&#xFF0C;&#x89C2;&#x5BDF;&#x573A;&#x666F;&#x7A97;&#x53E3;&#xFF0C;&#x53D1;&#x5C04;&#x5668;&#x5DF2;&#x7ECF;&#x548C;&#x89D2;&#x8272;&#x8FD0;&#x52A8;&#x4E00;&#x81F4;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x53D1;&#x5C04;&#x5668;&#x4E0E;&#x6444;&#x50CF;&#x673A;&#x5173;&#x8054;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x98DE;&#x5F39;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x521B;&#x5EFA;&#x5728;&#x73A9;&#x5BB6;&#x70B9;&#x51FB;&#x5F00;&#x706B;&#x952E;&#x65F6;&#x80FD;&#x591F;&#x53D1;&#x5C04;&#x51FA;&#x6765;&#x7684;&#x98DE;&#x5F39;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7269;&#x4F53;-&#x7403;&#x4F53;-&#x4EE3;&#x66FF;&#x98DE;&#x5F39;&#x3002;Unity&#x4E3B;&#x83DC;&#x5355;&#x680F;&#x70B9;&#x51FB;Assets&gt;Creat&gt;Prefab&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9884;&#x5236;&#xFF08;Prefab&#xFF09;&#x7269;&#x4F53;&#xFF0C;&#x547D;&#x540D;&#x4E3A;&#x201C;Missile&#x201D;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7403;&#x4F53;&#xFF08;GameObject&gt;Create Object&gt;Sphere&#xFF09;</p>
<p>&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#xFF0C;&#x62D6;&#x653E;&#x7403;&#x4F53;&#x5230;&#x98DE;&#x5F39;&#x9884;&#x5236;&#x7269;&#x4F53;&#x4E0A;&#xFF08;Missile&#xFF09;&#xFF0C;&#x8FD9;&#x65F6;&#x9884;&#x5236;&#x7269;&#x4F53;&#x56FE;&#x6807;&#x4F1A;&#x53D8;&#x5316;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x5220;&#x9664;&#x7403;&#x4F53;&#x3002;</p>
<p>&#x6280;&#x5DE7;&#xFF1A;&#x6E38;&#x620F;&#x8FD0;&#x884C;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x4EFB;&#x4F55;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;Prefab&#xFF09;&#x3002;</p>
<p>&#x7F16;&#x5199;&#x98DE;&#x5F39;&#x53D1;&#x5C04;&#x5668;&#x811A;&#x672C;</p>
<p>FPS&#x63A7;&#x5236;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E2A;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x548C;&#x90E8;&#x4EF6;&#x7684;&#x9884;&#x5236;&#x7269;&#x4F53;&#x3002;FPS&#x63A7;&#x5236;&#x5668;&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x80FD;&#x6CBF;Y&#x8F74;&#x65CB;&#x8F6C;&#x7684;&#x5706;&#x67F1;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x628A;&#x53D1;&#x5C04;&#x5668;&#x811A;&#x672C;&#x8D4B;&#x4E88;FPS&#x63A7;&#x5236;&#x5668;&#x7684;&#x8BDD;&#xFF0C;&#x662F;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#x4E0A;&#x4E0B;&#x5F00;&#x706B;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x628A;&#x811A;&#x672C;&#x8D4B;&#x4E88;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684;&#x80FD;&#x591F;&#x56DB;&#x5468;&#x8F6C;&#x52A8;&#x7684;&#x4E3B;&#x6444;&#x50CF;&#x673A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x7F16;&#x5199;&#x7B2C;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x53D1;&#x5C04;&#x5668;&#x884C;&#x4E3A;&#x7684;JavaScript&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x70B9;&#x51FB;Assets&gt;Greate&gt;JavaScript&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;JavaScript&#x6587;&#x6863;&#x3002;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x201C;NewBehaviourScript&#x201D;&#x8D44;&#x6E90;&#x5C06;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#xFF0C;&#x628A;&#x5B83;&#x66F4;&#x540D;&#x4E3A;&#x201C;MissileLauncher&#x201D;</p>
<p>&#x6280;&#x5DE7;&#xFF1A;&#x901A;&#x8FC7;Unity&gt;Preferences&#x70B9;&#x51FB;External Script Editor&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x5916;&#x90E8;&#x811A;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x3002;</p>
<p>&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x201C;WeaponScripts&#x201D;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x653E;&#x7F6E;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x6B66;&#x5668;&#x811A;&#x672C;&#x3002;&#x628A;MissileLauncher&#x811A;&#x672C;&#x548C;&#x98DE;&#x5F39;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;Missile Prefab&#xFF09;&#x62D6;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x98DE;&#x5F39;&#x53D1;&#x5C04;&#x5668;&#x7684;&#x5B8C;&#x6574;JavaScript&#x811A;&#x672C;&#x3002;</p>
<p>&#x8FDB;&#x4E00;&#x6B65;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x60F3;&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF1F;&#x6211;&#x4EEC;&#x8981;&#x68C0;&#x6D4B;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x6309;&#x4E86;&#x5F00;&#x706B;&#x952E;&#xFF0C;&#x7136;&#x540E;&#x4EA7;&#x751F;&#x4E00;&#x679A;&#x98DE;&#x5F39;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x6CBF;&#x7740;&#x73A9;&#x5BB6;&#x671D;&#x5411;&#x7684;&#x65B9;&#x5411;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x53D1;&#x5C04;&#x51FA;&#x53BB;&#x3002;&#x6211;&#x4EEC;&#x4ED4;&#x7EC6;&#x7684;&#x89E3;&#x5256;&#x4E00;&#x4E0B;&#x811A;&#x672C;&#xFF1A;</p>
<p>var projectile: Rigibody;</p>
<p>var speed=20;</p>
<p>function Update( )</p>
<p>{</p>
<p>&#x8FD9;&#x662F;&#x811A;&#x672C;&#x7684;&#x5F00;&#x5934;&#x90E8;&#x5206;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x5F00;&#x542F;&#x4E86;&#x201C;Update&#x201D;&#x7684;&#x529F;&#x80FD;</p>
<p>if(Input.GetButtonDown(&#x201C;Fire1&#x201D;))</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x68C0;&#x6D4B;&#x73A9;&#x5BB6;&#x662F;&#x5426;&#x6309;&#x4E86;&#x5F00;&#x706B;&#x952E;&#xFF0C;&#x201C;&#x5F00;&#x706B;1&#x201D;&#x6620;&#x5C04;&#x7684;&#x662F;&#x9F20;&#x6807;&#x5DE6;&#x952E;&#x548C;&#x5F53;&#x524D;&#x914D;&#x7F6E;&#x7684;&#x952E;&#x76D8;&#x4E0A;&#x7684;&#x6309;&#x952E;&#xFF08;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3B;&#x83DC;&#x5355;&#x680F;&#x7684;Editor&gt;Project Settings&gt;Input&#x8BBE;&#x5B9A;&#xFF09;</p>
<p>{</p>
<p>var instantiatedProjectile: Rigidbody=Instantiate(</p>
<p>projectile, transform.position,transform.rotation);</p>
<p>&#x6211;&#x4EEC;&#x7528;&#x53D8;&#x91CF;&#x6765;&#x5B9A;&#x4E49;&#x4EA7;&#x751F;&#x7684;&#x7269;&#x4F53;&#x3002;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x662F;Rigibody&#xFF08;&#x521A;&#x4F53;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x98DE;&#x5F39;&#x662F;&#x5177;&#x6709;&#x7269;&#x7406;&#x5C5E;&#x6027;&#x7684;&#x3002;</p>
<p>Unity&#x4E2D;&#x4EA7;&#x751F;&#x65B0;&#x7269;&#x4F53;&#x4F7F;&#x7528;&#x7684;&#x51FD;&#x6570;&#x662F;Instantiate&#xFF0C;&#x5B83;&#x6709;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x662F;&#xFF1A;&#x4EA7;&#x751F;&#x7684;&#x7269;&#x4F53;&#x3001;&#x4EA7;&#x751F;&#x7269;&#x4F53;&#x7684;3D&#x7A7A;&#x95F4;&#x4F4D;&#x7F6E;&#x3001;&#x7269;&#x4F53;&#x7684;&#x65CB;&#x8F6C;&#x3002;&#x5B83;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#xFF0C;&#x53C2;&#x7167;API&#x624B;&#x518C;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;projectile&#xFF0C;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x60F3;&#x521B;&#x5EFA;&#x7684;&#x7269;&#x4F53;&#x3002;&#x90A3;&#x4E48;&#x5230;&#x5E95;&#x53D1;&#x5C04;&#x4EC0;&#x4E48;&#x7269;&#x4F53;&#xFF1F;&#x5177;&#x4F53;&#x4EA7;&#x751F;&#x7684;&#x7269;&#x4F53;&#x662F;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x8BBE;&#x5B9A;&#x7684;&#x3002;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF1A;&#x628A;Projectile&#x5B9A;&#x4E49;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x53C2;&#x6570;&#x9762;&#x677F;&#x4E2D;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;&#x53D1;&#x5C04;&#x7684;&#x7269;&#x4F53;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x6765;&#x521B;&#x5EFA;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4F7F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x53EF;&#x8C03;&#x7684;&#x8BDD;&#xFF0C;&#x8FD8;&#x662F;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;transform.position&#xFF0C;&#x4F7F;&#x4EA7;&#x751F;&#x7684;&#x7269;&#x4F53;&#x4E0E;&#x53D1;&#x5C04;&#x5668;&#x7684;&#x7A7A;&#x95F4;&#x4F4D;&#x7F6E;&#x4E00;&#x81F4;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5C31;&#x662F;&#x53D1;&#x5C04;&#x5668;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x98DE;&#x5F39;&#x4EA7;&#x751F;&#x7684;&#x4F4D;&#x7F6E;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x811A;&#x672C;&#x5C31;&#x8981;&#x5173;&#x8054;&#x7ED9;&#x53D1;&#x5C04;&#x5668;&#x3002;&#xFF08;transform&#x8BFB;&#x53D6;&#x7684;transform&#x6570;&#x636E;&#x5C31;&#x662F;&#x88AB;&#x8D4B;&#x4E88;&#x811A;&#x672C;&#x7684;&#x6E38;&#x620F;&#x7269;&#x4F53;transform&#x6570;&#x636E;&#xFF09;</p>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;transform.rotation&#xFF0C;&#x4E0E;&#x7B2C;&#x4E8C;&#x4E2A;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x5B83;&#x7684;&#x503C;&#x4E0E;&#x53D1;&#x5C04;&#x5668;&#x7684;&#x65CB;&#x8F6C;&#x503C;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>instantiatedProjectile.Vellocity=</p>
<p>transform.TransformDirection(Vector3(0,0,speed));</p>
<p>&#x4EE3;&#x7801;&#x7684;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x4F7F;&#x98DE;&#x5F39;&#x4EA7;&#x751F;&#x8FD0;&#x52A8;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD0;&#x52A8;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8D4B;&#x4E88;&#x98DE;&#x5F39;&#x4E00;&#x4E2A;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#xFF08;X&#xFF0C;Y&#xFF0C;Z&#xFF09;&#x4EA7;&#x751F;&#x901F;&#x5EA6;&#x5462;&#xFF1F;&#x5728;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x70B9;&#x51FB;FPS&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x51FA;&#x73B0;&#x8FD0;&#x52A8;&#x7BAD;&#x5934;&#xFF08;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#xFF0C;&#x6309;&#x201C;W&#x201D;&#x952E;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7BAD;&#x5934;&#x662F;&#x7EA2;&#x8272;&#x3001;&#x4E00;&#x4E2A;&#x662F;&#x7EFF;&#x8272;&#x3001;&#x4E00;&#x4E2A;&#x662F;&#x84DD;&#x8272;&#x3002;&#x7EA2;&#x8272;&#x4EE3;&#x8868;X&#x8F74;&#xFF0C;&#x7EFF;&#x8272;&#x4EE3;&#x8868;Y&#x8F74;&#xFF0C;&#x84DD;&#x8272;&#x4EE3;&#x8868;Z&#x8F74;&#x3002;&#x56E0;&#x4E3A;&#x84DD;&#x8272;&#x6307;&#x5411;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4E0E;&#x73A9;&#x5BB6;&#x9762;&#x671D;&#x7684;&#x65B9;&#x5411;&#x4E00;&#x81F4;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x5728;Z&#x8F74;&#x4E0A;&#x7ED9;&#x98DE;&#x5F39;&#x4E00;&#x4E2A;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#xFF08;Velocity&#xFF09;&#x901F;&#x5EA6;&#x662F;instantiatedProjectile&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x7684;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;instantiatedProjectile&#x662F;&#x521A;&#x4F53;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x770B;API&#x624B;&#x518C;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x901F;&#x5EA6;&#x662F;&#x521A;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x770B;&#x770B;&#x521A;&#x4F53;&#x7684;&#x5176;&#x5B83;&#x5C5E;&#x6027;&#x3002;&#x8981;&#x8BBE;&#x7F6E;&#x901F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x5728;&#x5404;&#x4E2A;&#x8F74;&#x5411;&#x4E0A;&#x8BBE;&#x5B9A;&#x6570;&#x503C;&#x3002;&#x4F46;&#x8FD8;&#x6709;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#x3002;3D&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7269;&#x4F53;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x5750;&#x6807;&#x6A21;&#x578B;&#xFF1A;&#x672C;&#x5730;&#x5750;&#x6807;&#x7CFB;&#x548C;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x3002;&#x5728;&#x672C;&#x5730;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#xFF0C;&#x7269;&#x4F53;&#x7684;&#x8F74;&#x5411;&#x53EA;&#x4E0E;&#x7269;&#x4F53;&#x672C;&#x8EAB;&#x6709;&#x5173;&#x3002;&#x5728;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#xFF0C;&#x8F74;&#x5411;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x5411;&#x4E0A;&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x7269;&#x4F53;&#x6765;&#x8BB2;&#x5411;&#x4E0A;&#x7684;&#x65B9;&#x5411;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;Rigidbody.Vellocity&#x521A;&#x4F53;&#x7269;&#x4F53;&#x901F;&#x5EA6;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B9A;&#x4E49;&#x901F;&#x5EA6;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x672C;&#x5730;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;Z&#x8F74;&#xFF08;&#x671D;&#x524D;&#x7684;&#x65B9;&#x5411;&#xFF09;&#x5411;&#x8F6C;&#x6362;&#x6210;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x65B9;&#x5411;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x51FD;&#x6570;transform.TransformDirection&#xFF0C;&#x5B83;&#x6709;&#x4E09;&#x4E2A;&#x5411;&#x91CF;&#x4F5C;&#x4E3A;&#x81EA;&#x53D8;&#x91CF;&#x3002;&#x53D8;&#x91CF;speed&#x4E5F;&#x5E94;&#x8BE5;&#x5B9A;&#x4E49;&#x6210;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4FBF;&#x4E8E;&#x540E;&#x9762;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x76F4;&#x63A5;&#x8C03;&#x8282;&#x6570;&#x503C;&#x3002;</p>
<p>Physics.IgnoreCollision(instantiatedProjectile.collider,</p>
<p>transform.root.collider);</p>
<p>}</p>
<p>}</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5173;&#x95ED;&#x98DE;&#x5F39;&#x4E0E;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x78B0;&#x649E;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x8BDD;&#xFF0C;&#x98DE;&#x5F39;&#x4EA7;&#x751F;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x80FD;&#x4E0E;&#x89D2;&#x8272;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;&#x53EF;&#x4EE5;&#x5728;API&#x624B;&#x518C;IgnoreCollision&#x4E0B;&#x67E5;&#x8BE2;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<p>MissileLauncher.js&#x5168;&#x90E8;&#x5B8C;&#x6574;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>var projectile : Rigidbody;</p>
<p>var speed = 20;</p>
<p>function Update()</p>
<p>{</p>
<p>if( Input.GetButtonDown( &#x201C;Fire1&#x2033; ) )</p>
<p>{</p>
<p>var instantiatedProjectile : Rigidbody = Instantiate(</p>
<p>projectile, transform.position, transform.rotation );</p>
<p>instantiatedProjectile.velocity =</p>
<p>transform.TransformDirection( Vector3( 0, 0, speed ) );</p>
<p>Physics.IgnoreCollision( instantiatedProjectile. collider,</p>
<p>transform.root.collider );</p>
<p>}</p>
<p>}</p>
<p>&#x628A;&#x811A;&#x672C;MissileLauncher&#x8D4B;&#x4E88;FPS&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x7684;&#x53D1;&#x5C04;&#x5668;&#x3002;&#x5728;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x70B9;&#x51FB;&#x53D1;&#x5C04;&#x5668;&#xFF0C;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x53C2;&#x6570;&#x9762;&#x677F;&#x4E0B;&#x9762;&#x662F;&#x5426;&#x663E;&#x793A;&#x4E86;MissileLauncher script&#x3002;</p>
<p>&#x5148;&#x524D;&#x521B;&#x5EFA;&#x7684;&#x98DE;&#x5F39;&#x7684;&#x9884;&#x5236;&#x7269;&#x4F53;&#x8FD8;&#x6CA1;&#x6709;&#x4E0E;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x53D8;&#x91CF;projectile&#x521B;&#x5EFA;&#x5173;&#x8054;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E0B;&#x3002;&#x53D8;&#x91CF;projectile&#x53EA;&#x80FD;&#x4E0E;&#x521A;&#x4F53;&#x5173;&#x8054;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x8D4B;&#x4E88;&#x98DE;&#x5F39;&#x4E00;&#x4E2A;Rigidbody&#x3002;</p>
<p>&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x70B9;&#x51FB;&#x98DE;&#x5F39;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E3B;&#x83DC;&#x5355;&#x680F;&#x9009;&#x62E9;Components&gt;Physics&gt;Rigidbody&#x3002;&#x8FD9;&#x6837;&#x5C06;&#x4F1A;&#x7ED9;&#x6211;&#x4EEC;&#x60F3;&#x5F00;&#x706B;&#x53D1;&#x5C04;&#x7684;&#x98DE;&#x5F39;&#x4E00;&#x4E2A;&#x521A;&#x4F53;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x60F3;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x53D1;&#x5C04;&#x7684;&#x7269;&#x4F53;&#x7C7B;&#x578B;&#x4E0E;&#x811A;&#x672C;&#x4E2D;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#x8981;&#x6C42;&#x7684;&#x7269;&#x4F53;&#x7C7B;&#x578B;&#x662F;&#x540C;&#x4E00;&#x7C7B;&#x578B;&#x7684;&#x7269;&#x4F53;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x98DE;&#x5F39;&#x4E0E;&#x811A;&#x672C;&#x4E2D;&#x53D8;&#x91CF;projectile&#x7684;&#x94FE;&#x63A5;&#x3002;&#x9996;&#x5148;&#x5728;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x70B9;&#x51FB;&#x53D1;&#x5C04;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x98DE;&#x5F39;&#x7684;&#x9884;&#x5236;&#x7269;&#x4F53;&#x4ECE;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x62D6;&#x62FD;&#x653E;&#x7F6E;&#x5728;&#x53D1;&#x5C04;&#x5668;&#x53C2;&#x6570;&#x9762;&#x677F;&#x4E2D;MissileLauncher script&#x90E8;&#x5206;&#x4E0A;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x6E38;&#x620F;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x70B9;&#x51FB;&#x5F00;&#x706B;&#x952E;&#x53EF;&#x4EE5;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x53D7;&#x91CD;&#x529B;&#x5F71;&#x54CD;&#x7684;&#x5C0F;&#x7403;&#x4E86;&#x3002;</p>
<p>&#x98DE;&#x5F39;&#x7206;&#x70B8;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x5F53;&#x98DE;&#x5F39;&#x4E0E;&#x5176;&#x4ED6;&#x7269;&#x4F53;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x65F6;&#xFF0C;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x7206;&#x70B8;&#x6548;&#x679C;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x6548;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x6BB5;&#x65B0;&#x811A;&#x672C;&#x8D4B;&#x4E88;&#x98DE;&#x5F39;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x811A;&#x672C;&#xFF0C;&#x547D;&#x540D;&#x4E3A;Projectile&#x3002;&#x62D6;&#x653E;&#x5230;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x7684;WeaponScripts&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x811A;&#x672C;Projectile&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6548;&#x679C;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x8981;&#x68C0;&#x6D4B;&#x98DE;&#x5F39;&#x662F;&#x5426;&#x53D1;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x78B0;&#x649E;&#x70B9;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7206;&#x70B8;&#x6548;&#x679C;&#x3002;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>var explosion : GameObject;</p>
<p>function OnCollisionEnter( collision : Collision )</p>
<p>{</p>
<p>&#x51FD;&#x6570;OnCollisionEnter&#x5185;&#x7684;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA1;&#x7B97;&#x88AB;&#x8D4B;&#x4E88;&#x811A;&#x672C;&#x7684;&#x7269;&#x4F53;&#x662F;&#x5426;&#x4E0E;&#x5176;&#x4ED6;&#x7269;&#x4F53;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;</p>
<p>var contact: ContactPoint=collision.contacts[0];</p>
<p>&#x5728;&#x51FD;&#x6570;OnCollisionEnter&#x4E2D;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x662F;&#x8981;&#x5B9E;&#x73B0;&#x5728;3D&#x7A7A;&#x95F4;&#x4E2D;&#x98DE;&#x5F39;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x7684;&#x70B9;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7206;&#x70B8;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x4F55;&#x5904;&#x4E86;&#x78B0;&#x649E;&#x7684;&#x5462;&#xFF1F;&#x51FD;&#x6570;OnCollisionEnter&#x5C31;&#x6709;&#x4E2A;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x7684;&#x529F;&#x80FD;&#x3002;&#x78B0;&#x649E;&#x53D1;&#x751F;&#x7684;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#x50A8;&#x5B58;&#x5728;&#x53D8;&#x91CF;ContactPoint&#x4E2D;&#x3002;</p>
<p>var rotation=Quaternion.FromToRotation(Vector3.up,contact.normal);</p>
<p>var instantiatedExplosion:GameObject=Instantiate(</p>
<p>explosion,contact.point,rotation);</p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x51FD;&#x6570;Instantiate&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7206;&#x70B8;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x51FD;&#x6570;instatiate&#x6709;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#xFF08;1&#xFF09;&#x4EA7;&#x751F;&#x7684;&#x7269;&#x4F53;&#xFF08;2&#xFF09;&#x7269;&#x4F53;&#x7684;3D&#x7A7A;&#x95F4;&#x4F4D;&#x7F6E;&#xFF08;3&#xFF09;&#x7269;&#x4F53;&#x7684;&#x65CB;&#x8F6C;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x8D4B;&#x7ED9;&#x4E00;&#x4E2A;&#x5E26;&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x60F3;&#x901A;&#x8FC7;&#x7F16;&#x8F91;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x628A;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7206;&#x70B8;&#x4EA7;&#x751F;&#x7684;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C31;&#x662F;&#x78B0;&#x649E;&#x53D1;&#x751F;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7206;&#x70B8;&#x65CB;&#x8F6C;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x9700;&#x8981;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7206;&#x70B8;&#x4F53;&#x7684;Y&#x8F74;&#x65B9;&#x5411;&#x4E0E;&#x98DE;&#x5F39;&#x548C;&#x5176;&#x4ED6;&#x7269;&#x4F53;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x7684;&#x90A3;&#x4E2A;&#x8868;&#x9762;&#x7684;&#x6CD5;&#x7EBF;&#x65B9;&#x5411;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x662F;&#x5899;&#x9762;&#x90A3;&#x4E48;&#x7206;&#x70B8;&#x5C31;&#x9762;&#x5411;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5730;&#x677F;&#x5C31;&#x671D;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x8981;&#x4F7F;&#x7206;&#x70B8;&#x4F53;&#x5728;&#x672C;&#x5730;&#x5750;&#x6807;&#x7CFB;&#x7684;Y&#x8F74;&#x4E0E;&#x98DE;&#x5F39;&#x4E0E;&#x4E4B;&#x78B0;&#x649E;&#x7684;&#x7269;&#x4F53;&#x7684;&#x8868;&#x9762;&#x6CD5;&#x7EBF;&#x65B9;&#x5411;&#xFF08;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#xFF09;&#x4E00;&#x81F4;&#x3002;</p>
<p>Destroy&#xFF08;gameObject&#xFF09;;</p>
<p>}</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BA9;&#x98DE;&#x5F39;&#x78B0;&#x649E;&#x540E;&#x5C31;&#x4ECE;&#x6E38;&#x620F;&#x4E2D;&#x6D88;&#x5931;&#xFF0C;&#x901A;&#x8FC7;&#x51FD;&#x6570;Destroy&#xFF08;&#xFF09;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x662F;gameObject&#xFF08;gameObject&#x4EE3;&#x8868;&#x88AB;&#x8D4B;&#x4E88;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x7684;&#x7269;&#x4F53;&#xFF09;&#x3002;</p>
<p>Projectile.js&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>var explosion : GameObject;</p>
<p>function OnCollisionEnter( collision : Collision )</p>
<p>{</p>
<p>var contact : ContactPoint = collision.contacts[0];</p>
<p>var rotation = Quaternion.FromToRotation( Vector3.up, contact.normal );</p>
<p>var instantiatedExplosion : GameObject = Instantiate(</p>
<p>explosion, contact.point, rotation );</p>
<p>Destroy( gameObject );</p>
<p>}</p>
<p>&#x628A;&#x811A;&#x672C;&#x8D4B;&#x4E88;&#x98DE;&#x5F39;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;Missile prefab&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8981;&#x521B;&#x5EFA;&#x98DE;&#x5F39;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x65F6;&#x6240;&#x4EA7;&#x751F;&#x7206;&#x70B8;&#x7684;&#x7206;&#x70B8;&#x6548;&#x679C;&#x7269;&#x4F53;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;&#x547D;&#x540D;&#x4E3A;Explosion&#xFF09;&#x7528;&#x6765;&#x5B58;&#x653E;&#x7206;&#x70B8;&#x6548;&#x679C;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x6807;&#x51C6;&#x8D44;&#x6E90;&#x5305;&#x4E2D;&#xFF08;standard asset&#xFF09;&#x6709;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x7206;&#x70B8;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF0C;&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;&#x548C;&#x706F;&#x5149;&#x90FD;&#x8BBE;&#x7F6E;&#x597D;&#x4E86;&#x3002;&#x628A;&#x8FD9;&#x4E2A;&#x7206;&#x70B8;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;&#x5728;Standard Assets/Particles/explosion&#x4E2D;&#xFF09;&#x62D6;&#x653E;&#x5230;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x3002;</p>
<p>&#x8C03;&#x8282;&#x8FD9;&#x4E2A;&#x7206;&#x70B8;&#x6548;&#x679C;&#x7684;&#x5404;&#x4E2A;&#x53C2;&#x6570;&#x76F4;&#x5230;&#x4F60;&#x89C9;&#x5F97;&#x6EE1;&#x610F;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x4ECE;&#x5C42;&#x7EA7;&#x9762;&#x677F;&#x4E2D;&#x62D6;&#x653E;&#x5230;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x7684;&#x7206;&#x70B8;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;Explosion Prefab&#xFF09;&#x4E2D;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x628A;&#x7206;&#x70B8;&#x914D;&#x7F6E;&#x7ED9;&#x98DE;&#x5F39;&#xFF1A;</p>
<p>&#x70B9;&#x9009;&#x98DE;&#x5F39;&#x9884;&#x5236;&#x7269;&#x4F53;&#xFF08;Missile Prefab&#xFF09;&#xFF0C;&#x5728;&#x53C2;&#x6570;&#x9762;&#x677F;Explosion&#x53D8;&#x91CF;&#x680F;&#xFF0C;&#x62D6;&#x653E;&#x5DE5;&#x7A0B;&#x9762;&#x677F;&#x4E2D;&#x7684;&#x7206;&#x70B8;&#x5230;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x5B9A;&#x4E49;&#x7206;&#x70B8;&#x7684;&#x884C;&#x4E3A;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8981;&#x518D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x6765;&#x5B9A;&#x4E49;&#x7206;&#x70B8;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x811A;&#x672C;-Explosion&#xFF0C;&#x653E;&#x5728;Weapons&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#xFF0C;&#x53CC;&#x51FB;&#x811A;&#x672C;&#x8FDB;&#x884C;&#x7F16;&#x8F91;&#x3002;</p>
<p>&#x811A;&#x672C;&#x4E2D;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x7528;&#x51FD;&#x6570;&#x79F0;&#x4E3A;Start&#xFF08;&#xFF09;&#x3002;&#x5F53;&#x5B83;&#x914D;&#x7F6E;&#x7ED9;&#x7684;&#x7269;&#x4F53;&#x662F;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x51FD;&#x6570;Start&#xFF08;&#xFF09;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x88AB;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x5220;&#x9664;&#x7206;&#x70B8;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x51FD;&#x6570;Destroy&#xFF08;&#xFF09;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5B9A;&#x4E49;&#x6267;&#x884C;&#x5220;&#x9664;&#x524D;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#x3002;</p>
<p>var explosionTime=1.0;</p>
<p>function Start( )</p>
<p>{</p>
<p>Destroy(gameObject,explosionTime);</p>
<p>}</p>
<p>&#x53D8;&#x91CF;explosionTime&#x8BBE;&#x7F6E;&#x6210;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x65B9;&#x4FBF;&#x8C03;&#x8282;&#x3002;</p>
<p>&#x65B0;&#x5EFA;&#x811A;&#x672C;&#x63D2;&#x5165;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x8981;&#x5220;&#x9664;&#x51FD;&#x6570;Update&#xFF08;&#xFF09;&#x3002;</p>
<p>&#x628A;&#x811A;&#x672C;Explosion&#x8D4B;&#x4E88;&#x7ED9;&#x7206;&#x70B8;&#x9884;&#x5236;&#x7269;&#x4F53;&#x3002;</p>
<p>&#x97F3;&#x6548;</p>
<p>&#x76EE;&#x524D;&#x7684;&#x6E38;&#x620F;&#x4E16;&#x754C;&#x592A;&#x5B89;&#x9759;&#x4E86;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7ED9;&#x7206;&#x70B8;&#x6548;&#x679C;&#x589E;&#x52A0;&#x70B9;&#x97F3;&#x6548;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7ED9;&#x7206;&#x70B8;&#x9884;&#x5236;&#xFF08;Prefab&#xFF09;&#x6DFB;&#x52A0;&#x4E00;&#x6BB5;&#x97F3;&#x9891;&#x3002;</p>
<p>&#x7ED9;&#x7206;&#x70B8;&#x6DFB;&#x52A0;&#x97F3;&#x6548;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x97F3;&#x6E90;&#x90E8;&#x4EF6;&#xFF08;Audio Source&#xFF09;&#xFF0C;&#x5728;&#x4E3B;&#x83DC;&#x5355;&#x70B9;&#x51FB;Component&#x2014;Audio&#x2014;Audio Source&#x3002;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x97F3;&#x6E90;&#x90E8;&#x4EF6;&#x6709;&#x4E00;&#x4E2A;Audio Clip&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x628A;&#x201C;RocketLauncherImpact&#x201D;&#x97F3;&#x6548;&#x6DFB;&#x52A0;&#x7ED9;&#x7206;&#x70B8;&#x9884;&#x5236;&#x4F53;&#x7684;AudioClip&#x5916;&#x90E8;&#x53D8;&#x91CF;&#x3002;Unity&#x652F;&#x6301;&#x591A;&#x79CD;&#x97F3;&#x9891;&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x6E38;&#x620F;&#xFF0C;&#x53D1;&#x5C04;&#x98DE;&#x5F39;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x58F0;&#x97F3;&#x4E86;&#xFF01;</p>
<p>&#x6DFB;&#x52A0;&#x56FE;&#x5F62;&#x754C;&#x9762;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x6DFB;&#x52A0;GUI&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x5934;&#x90E8;&#x663E;&#x793A;&#x8BBE;&#x5907;&#xFF08;&#xFF28;&#xFF35;&#xFF24;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#xFF27;&#xFF35;&#xFF29;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x4E00;&#x4E2A;&#x51C6;&#x661F;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x51C6;&#x661F;&#xFF1A;</p>
<p>&#x5DE5;&#x7A0B;&#x680F;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#xFF27;&#xFF35;&#xFF29;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x811A;&#x672C;&#xFF0C;&#x547D;&#x540D;&#x4E3A;&#x201C;&#x51C6;&#x661F;&#x201D;&#xFF08;&#xFF23;&#xFF52;&#xFF4F;&#xFF53;&#xFF53;&#xFF48;&#xFF41;&#xFF49;&#xFF52;&#xFF09;&#xFF0C;&#x62D6;&#x5230;&#xFF27;&#xFF35;&#xFF29;&#x6587;&#x4EF6;&#x5939;&#x3002;</p>
<p>&#xFF23;&#xFF52;&#xFF4F;&#xFF53;&#xFF53;&#xFF48;&#xFF41;&#xFF49;&#xFF52;&#x4E2D;&#x5199;&#x5165;&#x4E0B;&#x9762;&#x7684;&#x811A;&#x672C;&#xFF1A;</p>
<p>var crosshairTexture:Texture2D;</p>
<p>var position:Rect;</p>
<p>function Start( )</p>
<p>{</p>
<p>position=Rect((Screen .with-crosshairTexture.with)/2,(Screen.height-crosshairTexture.height)/2,crosshairTexture,crosshairTexture.height);</p>
<p>}</p>
<p>function OnGUI( )</p>
<p>{</p>
<p>Gui.DrawTexture(position,crosshairTexture);</p>
<p>}</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8BBE;&#x5B9A;&#x4E86;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x7528;&#x53EF;&#x9009;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x9009;&#x62E9;&#x56FE;&#x5F62;&#x7EB9;&#x7406;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x5F62;&#x533A;&#x95F4;&#xFF0C;&#x5B83;&#x662F;&#x56FE;&#x5F62;&#x7EB9;&#x7406;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x4F4D;&#x7F6E;&#x8303;&#x56F4;&#x3002;</p>
<p>&#x5728;start( ) &#x4E2D;&#x51FD;&#x6570;&#x7528;&#x6765;&#x8BBE;&#x5B9A;&#x56FE;&#x5F62;&#x7EB9;&#x7406;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6709;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x65B9;&#x5F62;&#x533A;&#x57DF;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x4F4D;&#x7F6E;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5B9A;&#x4E49;&#x4E86;&#x65B9;&#x5F62;&#x533A;&#x57DF;&#x7684;&#x5DE6;&#x8FB9;&#x6846;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5E95;&#x8FB9;&#x6846;&#xFF0C;&#x7B2C;&#x4E09;&#x548C;&#x7B2C;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x5B9A;&#x4E49;&#x4E86;&#x5BBD;&#x548C;&#x9AD8;&#x3002;</p>
<p>OnGUI( )&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;GUI&#x7C7B;&#x7A0B;&#x5E8F;&#x6765;&#x8BA9;&#x56FE;&#x5F62;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x3002;DrawTexture( )&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;position&#x548C;crosshairTexture&#x5C06;&#x4F7F;&#x51C6;&#x661F;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x7684;&#x4E2D;&#x592E;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4FDD;&#x5B58;&#x811A;&#x672C;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7A7A;&#x7269;&#x4F53;&#xFF0C;&#x547D;&#x540D;&#x4E3A;&#x201C;GUI&#x201D;&#x3002;</p>
<p>&#x628A;&#x811A;&#x672C;&#x201C;Crosshair&#x201D;&#x8D4B;&#x4E88;&#x7ED9;GUI&#x7269;&#x4F53;&#x3002;</p>
<p>&#x70B9;&#x9009;GUI&#x7269;&#x4F53;&#xFF0C;&#x628A;&#x5728;&#x6587;&#x4EF6;&#x5939;Texturelaim&#x4E0B;&#x7684;&#x6B32;&#x4F7F;&#x7528;&#x7684;&#x56FE;&#x5F62;&#x62D6;&#x653E;&#x5230;&#x53C2;&#x6570;&#x9762;&#x677F;&#x53D8;&#x91CF;Crosshair Texture&#x4E2D;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x6E38;&#x620F;&#xFF0C;&#x5C4F;&#x5E55;&#x4E2D;&#x5C31;&#x4F1A;&#x6709;&#x51C6;&#x661F;&#x663E;&#x793A;&#x4E86;&#x3002;</p>
<p>&#x7269;&#x7406;&#x7279;&#x6548;&#xFF1A;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x7269;&#x4F53;&#x6548;&#x679C;&#x8D8A;&#x771F;&#x5B9E;&#x8D8A;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x7269;&#x7406;&#x7279;&#x6548;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x7269;&#x4F53;&#xFF0C;&#x4ED6;&#x4EEC;&#x80FD;&#x88AB;&#x98DE;&#x5F39;&#x51FB;&#x4E2D;&#x540E;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x53CD;&#x5E94;&#x3002;&#x9996;&#x5148;&#x6709;&#x51E0;&#x4E2A;&#x65B0;&#x6982;&#x5FF5;&#x8981;&#x89E3;&#x91CA;&#x4E0B;&#x3002;</p>
<p>&#x6821;&#x6B63;&#xFF08;Update&#xFF09;</p>
<p>&#x5148;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x51FD;&#x6570;Update&#xFF08;&#xFF09;&#x4E2D;&#x5199;&#x5165;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x6267;&#x884C;&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5176;&#x4E2D;&#x6709;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x68C0;&#x6D4B;&#x73A9;&#x5BB6;&#x70B9;&#x51FB;&#x5F00;&#x706B;&#x952E;&#x3002;&#x5E27;&#x901F;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x503C;&#xFF0C;&#x5B83;&#x662F;&#x6839;&#x636E;&#x573A;&#x666F;&#x590D;&#x6742;&#x5EA6;&#x7B49;&#x56E0;&#x7D20;&#x6765;&#x5B9A;&#x7684;&#x3002;&#x5404;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x5DEE;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x7269;&#x4F53;&#x53CD;&#x5E94;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x5728;&#x573A;&#x666F;&#x4E2D;&#x6DFB;&#x52A0;&#x6709;&#x7269;&#x7406;&#x53CD;&#x5E94;&#x7684;&#x7269;&#x4F53;&#xFF08;&#x521A;&#x4F53;&#x7B49;&#xFF09;&#xFF0C;&#x4EE3;&#x7801;&#x5C31;&#x5E94;&#x8BE5;&#x5199;&#x5728;&#x51FD;&#x6570;FixedUpdate&#xFF08;&#xFF09;&#x4E2D;&#x3002;Unity&#x4E2D;deltaTime&#x7684;&#x503C;&#x7528;&#x6765;&#x6D4B;&#x5B9A;&#x6E32;&#x67D3;&#x4E24;&#x4E2A;&#x8FDE;&#x7EED;&#x5E27;&#x7684;&#x6240;&#x7528;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x51FD;&#x6570;Update&#x4E0E;FixedUpdate&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>Update&#xFF08;&#xFF09;-&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x89D2;&#x8272;&#x884C;&#x4E3A;&#x3001;&#x6E38;&#x620F;&#x903B;&#x8F91;&#x7B49;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x7684;deltaTime&#x503C;&#x5E76;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;</p>
<p>FixedUpdate&#xFF08;&#xFF09;-&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x521A;&#x4F53;&#x7269;&#x4F53;&#xFF08;&#x7269;&#x7406;&#x5C5E;&#x6027;&#x7684;&#x884C;&#x4E3A;&#xFF09;&#x3002;&#x51FD;&#x6570;&#x4E2D;deltaTime&#x7684;&#x503C;&#x901A;&#x5E38;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;</p>
<p>FixedUpdate&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x9891;&#x7387;&#x662F;&#x4E3B;&#x83DC;&#x5355;&#x4E2D;Edit-Project Settings-Time&#x7684;FixedTimestep&#x5C5E;&#x6027;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x7684;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5C5E;&#x6027;Time Scale&#x662F;&#x8BFB;&#x53D6;&#x6BCF;&#x79D2;&#x7684;&#x5E27;&#x901F;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x5012;&#x6570;&#x503C;&#x3002;</p>
<p>&#x6280;&#x5DE7;&#xFF1A;&#x5B9A;&#x4E49;FixedTimestep&#x503C;&#x65F6;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x628A;&#x63E1;&#x597D;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF1A;&#x503C;&#x8D8A;&#x5C0F;&#xFF0C;&#x7269;&#x7406;&#x6548;&#x679C;&#x8D8A;&#x771F;&#x5B9E;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x5F71;&#x54CD;&#x6E38;&#x620F;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x3002;&#x5E94;&#x8BE5;&#x540C;&#x65F6;&#x786E;&#x4FDD;&#x6E38;&#x620F;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x548C;&#x7269;&#x7406;&#x6548;&#x679C;&#x7684;&#x771F;&#x5B9E;&#x6027;&#x3002;</p>
<p>&#x6700;&#x540E;&#x8BF4;&#x4E00;&#x4E0B;yield&#xFF0C;&#x5B83;&#x76F8;&#x5F53;&#x4E8E;&#x6682;&#x505C;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#xFF1A;</p>
<p>&#x4F7F;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x53D1;&#x5C04;&#x98DE;&#x5F39;&#xFF08;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x98DE;&#x5F39;&#x4E0E;&#x5176;&#x5B83;&#x521A;&#x4F53;&#x7269;&#x4F53;&#x53D1;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x68C0;&#x6D4B;&#x5176;&#x8303;&#x56F4;&#x7C7B;&#x662F;&#x5426;&#x6709;&#x5176;&#x5B83;&#x88AB;&#x8D4B;&#x4E88;&#x521A;&#x4F53;&#x5C5E;&#x6027;&#x7684;&#x7269;&#x4F53;&#x3002;</p>
<p>&#x5BF9;&#x7206;&#x70B8;&#x51B2;&#x51FB;&#x529B;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6BCF;&#x4E2A;&#x521A;&#x4F53;&#x7269;&#x4F53;&#xFF0C;&#x5747;&#x7ED9;&#x4E88;&#x4E00;&#x4E2A;upwards&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x529B;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x5BF9;&#x98DE;&#x5F39;&#x4EA7;&#x751F;&#x53CD;&#x5E94;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x7206;&#x70B8;&#x811A;&#x672C;&#xFF08;Explosion Javascript&#xFF09;</p>
<p>var explosionTime = 1.0;</p>
<p>var explosionRadius = 5.0;</p>
<p>var explosionPower = 2000.0;</p>
<p>function Start()</p>
<p>{</p>
<p>//Destroy the explosion in x seconds,</p>
<p>//this will give the particle system and audio enough time to finish playing</p>
<p>Destroy( gameObject, explosionTime );</p>
<p>//Find all nearby colliders</p>
<p>var colliders : Collider[] = Physics.OverlapSphere( transform.position,</p>
<p>explosionRadius );</p>
<p>&#x9996;&#x5148;&#x68C0;&#x6D4B;&#x4E0B;&#x98DE;&#x5F39;&#x843D;&#x70B9;&#x5468;&#x56F4;&#x662F;&#x5426;&#x6709;&#x5E26;&#x78B0;&#x649E;&#x5668;&#x7684;&#x7269;&#x4F53;&#x3002;&#x51FD;&#x6570;Physics.OverlapSphere&#xFF08;&#xFF09;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;3D&#x4F4D;&#x7F6E;&#x548C;&#x534A;&#x5F84;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x4E00;&#x7EC4;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x5728;&#x534A;&#x5F84;&#x5185;&#x7684;&#x78B0;&#x649E;&#x5668;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>//Apply a force to all surrounding rigid bodies.</p>
<p>for( var hit in colliders )</p>
<p>{</p>
<p>&#x4E00;&#x65E6;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x6570;&#x7EC4;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x5BF9;&#x6BCF;&#x4E2A;&#x5BF9;&#x5E94;&#x78B0;&#x649E;&#x5668;&#x7684;&#x521A;&#x4F53;&#x7269;&#x4F53;&#x4E00;&#x4E2A;&#x5728;&#x7279;&#x5B9A;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x529B;&#x3002;</p>
<p>if( hit.rigidbody )</p>
<p>{</p>
<p>hit.rigidbody.AddExplosionForce( explosionPower,</p>
<p>transform.position, explosionRadius );</p>
<p>}</p>
<p>}</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x98DE;&#x5F39;&#x7684;&#x70B8;&#x70B9;&#x5904;&#xFF0C;&#x5411;&#x4E0A;&#x7684;&#x65B9;&#x5411;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x529B;&#xFF08;ExplosionPower&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7206;&#x70B8;&#x6548;&#x679C;&#x662F;&#x968F;&#x7740;&#x8DDD;&#x79BB;&#x800C;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x4F5C;&#x7528;&#x529B;&#x5927;&#x5C0F;&#x4E0D;&#x80FD;&#x5728;&#x6574;&#x4E2A;&#x534A;&#x5F84;&#x5185;&#x90FD;&#x4E00;&#x6837;&#x3002;&#x5706;&#x5468;&#x4F4D;&#x7F6E;&#x7684;&#x521A;&#x4F53;&#x7269;&#x4F53;&#x53D7;&#x5230;&#x7684;&#x4F5C;&#x7528;&#x529B;&#x5E94;&#x8BE5;&#x6BD4;&#x70B8;&#x70B9;&#x4E2D;&#x5FC3;&#x5904;&#x5C0F;&#x3002;&#x51FD;&#x6570;&#x628A;&#x8FD9;&#x79CD;&#x6548;&#x679C;&#x4E5F;&#x8003;&#x8651;&#x5728;&#x5185;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x8282;&#x5916;&#x90E8;&#x53D8;&#x91CF;explosionPower&#x548C;explosionRadius&#x7684;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x5F97;&#x5230;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>//If we have a particle emitter attached, emit particles for .5 seconds</p>
<p>if( particleEmitter )</p>
<p>{</p>
<p>particleEmitter.emit = true;</p>
<p>yield WaitForSeconds( 0.5 );</p>
<p>particleEmitter.emit = false;</p>
<p>}</p>
<p>}</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C92;&#x5B50;&#x53D1;&#x5C04;&#x5668;&#x4E5F;&#x6DFB;&#x52A0;&#x5230;&#x4E86;&#x7206;&#x70B8;&#x9884;&#x5236;&#x4E2D;&#x7684;&#x8BDD;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x53D1;&#x5C04;&#x7C92;&#x5B50;&#xFF0C;0.5&#x79D2;&#x540E;&#x505C;&#x6B62;&#x53D1;&#x5C04;&#xFF08;yield&#xFF09;&#x3002;</p>
<p>&#x5B8C;&#x6574;&#x7206;&#x70B8;&#x811A;&#x672C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>var explosionTime = 1.0;</p>
<p>var explosionRadius = 5.0;</p>
<p>var explosionPower = 2000.0;</p>
<p>function Start()</p>
<p>{</p>
<p>//Destroy the explosion in x seconds,</p>
<p>//this will give the particle system and audio enough time to finish playing</p>
<p>Destroy( gameObject, explosionTime );</p>
<p>//Find all nearby colliders</p>
<p>var colliders : Collider[] = Physics.OverlapSphere( transform.position,</p>
<p>explosionRadius );</p>
<p>//Apply a force to all surrounding rigid bodies.</p>
<p>for( var hit in colliders )</p>
<p>{</p>
<p>if( hit.rigidbody )</p>
<p>{</p>
<p>hit.rigidbody.AddExplosionForce( explosionPower,</p>
<p>transform.position, explosionRadius );</p>
<p>}</p>
<p>}</p>
<p>//If we have a particle emitter attached, emit particles for .5 seconds</p>
<p>if( particleEmitter )</p>
<p>{</p>
<p>particleEmitter.emit = true;</p>
<p>yield WaitForSeconds( 0.5 );</p>
<p>particleEmitter.emit = false;</p>
<p>}</p>
<p>}</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/05/14/Unity3D第一人称射击游戏(推荐)/" data-id="cj5xkn8nf003qdss6ategc4vx" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Unity3D/">Unity3D</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/05/14/微信内置浏览器的JsAPI/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          微信内置浏览器的JsAPI
        
      </div>
    </a>
  
  
    <a href="/2016/05/14/Android-功能开发笔记/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Android_功能开发笔记</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android/">Android</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-UI/">Android UI</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android反编译/">Android反编译</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Http请求流程/">Http请求流程</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/IDE/">IDE</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Java/">Java</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/JavaWeb/">JavaWeb</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Jenkins/">Jenkins</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/android/">android</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/idea/">idea</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/mac/">mac</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/互联网/">互联网</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/产品/">产品</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/代理/">代理</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/兴趣/">兴趣</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/区块链和比特币/">区块链和比特币</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/博客/">博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/大牛博客/">大牛博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/学习，师傅/">学习，师傅</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/开源项目/">开源项目</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/微信-Js/">微信 Js</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/心情/">心情</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/感触一波/">感触一波</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/简历/">简历</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/自动化测试/">自动化测试</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/面试/">面试</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/鸡汤/">鸡汤</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/黑客攻防/">黑客攻防</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Android/" style="font-size: 20px;">Android</a> <a href="/tags/Android-UI/" style="font-size: 10px;">Android UI</a> <a href="/tags/Android反编译/" style="font-size: 10px;">Android反编译</a> <a href="/tags/Http请求流程/" style="font-size: 10px;">Http请求流程</a> <a href="/tags/IDE/" style="font-size: 10px;">IDE</a> <a href="/tags/Java/" style="font-size: 15px;">Java</a> <a href="/tags/JavaWeb/" style="font-size: 17.5px;">JavaWeb</a> <a href="/tags/Jenkins/" style="font-size: 12.5px;">Jenkins</a> <a href="/tags/Linux/" style="font-size: 12.5px;">Linux</a> <a href="/tags/Unity3D/" style="font-size: 15px;">Unity3D</a> <a href="/tags/android/" style="font-size: 10px;">android</a> <a href="/tags/idea/" style="font-size: 10px;">idea</a> <a href="/tags/mac/" style="font-size: 10px;">mac</a> <a href="/tags/互联网/" style="font-size: 10px;">互联网</a> <a href="/tags/产品/" style="font-size: 15px;">产品</a> <a href="/tags/代理/" style="font-size: 10px;">代理</a> <a href="/tags/兴趣/" style="font-size: 10px;">兴趣</a> <a href="/tags/区块链和比特币/" style="font-size: 10px;">区块链和比特币</a> <a href="/tags/博客/" style="font-size: 12.5px;">博客</a> <a href="/tags/大牛博客/" style="font-size: 10px;">大牛博客</a> <a href="/tags/学习，师傅/" style="font-size: 10px;">学习，师傅</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/微信-Js/" style="font-size: 10px;">微信 Js</a> <a href="/tags/心情/" style="font-size: 10px;">心情</a> <a href="/tags/感触一波/" style="font-size: 10px;">感触一波</a> <a href="/tags/简历/" style="font-size: 10px;">简历</a> <a href="/tags/自动化测试/" style="font-size: 10px;">自动化测试</a> <a href="/tags/面试/" style="font-size: 12.5px;">面试</a> <a href="/tags/鸡汤/" style="font-size: 10px;">鸡汤</a> <a href="/tags/黑客攻防/" style="font-size: 12.5px;">黑客攻防</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Arkiv</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">八月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/06/">六月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">二月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Siste innlegg</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/08/04/《风味APP》产品策划方案/">《风味APP》产品策划方案</a>
          </li>
        
          <li>
            <a href="/2017/08/04/《蜗牛APP》产品策划方案/">《蜗牛APP》产品策划方案</a>
          </li>
        
          <li>
            <a href="/2017/08/04/《泼猴APP》产品策划方案/">《泼猴APP》产品策划方案</a>
          </li>
        
          <li>
            <a href="/2017/08/04/《风华APP》产品策划方案/">《风华APP》产品策划方案</a>
          </li>
        
          <li>
            <a href="/2017/06/27/Android 面试点/">Android 面试知识点</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 huanxingxyz<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>