<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>《Effective java》-----读书笔记 | 田鹏飞的个人博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="2015&amp;#x5E74;&amp;#x8FDB;&amp;#x6B65;&amp;#x5F88;&amp;#x5C0F;&amp;#xFF0C;&amp;#x770B;&amp;#x7684;&amp;#x4E66;&amp;#x4E5F;&amp;#x4E0D;&amp;#x662F;&amp;#x5F88;&amp;#x591A;&amp;#xFF0C;&amp;#x611F;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x90FD;&amp;#x8981;&amp;#x5E9F;&amp;#x4E86;&amp;#xFF0C;201">
<meta name="keywords" content="Java">
<meta property="og:type" content="article">
<meta property="og:title" content="《Effective java》-----读书笔记">
<meta property="og:url" content="http://yoursite.com/2016/08/18/读书笔记《Effective java》/index.html">
<meta property="og:site_name" content="田鹏飞的个人博客">
<meta property="og:description" content="2015&amp;#x5E74;&amp;#x8FDB;&amp;#x6B65;&amp;#x5F88;&amp;#x5C0F;&amp;#xFF0C;&amp;#x770B;&amp;#x7684;&amp;#x4E66;&amp;#x4E5F;&amp;#x4E0D;&amp;#x662F;&amp;#x5F88;&amp;#x591A;&amp;#xFF0C;&amp;#x611F;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x90FD;&amp;#x8981;&amp;#x5E9F;&amp;#x4E86;&amp;#xFF0C;201">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-09-30T08:32:57.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《Effective java》-----读书笔记">
<meta name="twitter:description" content="2015&amp;#x5E74;&amp;#x8FDB;&amp;#x6B65;&amp;#x5F88;&amp;#x5C0F;&amp;#xFF0C;&amp;#x770B;&amp;#x7684;&amp;#x4E66;&amp;#x4E5F;&amp;#x4E0D;&amp;#x662F;&amp;#x5F88;&amp;#x591A;&amp;#xFF0C;&amp;#x611F;&amp;#x89C9;&amp;#x81EA;&amp;#x5DF1;&amp;#x90FD;&amp;#x8981;&amp;#x5E9F;&amp;#x4E86;&amp;#xFF0C;201">
  
    <link rel="alternate" href="/atom.xml" title="田鹏飞的个人博客" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">田鹏飞的个人博客</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">你若盛开，蝴蝶自来</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-读书笔记《Effective java》" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/08/18/读书笔记《Effective java》/" class="article-date">
  <time datetime="2016-08-18T14:57:12.000Z" itemprop="datePublished">2016-08-18</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      《Effective java》-----读书笔记
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <hr>
<p>2015&#x5E74;&#x8FDB;&#x6B65;&#x5F88;&#x5C0F;&#xFF0C;&#x770B;&#x7684;&#x4E66;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x90FD;&#x8981;&#x5E9F;&#x4E86;&#xFF0C;2016&#x662F;&#x6C89;&#x6DC0;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x5E74;&#x4E2D;&#x8981;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x3001;&#x770B;&#x4E66;&#xFF0C;&#x52AA;&#x529B;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#xFF01;&#x9884;&#x8BA1;&#x5728;2016&#x5E74;&#x8981;&#x770B;12&#x672C;&#x4E66;&#xFF0C;&#x4E3B;&#x8981;&#x6D89;&#x53CA;java&#x57FA;&#x7840;&#x3001;Spring&#x7814;&#x7A76;&#x3001;java&#x5E76;&#x53D1;&#x3001;JVM&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x5728;&#x4ECA;&#x5E74;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x6DF1;&#x53D7;&#x6253;&#x51FB;&#xFF0C;&#x5230;&#x5904;&#x90FD;&#x662F;&#x95EE;&#x5206;&#x5E03;&#x5F0F;&#x3001;&#x96C6;&#x7FA4;&#x7684;&#xFF1F;&#x96BE;&#x9053;&#x73B0;&#x5728;&#x5DE5;&#x4F5C;&#x4E24;&#x4E09;&#x5E74;&#x7684;&#x90FD;&#x8FD9;&#x4E48;&#x725B;&#x903C;&#x4E86;&#xFF1F;&#x90FD;&#x5728;&#x641E;&#x5206;&#x5E03;&#x5F0F;&#x3001;&#x96C6;&#x7FA4;&#x4E4B;&#x7C7B;&#x7684;&#xFF1F;<br>2016&#x4E66;&#x5355;&#x5982;&#x4E0B;&#xFF1A;<br>1&#x3001;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x2014;&#xFF08;&#x5DF2;&#x770B;&#xFF0C;&#x9884;&#x8BA1;&#x4ECA;&#x5E74;&#x770B;&#x4E09;&#x904D;&#xFF09;<br>2&#x3001;Oracle&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x6539;&#x5199;&#x6280;&#x5DE7;&#x4E0E;&#x6848;&#x4F8B;&#x2014;&#xFF08;&#x5DF2;&#x770B;&#xFF09;<br>3&#x3001;Effective Java&#x2014;&#xFF08;&#x5DF2;&#x770B;&#xFF09;<br>4&#x3001;Spring3.x&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x5B9E;&#x6218;<br>5&#x3001;Spring&#x6280;&#x672F;&#x5185;&#x5E55;&#xFF1A;&#x6DF1;&#x5165;&#x89E3;&#x6790;Spring&#x67B6;&#x6784;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x2014;&#xFF08;&#x8FD9;&#x672C;&#x4E66;&#x5728;&#x53BB;&#x5E74;&#x5DF2;&#x7ECF;&#x770B;&#x4E86;&#x4E00;&#x904D;&#x4E86;&#xFF0C;&#x4ECA;&#x5E74;&#x5728;&#x597D;&#x597D;&#x7814;&#x7A76;&#x4E0B;&#xFF09;<br>6&#x3001;Java&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x827A;&#x672F;<br>7&#x3001;Java&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x5B9E;&#x6218;&#x2014;&#xFF08;&#x8FD9;&#x672C;&#x4E66;&#x5728;&#x53BB;&#x5E74;&#x5DF2;&#x7ECF;&#x770B;&#x4E86;&#x4E00;&#x904D;&#x4E86;&#xFF0C;&#x4ECA;&#x5E74;&#x5728;&#x597D;&#x597D;&#x7814;&#x7A76;&#x4E0B;&#xFF09;<br>8&#x3001;&#x578B;&#x7F51;&#x7AD9;&#x7CFB;&#x7EDF;&#x4E0E;Java&#x4E2D;&#x95F4;&#x4EF6;&#x5B9E;&#x8DF5;<br>9&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x6846;&#x67B6;&#x539F;&#x7406;&#x4E0E;&#x5B9E;&#x8DF5;<br>10&#x3001;&#x5927;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7AD9;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x8DF5;<br>11&#x3001;&#x4ECE;Paxos&#x5230;Zookeeper&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x539F;&#x7406;&#x4E0E;&#x5B9E;&#x8DF5;<br>12&#x3001;&#x9AD8;&#x6027;&#x80FD;mysql<br>&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x770B;&#x5B8C;&#x4E86;&#x4E09;&#x672C;&#x4E66;&#xFF1A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3001;Oracle&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x6539;&#x5199;&#x6280;&#x5DE7;&#x4E0E;&#x6848;&#x4F8B;&#x3001;Effective Java&#x3002;&#x5176;&#x4E2D;&#x6DF1;&#x5165;&#x7406;&#x89E3;jvm&#x8FD9;&#x672C;&#x4E66;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x672C;&#x795E;&#x4E66;&#xFF0C;&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x771F;&#x7684;&#x6709;&#x79CD;&#x8C41;&#x7136;&#x5F00;&#x6717;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x671F;&#x5F85;&#x4E09;&#x904D;&#x4E4B;&#x540E;&#x7ED9;&#x6211;&#x918D;&#x9190;&#x704C;&#x9876;&#x7684;&#x611F;&#x89C9;&#x3002;Oracle&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#xFF0C;&#x611F;&#x89C9;&#x4E00;&#x822C;&#x822C;&#x3002;Effective java&#xFF0C;&#x56DB;&#x5927;&#x5723;&#x7ECF;&#x4E4B;&#x4E00;&#x4E0D;&#x505A;&#x89E3;&#x91CA;&#x3002;<br>&#x5404;&#x4F4D;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x4E66;&#xFF0C;&#x9EBB;&#x70E6;&#x63A8;&#x8350;&#x4E0B;&#xFF0C;LZ&#x4E0D;&#x80DC;&#x611F;&#x6FC0;&#xFF01;<br>LZ&#x6CA1;&#x770B;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x90FD;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x7B14;&#x8BB0;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x7B14;&#x8BB0;&#x800C;&#x5DF2;&#xFF01;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x6709;&#x70B9;&#x513F;&#x7B80;&#x964B;&#xFF0C;&#x4E0D;&#x8981;&#x4ECB;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4F60;&#x8FD8;&#x6709;&#x70B9;&#x513F;&#x5E2E;&#x52A9;&#xFF0C;LZ&#x4E00;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x4E86;&#xFF01;<br>&#x4E8C;&#x3001;&#xFF1A;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x5BF9;&#x8C61;<br>2.1.&#x8003;&#x8651;&#x7528;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x66FF;&#x6362;&#x6784;&#x9020;&#x5668;<br>1.2.&#x7528;&#x79C1;&#x6709;&#x6784;&#x9020;&#x5668;&#x6216;&#x8005;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#x5F3A;&#x5316;Singleton&#x5C5E;&#x6027;<br>1.4.&#x901A;&#x8FC7;&#x79C1;&#x6709;&#x6784;&#x9020;&#x5668;&#x5F3A;&#x5316;&#x4E0D;&#x53EF;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;<br>1.5.&#x907F;&#x514D;&#x521B;&#x5EFA;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F;&#x88C5;&#x7BB1;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x8981;&#x5F53;&#x5FC3;&#x65E0;&#x610F;&#x8BC6;&#x7684;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x3002;<br>1.6.&#x6D88;&#x9664;&#x8FC7;&#x671F;&#x7684;&#x5BF9;&#x8C61;&#x5F15;&#x7528;<br>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6808;&#x5148;&#x662F;&#x589E;&#x957F;&#xFF0C;&#x518D;&#x662F;&#x6536;&#x7F29;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4ECE;&#x6808;&#x4E2D;&#x5F39;&#x51FA;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x5F53;&#x505A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x6808;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x518D;&#x5F15;&#x7528;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x56DE;&#x6536;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x6808;&#x5185;&#x90E8;&#x7EF4;&#x62A4;&#x8FD9;&#x5BF9;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x8FC7;&#x671F;&#x5F15;&#x7528;&#x3002;&#x6240;&#x8C13;&#x8FC7;&#x671F;&#x5F15;&#x7528;&#x5219;&#x662F;&#x6307;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x4F1A;&#x518D;&#x88AB;&#x89E3;&#x9664;&#x7684;&#x5F15;&#x7528;&#x3002;<br>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FC7;&#x671F;&#x5F15;&#x7528;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x6E05;&#x7A7A;&#x8FD9;&#x4E9B;&#x5F15;&#x7528;&#x5373;&#x53EF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;set null&#xFF09;,&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x52BF;&#x5FC5;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x6DF7;&#x4E71;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x5219;&#x662F;&#x8BA9;&#x5305;&#x542B;&#x8BE5;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x7ED3;&#x675F;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;<br>&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5E38;&#x89C1;&#x7684;&#x6765;&#x6E90;&#x6709;&#xFF1A;1&#x3001;&#x8FC7;&#x671F;&#x5F15;&#x7528;&#xFF0C;2&#x3001;&#x7F13;&#x5B58;&#xFF0C;3&#x3001;&#x76D1;&#x542C;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x56DE;&#x8C03;&#x3002;&#x5BF9;&#x4E8E;&#x7F13;&#x5B58;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x5219;&#x662F;&#x5B9A;&#x65F6;&#x5730;&#x6E05;&#x9664;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x9879;&#xFF0C;&#x60F3;&#x60F3;&#x7F13;&#x5B58;&#x91CC;&#x9762;&#x4FDD;&#x5B58;&#x4E86;&#x51E0;&#x5E74;&#x4E86;&#x65E0;&#x7528;&#x7684;&#x9879;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x89C9;&#x5F97;&#x6076;&#x5FC3;&#xFF1F;&#x56DE;&#x8C03;&#x5219;&#x662F;&#x53EA;&#x4FDD;&#x5B58;&#x4ED6;&#x4EEC;&#x7684;&#x5F31;&#x5F15;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x53EA;&#x5C06;&#x4ED6;&#x4EEC;&#x4FDD;&#x5B58;&#x6210;WeakHashMap&#x7684;&#x952E;&#x3002;<br>&#x53EF;&#x4EE5;&#x501F;&#x52A9;Heap&#x5256;&#x6790;&#x5DE5;&#x5177;&#x5206;&#x6790;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x95EE;&#x9898;<br>&#x56DB;&#x3001;&#x7C7B;&#x548C;&#x63A5;&#x53E3;<br>4.1&#x3001;&#x4F7F;&#x7C7B;&#x548C;&#x6210;&#x5458;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x884C;&#x6700;&#x5C0F;&#x5316;<br>&#x826F;&#x597D;&#x7684;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x9690;&#x85CF;&#xFF0C;&#x628A;&#x4ED6;&#x7684;API&#x4E0E;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x6E05;&#x6670;&#x5730;&#x9694;&#x79BB;&#x5F00;&#x6765;&#xFF0C;&#x6A21;&#x5757;&#x4E0E;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x53EA;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;API&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x60C5;&#x51B5;&#x2014;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x3002;<br>4.2&#x3001;&#x4F7F;&#x53EF;&#x53D8;&#x6027;&#x6700;&#x5C0F;&#x5316;<br>1&#xFF09;&#x4E3A;&#x4E86;&#x4F7F;&#x7C7B;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x5982;&#x4E0B;&#x89C4;&#x5219;&#xFF1A;<br>1.&#x4E0D;&#x8981;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x4F1A;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;<br>2.&#x4FDD;&#x8BC1;&#x7C7B;&#x4E0D;&#x4F1A;&#x88AB;&#x6269;&#x5C55;<br>3.&#x6240;&#x6709;&#x57DF;&#x90FD;&#x8981;&#x662F;final&#xFF0C;&#x4E14;&#x4E3A;&#x79C1;&#x6709;<br>4.&#x786E;&#x4FDD;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x53EF;&#x53D8;&#x7EC4;&#x4EF6;&#x7684;&#x4E92;&#x65A5;&#x8BBF;&#x95EE;&#x3002;<br>2&#xFF09;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x7684;&#x597D;&#x5904;<br>1.&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x672C;&#x8D28;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x6C42;&#x540C;&#x6B65;<br>2.&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x4E3A;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6784;&#x4EF6;<br>3&#xFF09;&#x7F3A;&#x70B9;&#x5728;&#x4E8E;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x4EE3;&#x4EF7;&#x5C31;&#x6709;&#x70B9;&#x9AD8;&#x4E86;&#x3002;<br>&#x4E3A;&#x4E86;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#xFF0C;&#x7C7B;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x5141;&#x8BB8;&#x88AB;&#x5B50;&#x7C7B;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x201C;final&#x201D;&#x4FEE;&#x9970;&#xFF0C;&#x5176;&#x5B9E;&#x9664;&#x4E86;&#x8FD9;&#x70B9;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x529E;&#x6CD5;&#xFF1A;&#x8BA9;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x6784;&#x9020;&#x5668;&#x5168;&#x90E8;&#x53D8;&#x4E3A;&#x79C1;&#x6709;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x516C;&#x6709;&#x7684;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x3002;<br>4.3&#x3001;&#x7EC4;&#x5408;&#x3001;&#x7EE7;&#x627F;<br>&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x7EC4;&#x5408;&#xFF0C;&#x614E;&#x7528;&#x7EE7;&#x627F;&#x3002;<br>&#x7EC4; &#x5408; &#x5173; &#x7CFB;    &#x7EE7; &#x627F; &#x5173; &#x7CFB;<br>&#x4F18;&#x70B9;&#xFF1A;&#x4E0D;&#x7834;&#x574F;&#x5C01;&#x88C5;&#xFF0C;&#x6574;&#x4F53;&#x7C7B;&#x4E0E;&#x5C40;&#x90E8;&#x7C7B;&#x4E4B;&#x95F4;&#x677E;&#x8026;&#x5408;&#xFF0C;&#x5F7C;&#x6B64;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;    &#x7F3A;&#x70B9;&#xFF1A;&#x7834;&#x574F;&#x5C01;&#x88C5;&#xFF0C;&#x5B50;&#x7C7B;&#x4E0E;&#x7236;&#x7C7B;&#x4E4B;&#x95F4;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#xFF0C;&#x5B50;&#x7C7B;&#x4F9D;&#x8D56;&#x4E8E;&#x7236;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5B50;&#x7C7B;&#x7F3A;&#x4E4F;&#x72EC;&#x7ACB;&#x6027;<br>&#x4F18;&#x70B9;&#xFF1A;&#x5177;&#x6709;&#x8F83;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;    &#x7F3A;&#x70B9;&#xFF1A;&#x652F;&#x6301;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x5F80;&#x5F80;&#x4EE5;&#x589E;&#x52A0;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E3A;&#x4EE3;&#x4EF7;<br>&#x4F18;&#x70B9;&#xFF1A;&#x652F;&#x6301;&#x52A8;&#x6001;&#x7EC4;&#x5408;&#x3002;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x6574;&#x4F53;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5C40;&#x90E8;&#x5BF9;&#x8C61;    &#x7F3A;&#x70B9;&#xFF1A;&#x4E0D;&#x652F;&#x6301;&#x52A8;&#x6001;&#x7EE7;&#x627F;&#x3002;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B50;&#x7C7B;&#x65E0;&#x6CD5;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x7236;&#x7C7B;<br>&#x4F18;&#x70B9;&#xFF1A;&#x6574;&#x4F53;&#x7C7B;&#x53EF;&#x4EE5;&#x5BF9;&#x5C40;&#x90E8;&#x7C7B;&#x8FDB;&#x884C;&#x5305;&#x88C5;&#xFF0C;&#x5C01;&#x88C5;&#x5C40;&#x90E8;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x63A5;&#x53E3;    &#x7F3A;&#x70B9;&#xFF1A;&#x5B50;&#x7C7B;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x7236;&#x7C7B;&#x7684;&#x63A5;&#x53E3;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x6574;&#x4F53;&#x7C7B;&#x4E0D;&#x80FD;&#x81EA;&#x52A8;&#x83B7;&#x5F97;&#x548C;&#x5C40;&#x90E8;&#x7C7B;&#x540C;&#x6837;&#x7684;&#x63A5;&#x53E3;    &#x4F18;&#x70B9;&#xFF1A;&#x5B50;&#x7C7B;&#x80FD;&#x81EA;&#x52A8;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x7684;&#x63A5;&#x53E3;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x521B;&#x5EFA;&#x6574;&#x4F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x6240;&#x6709;&#x5C40;&#x90E8;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;    &#x4F18;&#x70B9;&#xFF1A;&#x521B;&#x5EFA;&#x5B50;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x65E0;&#x987B;&#x521B;&#x5EFA;&#x7236;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;<br>&#x8BF7;&#x8BB0;&#x4F4F;&#x4E0B;&#x9762;&#x4E24;&#x53E5;&#x8BDD;&#xFF1A;<br>&#x7EE7;&#x627F;&#x8981;&#x614E;&#x7528;&#xFF0C;&#x5176;&#x4F7F;&#x7528;&#x573A;&#x5408;&#x4EC5;&#x9650;&#x4E8E;&#x4F60;&#x786E;&#x4FE1;&#x4F7F;&#x7528;&#x8BE5;&#x6280;&#x672F;&#x6709;&#x6548;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4E00;&#x4E2A;&#x5224;&#x65AD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x95EE;&#x4E00;&#x95EE;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x9700;&#x8981;&#x4ECE;&#x65B0;&#x7C7B;&#x5411;&#x57FA;&#x7C7B;&#x8FDB;&#x884C;&#x5411;&#x4E0A;&#x8F6C;&#x578B;&#x3002;&#x5982;&#x679C;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x5219;&#x7EE7;&#x627F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x53CD;&#x4E4B;&#x5219;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x8003;&#x8651;&#x662F;&#x5426;&#x9700;&#x8981;&#x7EE7;&#x627F;&#x3002;&#x300A;Java&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x300B;<br>&#x53EA;&#x6709;&#x5F53;&#x5B50;&#x7C7B;&#x771F;&#x6B63;&#x662F;&#x8D85;&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x624D;&#x9002;&#x5408;&#x7528;&#x7EE7;&#x627F;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x7C7B;A&#x548C;B&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x786E;&#x5B9E;&#x5B58;&#x5728;is-a&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7C7B;B&#x624D;&#x5E94;&#x8BE5;&#x7EE7;&#x7EED;&#x7C7B;A&#x3002;&#x300A;Effective Java&#x300B;<br>4.4&#x3001;&#x63A5;&#x53E3;&#x3001;&#x62BD;&#x8C61;&#x7C7B;<br>1.&#x63A5;&#x53E3;&#x662F;&#x5B9A;&#x4E49;mixin&#x7684;&#x7406;&#x60F3;&#x9009;&#x62E9;<br>2.&#x63A5;&#x53E3;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x6784;&#x9020;&#x975E;&#x5C42;&#x6B21;&#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x578B;&#x6846;&#x67B6;<br>3.&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;<br>&#x901A;&#x8FC7;&#x5BF9;&#x4F60;&#x5BFC;&#x51FA;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x63A5;&#x53E3;&#x90FD;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#xFF0C;&#x628A;&#x63A5;&#x53E3;&#x548C;&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x4F18;&#x70B9;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x63A5;&#x53E3;&#x7684;&#x4F5C;&#x7528;&#x4ECD;&#x7136;&#x662F;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x63A5;&#x7BA1;&#x4E86;&#x6240;&#x6709;&#x57DF;&#x63A5;&#x53E3;&#x5B9E;&#x73B0;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;AbstractInterface&#x3002;<br>&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7684;&#x7F8E;&#x5999;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x4EEC;&#x4E3A;&#x62BD;&#x8C61;&#x7C7B;&#x63D0;&#x4F9B;&#x4E86;&#x5B9E;&#x73B0;&#x4E0A;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4E0D;&#x4F1A;&#x5F3A;&#x52A0;&#x201C;&#x62BD;&#x8C61;&#x7C7B;&#x88AB;&#x7528;&#x505A;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x65F6;&#x201D;&#x6240;&#x7279;&#x6709;&#x7684;&#x4E25;&#x683C;&#x9650;&#x5236;&#x3002;&#x540C;&#x65F6;&#x5728;&#x7F16;&#x5199;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x65F6;&#x4E00;&#x822C;&#x90FD;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x8BA4;&#x771F;&#x7814;&#x7A76;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x90A3;&#x4E9B;&#x65B9;&#x6CD5;&#x662F;&#x6700;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x5219;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#x5C06;&#x6210;&#x4E3A;&#x9AA8;&#x67B6;&#x5B9E;&#x73B0;&#x7C7B;&#x4E2D;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF08;&#x8FD9;&#x91CC;&#x662F;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#xFF1F;&#xFF1F;&#xFF09;&#x3002;<br>4.&#x63A5;&#x53E3;&#x53EA;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x3002;<br>5.&#x5E38;&#x91CF;&#x63A5;&#x53E3;&#x4E0D;&#x503C;&#x5F97;&#x6548;&#x4EFF;&#xFF0C;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x53EA;&#x88AB;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x7528;&#x6765;&#x5BFC;&#x51FA;&#x5E38;&#x91CF;&#x3002;<br>6.&#x5BF9;&#x4E8E;&#x5E38;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x5982;&#x4E0B;&#x89C4;&#x5219;&#xFF1A;&#x5982;&#x679C;&#x5E38;&#x91CF;&#x4E0E;&#x67D0;&#x4E2A;&#x73B0;&#x6709;&#x7684;&#x7C7B;&#x6216;&#x8005;&#x63A5;&#x53E3;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x628A;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#x6DFB;&#x52A0;&#x5230;&#x8FD9;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x63A5;&#x53E3;&#x4E2D;&#xFF1B;&#x5982;&#x679C;&#x5E38;&#x91CF;&#x6700;&#x597D;&#x88AB;&#x770B;&#x505A;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x7528;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#x6765;&#x5BFC;&#x51FA;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#xFF1B;&#x5426;&#x5219;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5DE5;&#x5177;&#x7C7B;&#x6765;&#x5BFC;&#x51FA;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#x3002;<br>4.5&#x5185;&#x90E8;&#x7C7B;<br>&#x5185;&#x90E8;&#x7C7B;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5E94;&#x8BE5;&#x53EA;&#x4E3A;&#x4ED6;&#x7684;&#x5916;&#x56F4;&#x7C7B;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x5185;&#x90E8;&#x7C7B;&#x4E3B;&#x8981;&#x6709;&#x56DB;&#x79CD;&#xFF1A;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x3001;&#x975E;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x3001;&#x533F;&#x540D;&#x7C7B;&#x3001;&#x5C40;&#x90E8;&#x7C7B;&#x3002;<br>&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x5E38;&#x7528;&#x4F5C;&#x4E3A;&#x516C;&#x6709;&#x7684;&#x8F85;&#x52A9;&#x7C7B;&#xFF0C;&#x4EC5;&#x5F53;&#x4E0E;&#x5B83;&#x7684;&#x5916;&#x90E8;&#x7C7B;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x65F6;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x79C1;&#x6709;&#x9759;&#x6001;&#x6210;&#x5458;&#x7C7B;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x7528;&#x6765;&#x4EE3;&#x8868;&#x5916;&#x56F4;&#x7C7B;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4ED6;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x5916;&#x56F4;&#x7C7B;&#x3002;<br>&#x533F;&#x540D;&#x5185;&#x90E8;&#x7C7B;&#x6CA1;&#x6709;&#x540D;&#x79F0;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x5916;&#x56F4;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x6210;&#x5458;&#x4E00;&#x8D77;&#x88AB;&#x58F0;&#x660E;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x540C;&#x65F6;&#x88AB;&#x58F0;&#x660E;&#x548C;&#x5B9E;&#x4F8B;&#x5316;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x5728;&#x4ED6;&#x4EEC;&#x88AB;&#x58F0;&#x660E;&#x7684;&#x65F6;&#x5019;&#x4E4B;&#x5916;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x5C06;&#x4ED6;&#x4EEC;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x3002;&#x533F;&#x540D;&#x7C7B;&#x6709;&#x4E09;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x7528;&#x6CD5;&#xFF1A;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x5BF9;&#x8C61;&#xFF08;Runable&#x3001;Thread&#x3001;TimeTask&#xFF09;&#x3001;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7684;&#x5185;&#x90E8;&#x3002;<br>&#x4E94;&#x3001;&#x6CDB;&#x578B;<br>&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x6CDB;&#x578B;&#xFF0C;&#x867D;&#x7136;&#x4ED6;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x88AB;&#x64E6;&#x9664;&#x3002;<br>&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x6D88;&#x9664;&#x6BCF;&#x4E00;&#x4E2A;&#x975E;&#x53D7;&#x68C0;&#x8B66;&#x544A;&#x3002;&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x6D88;&#x9664;&#x8B66;&#x544A;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x5F15;&#x8D77;&#x8B66;&#x544A;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;@SuppressWarnings(&#x201C;unchecked&#x201D;)&#x6CE8;&#x89E3;&#x6765;&#x7981;&#x6B62;&#x8FD9;&#x6761;&#x8B66;&#x544A;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8981;&#x7ADF;&#x53EF;&#x80FD;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x4F7F;&#x7528;&#x8BE5;&#x6CE8;&#x89E3;&#xFF0C;&#x7981;&#x6B62;&#x5728;&#x6574;&#x4E2A;&#x7C7B;&#x4E0A;&#x4F7F;&#x7528;&#x8BE5;&#x6CE8;&#x89E3;&#x3002;<br>&#x4E03;&#x3001;&#x65B9;&#x6CD5;<br>7.1&#x5FC5;&#x8981;&#x65F6;&#xFF0C;&#x5BF9;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x5668;&#x548C;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x6027;&#x4FDD;&#x62A4;&#x3002;<br>7.2&#x3001;&#x8C28;&#x614E;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7B7E;&#x540D;<br>1.&#x8C28;&#x614E;&#x5730;&#x9009;&#x62E9;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x65B9;&#x6CD5;&#x540D;&#x79F0;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x9075;&#x5FAA;&#x6807;&#x51C6;&#x7684;&#x547D;&#x540D;&#x4E60;&#x60EF;&#x3002;<br>2.&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x8FFD;&#x6C42;&#x63D0;&#x4F9B;&#x4FBF;&#x5229;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x6781;&#x5C3D;&#x5176;&#x6240;&#x80FD;&#x3002;<br>3.&#x907F;&#x514D;&#x8FC7;&#x957F;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF0C;&#x4E00;&#x8FB9;&#x63D0;&#x4F9B;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x6216;&#x8005;&#x66F4;&#x5C11;&#x3002;<br>&#x907F;&#x514D;&#x53C2;&#x6570;&#x8FC7;&#x957F;&#x4E00;&#x822C;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;1).&#x5C06;&#x8BE5;&#x65B9;&#x6CD5;&#x5206;&#x89E3;&#x6210;&#x591A;&#x4E2A;&#x65B9;&#x6CD5; 2).&#x521B;&#x5EFA;&#x8F85;&#x52A9;&#x7C7B;&#xFF0C;&#x7528;&#x6765;&#x4FDD;&#x62A4;&#x53C2;&#x6570;&#x7684;&#x5206;&#x7EC4; 3).&#x4ECE;&#x5BF9;&#x8C61;&#x6784;&#x5EFA;&#x5230;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x90FD;&#x91C7;&#x7528;Builder&#x6A21;&#x5F0F;&#x3002;<br>4.&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x7C7B;&#x6765;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x628A;HashMap&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#xFF01;&#xFF01;<br>7.3&#x3001;&#x614E;&#x7528;&#x91CD;&#x8F7D;<br>1.&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x505A;&#x51FA;&#x51B3;&#x5B9A;&#x7684;&#x3002;<br>2.&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x8981;&#x5BFC;&#x51FA;&#x4E24;&#x4E2A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x53C2;&#x6570;&#x6570;&#x76EE;&#x7684;&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x4FDD;&#x5B88;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>3.&#x4EFB;&#x4F55;&#x4E00;&#x7EC4;&#x7ED9;&#x5B9A;&#x7684;&#x5B9E;&#x9645;&#x53C2;&#x6570;&#x5C06;&#x5E94;&#x7528;&#x4E8E;&#x90A3;&#x4E2A;&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#x4E0A;&#x3002;<br>4.&#x540C;&#x4E00;&#x7EC4;&#x53C2;&#x6570;&#x53EA;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x4F20;&#x9012;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x4FDD;&#x8BC1;&#xFF1A;&#x5F53;&#x4F20;&#x9012;&#x540C;&#x6837;&#x7684;&#x53C2;&#x6570;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x5FC5;&#x987B;&#x4E00;&#x81F4;&#x3002;<br>7.4&#x3001;&#x614E;&#x7528;&#x53EF;&#x53D8;&#x53C2;&#x6570;<br>&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x63A5;&#x53D7;0&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5176;&#x673A;&#x5236;&#x662F;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#x4E3A;&#x5728;&#x8C03;&#x7528;&#x4F4D;&#x7F6E;&#x6240;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x53C2;&#x6570;&#x503C;&#x4F20;&#x9012;&#x7ED9;&#x6570;&#x7EC4;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x6570;&#x7EC4;&#x4F20;&#x9012;&#x7ED9;&#x65B9;&#x6CD5;&#x3002;<br>7.5&#x3001;&#x8FD4;&#x56DE;&#x96F6;&#x957F;&#x5EA6;&#x7684;&#x6570;&#x7EC4;&#x6216;&#x8005;&#x96C6;&#x5408;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;null&#x3002;&#x4E0D;&#x91CD;&#x8981;&#x4F46;&#x662F;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x3002;<br>&#x516B;&#x3001;&#x901A;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;<br>8.1&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;&#x6700;&#x5C0F;&#x5316;<br>&#x5C06;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x6700;&#x5C0F;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x5E76;&#x964D;&#x4F4E;&#x51FA;&#x9519;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;<br>&#x8981;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x6700;&#x5C0F;&#x5316;&#xFF0C;&#x6700;&#x6709;&#x529B;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x58F0;&#x660E;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6BCF;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x90FD;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x5BF9;&#x8BE5;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x6709;&#x610F;&#x4E49;&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x63A8;&#x8FDF;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x58F0;&#x660E;&#xFF0C;&#x76F4;&#x5230;&#x53EF;&#x4EE5;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x6B62;&#x3002;<br>&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;&#x800C;&#x8A00;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4F7F;&#x65B9;&#x6CD5;&#x5C0F;&#x800C;&#x96C6;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5C0F;&#x5316;&#x3002;<br>8.2&#x3001;&#x4F18;&#x5148;&#x4F7F;&#x7528;for-each&#x5FAA;&#x73AF;<br>for&#x5FAA;&#x73AF;&#x76F8;&#x6BD4;&#x4E8E;while&#x5FAA;&#x73AF;&#x5B83;&#x53EF;&#x4EE5;&#x4F7F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x66F4;&#x5C0F;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x7A0B;&#x5E8F;&#x66F4;&#x52A0;&#x7B80;&#x77ED;&#x589E;&#x5F3A;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#x3002;<br>for-each&#x5FAA;&#x73AF;&#x5728;&#x7B80;&#x6D01;&#x6027;&#x548C;&#x9884;&#x9632;bug&#x65B9;&#x9762;&#x6709;&#x7740;&#x4F20;&#x7EDF;for&#x5FAA;&#x73AF;&#x65E0;&#x6CD5;&#x6BD4;&#x62DF;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x6027;&#x80FD;&#x635F;&#x5931;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;for-each&#x5FAA;&#x73AF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x5426;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;for-each&#x5FAA;&#x73AF;&#x7684;&#xFF1A;<br>1.&#x8FC7;&#x6EE4;&#xFF1A;&#x5982;&#x679C;&#x9700;&#x8981;&#x904D;&#x5386;&#x67D0;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x5220;&#x9664;&#x7279;&#x5B9A;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x663E;&#x793A;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x3002;<br>2.&#x8F6C;&#x6362;&#xFF1A;&#x5982;&#x679C;&#x9700;&#x8981;&#x904D;&#x5386;&#x5217;&#x8868;&#x6216;&#x8005;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x53D6;&#x4EE3;&#x5B83;&#x90E8;&#x5206;&#x6216;&#x8005;&#x5168;&#x90E8;&#x5143;&#x7D20;&#x503C;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x8FED;&#x4EE3;&#x5668;&#x6765;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x5143;&#x7D20;&#x7684;&#x503C;&#x3002;<br>3.&#x5E73;&#x884C;&#x8FED;&#x4EE3;<br>8.3&#x3001;&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;<br>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x76F8;&#x5F53;&#x4E8E;&#x5176;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x6709;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x533A;&#x522B;&#xFF1A;1.&#xFF09;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x53EA;&#x6709;&#x503C;&#xFF0C;&#x800C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x5219;&#x5177;&#x6709;&#x4ED6;&#x4EEC;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x540C;&#x4E00;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x8BF4;new Integer(1) != new Integer(1)&#xFF1B;2).&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x5177;&#x6709;&#x529F;&#x80FD;&#x5B8C;&#x5907;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x5F15;&#x7528;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;null&#x503C; 3).&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x901A;&#x5E38;&#x6BD4;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x66F4;&#x52A0;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#x3002;<br>&#x5F53;&#x5728;&#x4E00;&#x9879;&#x64CD;&#x4F5C;&#x4E2D;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5176;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5176;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x62C6;&#x7BB1;&#x52A8;&#x4F5C;&#x3002;<br>&#x5728;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x65F6;&#x9700;&#x8981;&#x683C;&#x5916;&#x6CE8;&#x610F;&#x62C6;&#x7BB1;&#x88C5;&#x7BB1;&#x673A;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x9891;&#x7E41;&#x7684;&#x62C6;&#x7BB1;&#x88C5;&#x7BB1;&#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x7684;&#x4E0B;&#x964D;&#x3002;<br>&#x5176;&#x4ED6;<br>1.&#x5982;&#x679C;&#x9700;&#x8981;&#x7CBE;&#x786E;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;BigDecimal&#x800C;&#x4E0D;&#x662F;double&#x548C;float&#x3002;<br>2.&#x5982;&#x679C;&#x6709;&#x5408;&#x9002;&#x7684;&#x63A5;&#x53E3;&#x7C7B;&#x578B;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x53C2;&#x6570;&#x3001;&#x8FD4;&#x56DE;&#x503C;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x57DF;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x90FD;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x58F0;&#x660E;&#x3002;<br>&#x4E5D;&#x3001;&#x5F02;&#x5E38;<br>&#x5F02;&#x5E38;&#x5E94;&#x8BE5;&#x53EA;&#x7528;&#x4E8E;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x6C38;&#x8FDC;&#x4E0D;&#x5E94;&#x8BE5;&#x7528;&#x4E8E;&#x6B63;&#x5E38;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x3002;<br>&#x5F02;&#x5E38;&#x673A;&#x5236;&#x8BBE;&#x8BA1;&#x662F;&#x7528;&#x4E8E;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x5C11;&#x4F1A;&#x6709;JVM&#x4F1A;&#x5BF9;&#x4ED6;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5F02;&#x5E38;&#x4E00;&#x822C;&#x8FD0;&#x884C;&#x90FD;&#x6BD4;&#x8F83;&#x6162;&#x3002;<br>&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x8BA9;&#x5F02;&#x5E38;&#x4EE3;&#x7801;&#x5757;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;try..catch&#x4F1A;&#x963B;&#x788D;JVM&#x5B9E;&#x73B0;&#x672C;&#x6765;&#x53EF;&#x80FD;&#x8981;&#x6267;&#x884C;&#x7684;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x5934;&#x6761;&#x53F7; / IT&#x6280;&#x672F;Java&#x4EA4;&#x6D41;<br>&#x94FE;&#x63A5;&#xFF1A;<a href="http://toutiao.com/a6317516034871034114/" target="_blank" rel="noopener">http://toutiao.com/a6317516034871034114/</a><br>&#x6765;&#x6E90;&#xFF1A;&#x5934;&#x6761;&#x53F7;&#xFF08;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x65D7;&#x4E0B;&#x521B;&#x4F5C;&#x5E73;&#x53F0;&#xFF09;<br>&#x8457;&#x4F5C;&#x6743;&#x5F52;&#x4F5C;&#x8005;&#x6240;&#x6709;&#x3002;&#x5546;&#x4E1A;&#x8F6C;&#x8F7D;&#x8BF7;&#x8054;&#x7CFB;&#x4F5C;&#x8005;&#x83B7;&#x5F97;&#x6388;&#x6743;&#xFF0C;&#x975E;&#x5546;&#x4E1A;&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2016/08/18/读书笔记《Effective java》/" data-id="cjmonzrjl0057diuo3x4iirie" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Java/">Java</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/08/18/面试/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          面试
        
      </div>
    </a>
  
  
    <a href="/2016/05/24/兴趣视频教程/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">兴趣视频教程</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android/">Android</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-UI/">Android UI</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-Framework/">Android_Framework</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android反编译/">Android反编译</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Http请求流程/">Http请求流程</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/IDE/">IDE</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Java/">Java</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/JavaWeb/">JavaWeb</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Jenkins/">Jenkins</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux-mysql/">Linux mysql</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/idea/">idea</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/mac/">mac</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/互联网/">互联网</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/代理/">代理</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/兴趣/">兴趣</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/区块链和比特币/">区块链和比特币</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/博客/">博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/大牛博客/">大牛博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/学习，师傅/">学习，师傅</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/开源项目/">开源项目</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/微信-Js/">微信 Js</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/心情/">心情</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/简历/">简历</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/自动化测试/">自动化测试</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/计算机运维/">计算机运维</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/面试/">面试</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/鸡汤/">鸡汤</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/黑客攻防/">黑客攻防</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Android/" style="font-size: 18.33px;">Android</a> <a href="/tags/Android-UI/" style="font-size: 10px;">Android UI</a> <a href="/tags/Android-Framework/" style="font-size: 20px;">Android_Framework</a> <a href="/tags/Android反编译/" style="font-size: 10px;">Android反编译</a> <a href="/tags/Http请求流程/" style="font-size: 10px;">Http请求流程</a> <a href="/tags/IDE/" style="font-size: 10px;">IDE</a> <a href="/tags/Java/" style="font-size: 15px;">Java</a> <a href="/tags/JavaWeb/" style="font-size: 16.67px;">JavaWeb</a> <a href="/tags/Jenkins/" style="font-size: 11.67px;">Jenkins</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Linux-mysql/" style="font-size: 10px;">Linux mysql</a> <a href="/tags/Unity3D/" style="font-size: 13.33px;">Unity3D</a> <a href="/tags/idea/" style="font-size: 10px;">idea</a> <a href="/tags/mac/" style="font-size: 10px;">mac</a> <a href="/tags/互联网/" style="font-size: 10px;">互联网</a> <a href="/tags/代理/" style="font-size: 10px;">代理</a> <a href="/tags/兴趣/" style="font-size: 10px;">兴趣</a> <a href="/tags/区块链和比特币/" style="font-size: 10px;">区块链和比特币</a> <a href="/tags/博客/" style="font-size: 11.67px;">博客</a> <a href="/tags/大牛博客/" style="font-size: 10px;">大牛博客</a> <a href="/tags/学习，师傅/" style="font-size: 10px;">学习，师傅</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/微信-Js/" style="font-size: 10px;">微信 Js</a> <a href="/tags/心情/" style="font-size: 10px;">心情</a> <a href="/tags/简历/" style="font-size: 10px;">简历</a> <a href="/tags/自动化测试/" style="font-size: 10px;">自动化测试</a> <a href="/tags/计算机运维/" style="font-size: 10px;">计算机运维</a> <a href="/tags/面试/" style="font-size: 11.67px;">面试</a> <a href="/tags/鸡汤/" style="font-size: 10px;">鸡汤</a> <a href="/tags/黑客攻防/" style="font-size: 11.67px;">黑客攻防</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/09/">九月 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/06/">六月 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/06/">六月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">二月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2018/09/30/简历/">安卓开发工程师</a>
          </li>
        
          <li>
            <a href="/2018/06/25/遇到的小问题/">遇到的小问题</a>
          </li>
        
          <li>
            <a href="/2017/06/27/Android 面试知识点/">Android 面试知识点</a>
          </li>
        
          <li>
            <a href="/2017/06/27/如何保证service在后台不被kill/">如何保证service在后台不被kill</a>
          </li>
        
          <li>
            <a href="/2017/06/27/Android ANR和OOM/">Android ANR和OOM</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2018 huanxingxyz<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>