<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="职业规划," />










<meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x6765;&amp;#x804A;&amp;#x4E0B;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x8F6C;&amp;#x65B9;&amp;#x5411;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BDD;&amp;#x9898;&amp;#x3002; &amp;#x8EAB;&amp;#x8FB9;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x540">
<meta name="keywords" content="职业规划">
<meta property="og:type" content="article">
<meta property="og:title" content="程序员转方向">
<meta property="og:url" content="http://yoursite.com/2022/06/12/程序员转方向/index.html">
<meta property="og:site_name" content="HELLO沃德">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x6765;&amp;#x804A;&amp;#x4E0B;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x8F6C;&amp;#x65B9;&amp;#x5411;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BDD;&amp;#x9898;&amp;#x3002; &amp;#x8EAB;&amp;#x8FB9;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x540">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2022-06-12T03:00:55.636Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="程序员转方向">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x6765;&amp;#x804A;&amp;#x4E0B;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x8F6C;&amp;#x65B9;&amp;#x5411;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BDD;&amp;#x9898;&amp;#x3002; &amp;#x8EAB;&amp;#x8FB9;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x540">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: 'Author'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2022/06/12/程序员转方向/"/>





  <title>程序员转方向 | HELLO沃德</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">HELLO沃德</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">你若盛开，蝴蝶自来</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://yoursite.com/2022/06/12/程序员转方向/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="huanxingxyz">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="HELLO沃德">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">程序员转方向</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2022-06-12T14:17:05+08:00">
                2022-06-12
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <span class="post-meta-item-icon">
                  <i class="fa fa-comment-o"></i>
                </span>
                <a href="/2022/06/12/程序员转方向/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count valine-comment-count" data-xid="/2022/06/12/程序员转方向/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <hr>
<p>&#x4ECA;&#x5929;&#x6765;&#x804A;&#x4E0B;&#x7A0B;&#x5E8F;&#x5458;&#x8F6C;&#x65B9;&#x5411;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x3002;</p>
<p>&#x8EAB;&#x8FB9;&#x6709;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x5B66;&#x90FD;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x7A98;&#x5883;&#xFF0C;&#x67D0;&#x67D0;&#x65B9;&#x5411;&#x4E0D;&#x5403;&#x9999;&#x4E86;&#xFF0C;&#x67D0;&#x67D0;&#x65B9;&#x5411;&#x5531;&#x8870;&#xFF0C;&#x529D;&#x9000;&#x3002;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x8981;&#x5207;&#x8EAB;&#x8003;&#x8651;&#x662F;&#x5426;&#x8981;&#x8F6C;&#x65B9;&#x5411;&#x4E86;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x597D;&#x591A;&#x4E4B;&#x524D;&#x505A;iOS&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x60F3;&#x8981;&#x8F6C;&#x524D;&#x7AEF;H5&#x5F00;&#x53D1;&#xFF1B;&#x6BD4;&#x5982;&#xFF0C;&#x4E4B;&#x524D;&#x505A;Android&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x60F3;&#x8981;&#x8F6C;Java&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#xFF1B;</p>
<p>&#x5F53;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5230;&#x5E95;&#x8981;&#x4E0D;&#x8981;&#x8F6C;&#x5462;&#xFF1F;</p>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8EAB;&#x8FB9;&#x5927;&#x591A;&#x6570;&#x51FA;&#x73B0;&#x4E24;&#x79CD;&#x58F0;&#x97F3;&#xFF1A;</p>
<h3 id="&#x4E0D;&#x8F6C;&#x65B9;&#x5411;&#xFF0C;&#x6DF1;&#x6316;&#x672C;&#x65B9;&#x5411;&#x5185;"><a href="#&#x4E0D;&#x8F6C;&#x65B9;&#x5411;&#xFF0C;&#x6DF1;&#x6316;&#x672C;&#x65B9;&#x5411;&#x5185;" class="headerlink" title="&#x4E0D;&#x8F6C;&#x65B9;&#x5411;&#xFF0C;&#x6DF1;&#x6316;&#x672C;&#x65B9;&#x5411;&#x5185;"></a>&#x4E0D;&#x8F6C;&#x65B9;&#x5411;&#xFF0C;&#x6DF1;&#x6316;&#x672C;&#x65B9;&#x5411;&#x5185;</h3><p>&#x6301;&#x8FD9;&#x79CD;&#x6001;&#x5EA6;&#x7684;&#x4EBA;&#xFF0C;&#x5927;&#x62B5;&#x7684;&#x89C2;&#x5FF5;&#x662F;&#xFF0C;&#x5E72;&#x4E00;&#x884C;&#xFF0C;&#x7231;&#x4E00;&#x884C;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;&#x6DF1;&#x6316;&#xFF0C;10000&#x5C0F;&#x65F6;&#x5B9A;&#x5F8B;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x8DB3;&#x591F;&#x52AA;&#x529B;&#xFF0C;&#x6709;&#x62FC;&#x52B2;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5B9E;&#x73B0;&#x6A2A;&#x626B;&#x3002;&#x4F46;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x662F;&#x76F8;&#x5F53;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x5927;&#x9F84;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x662F;&#x8F6C;&#x65B9;&#x5411;&#x540E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5E02;&#x573A;&#x672C;&#x8EAB;&#x5C31;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;30&#x591A;&#x5C81;&#x4E86;&#x518D;&#x8F6C;&#x5BB9;&#x6613;&#x7AF9;&#x7BEE;&#x6253;&#x6C34;&#x4E00;&#x573A;&#x7A7A;&#x3002;</p>
<p>&#x6DF1;&#x6316;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x8EAB;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5929;&#x8D4B;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x7684;&#x52A0;&#x6301;&#x7B49;&#x7B49;&#xFF0C;&#x800C;&#x4E14;&#x771F;&#x6B63;&#x7684;&#x5927;&#x725B;&#x662F;&#x5E72;&#x4E00;&#x884C;&#xFF0C;&#x884C;&#x4E00;&#x884C;&#xFF0C;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x7684;&#x7126;&#x8651;&#xFF0C;&#x8FD9;&#x79CD;&#x5927;&#x725B;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x51E4;&#x6BDB;&#x83F1;&#x89D2;&#x7684;&#xFF08;&#x5927;&#x591A;&#x662F;&#x9AD8;&#x5B66;&#x5386;&#xFF0C;&#x5F88;&#x65E9;&#x5C31;&#x8868;&#x73B0;&#x51FA;&#x5BF9;&#x8FD9;&#x884C;&#x7684;&#x5929;&#x8D4B;&#xFF09;&#xFF0C;&#x666E;&#x901A;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E0D;&#x8981;&#x8DDF;&#x4ED6;&#x4EEC;&#x6BD4;&#x3002;</p>
<h3 id="&#x8F6C;&#x65B9;&#x5411;"><a href="#&#x8F6C;&#x65B9;&#x5411;" class="headerlink" title="&#x8F6C;&#x65B9;&#x5411;"></a>&#x8F6C;&#x65B9;&#x5411;</h3><p>&#x79FB;&#x52A8;&#x7AEF;&#x9762;&#x8BD5;&#x73B0;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x5377;&#xFF0C;&#x5E76;&#x4E14;&#x4E0A;&#x9650;&#x4F4E;&#xFF0C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x975E;&#x5E38;&#x4E0D;&#x660E;&#x6670;&#x3002;&#x8EAB;&#x8FB9;&#x5F88;&#x591A;&#x4EE5;&#x524D;&#x505A;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x90FD;&#x5F00;&#x59CB;&#x8F6C;&#x65B9;&#x5411;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x7684;&#x4E0D;&#x5E72;&#x7740;&#x884C;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x7EE7;&#x627F;&#x5BB6;&#x4E1A;&#x4E86;&#xFF0C;&#x6709;&#x7684;&#x8F6C;&#x4EA7;&#x54C1;&#x4E86;&#xFF0C;&#x6709;&#x7684;&#x8F6C;H5&#xFF0C;&#x6709;&#x7684;&#x8F6C;&#x540E;&#x7AEF;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x524D;&#x7AEF;&#x7684;&#x5C97;&#x4F4D;&#x8D8A;&#x6765;&#x8D8A;&#x6CA1;&#x6709;&#x95E8;&#x69DB;&#xFF0C;&#x53EF;&#x66FF;&#x4EE3;&#x6027;&#x5F3A;&#xFF0C;&#x521A;&#x6BD5;&#x4E1A;&#x6216;&#x8005;&#x57F9;&#x8BAD;&#x51FA;&#x6765;&#x7684;&#x7814;&#x53D1;&#xFF0C;&#x90FD;&#x80FD;&#x4E0A;&#x624B;&#xFF0C;&#x8001;&#x7A0B;&#x5E8F;&#x4E1D;&#x6BEB;&#x6CA1;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x53EF;&#x8A00;&#x3002;</p>
<p>&#x540E;&#x7AEF;&#x66F4;&#x5BB9;&#x6613;&#x8FDB;&#x9636;&#xFF0C;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x7ECF;&#x7406;&#x548C;&#x67B6;&#x6784;&#x5E08;&#x90FD;&#x662F;&#x66F4;&#x4E86;&#x89E3;&#x4E1A;&#x52A1;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x540E;&#x7AEF;&#x7814;&#x53D1;&#x51FA;&#x8EAB;&#x3002;</p>
<h3 id="&#x6211;&#x7684;&#x5EFA;&#x8BAE;"><a href="#&#x6211;&#x7684;&#x5EFA;&#x8BAE;" class="headerlink" title="&#x6211;&#x7684;&#x5EFA;&#x8BAE;"></a>&#x6211;&#x7684;&#x5EFA;&#x8BAE;</h3><p>&#x5BF9;&#x4E8E;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7EA0;&#x7ED3;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x5B66;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x8F6C;&#x5C3D;&#x91CF;&#x65E9;&#x8F6C;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E00;&#x884C;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x7684;&#x884C;&#x4E1A;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x5E74;&#x505A;&#x585E;&#x73ED;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x8F6C;Android&#x4E86;&#xFF0C;&#x8DDF;&#x73B0;&#x5728;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#x3002;</p>
<p>&#x9996;&#x5148;&#x4E0D;&#x8981;&#x754F;&#x60E7;&#x8F6C;&#x65B9;&#x5411;&#x8FD9;&#x56DE;&#x4E8B;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x96BE;&#x5543;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x9996;&#x5148;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x8FDB;&#x9636;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x5E74;&#x85AA;&#x767E;&#x4E07;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x5207;&#x5207;&#x5B9E;&#x5B9E;&#x7684;&#x627E;&#x5230;&#x4EFD;&#x8FD8;&#x4E0D;&#x9519;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x7A33;&#xFF0C;&#x624D;&#x80FD;&#x8C08;&#x53D1;&#x5C55;&#x3002;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x80CC;&#x7740;&#x623F;&#x8D37;&#x8F66;&#x8D37;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x6E29;&#x9971;&#xFF0C;&#x907F;&#x514D;&#x7126;&#x8651;&#xFF0C;&#x7EE7;&#x7EED;&#x4ECE;&#x4E8B;&#x5915;&#x9633;&#x65B9;&#x5411;&#x53EA;&#x4F1A;&#x8BA9;&#x8FD9;&#x79CD;&#x7126;&#x8651;&#x4E00;&#x76F4;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x9519;&#x8BEF;&#x7684;&#x52AA;&#x529B;&#x624D;&#x6700;&#x5BB3;&#x4EBA;&#xFF0C;&#x4E0D;&#x662F;&#x6CA1;&#x52AA;&#x529B;&#x8FC7;&#xFF0C;&#x800C;&#x4E14;&#x52AA;&#x529B;&#x9519;&#x4E86;&#x65B9;&#x5411;&#x4F1A;&#x8BA9;&#x4EBA;&#x771F;&#x6B63;&#x61CA;&#x6094;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x56FD;&#x5185;&#x4E0D;&#x4E89;&#x7684;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;35&#x5C81;&#x662F;&#x4E00;&#x4E2A;&#x780D;&#x513F;&#xFF0C;&#x9762;&#x4E34;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x8981;&#x60F3;&#x5E73;&#x7A33;&#x7684;&#x8FC7;&#x5EA6;&#xFF0C;&#x4E5F;&#x975E;&#x5E38;&#x96BE;&#xFF0C;&#x5C4A;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x5458;&#x9009;&#x62E9;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x8981;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x5EF6;&#x7EED;&#xFF0C;&#x80FD;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x80FD;&#x6253;&#x80FD;&#x625B;&#x7684;&#x65B9;&#x5411;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x7136;&#x540E;&#x7AEF;&#x4E5F;&#x5F88;&#x5377;&#xFF0C;&#x4F46;&#x662F;&#x80DC;&#x5728;&#x9700;&#x6C42;&#x4E5F;&#x975E;&#x5E38;&#x5927;&#xFF0C;35&#x5C81;&#x7684;&#x5E94;&#x5BF9;&#x65B9;&#x5411;&#xFF0C;&#x771F;&#x7684;&#x6709;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x8981;&#x770B;&#x673A;&#x9047;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x592A;&#x7126;&#x8651;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5168;&#x6808;&#x8FD9;&#x4E2A;&#x4E8B;&#xFF0C;&#x5168;&#x6808;&#x662F;&#x597D;&#x4E8B;&#xFF0C;T&#x578B;&#x4EBA;&#x624D;&#x548C;&#x3C0;&#x578B;&#x4EBA;&#x624D;&#x542C;&#x8D77;&#x6765;&#x90FD;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x6709;&#x4E9B;&#x5403;&#x4E8F;&#xFF0C;&#x4F1A;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x89C9;&#x5F97;&#x662F;&#x5168;&#x6E23;&#xFF0C;&#x4E0D;&#x592A;&#x76F8;&#x4FE1;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x201C;&#x4F01;&#x4E1A;&#x62DB;&#x4E2A;&#x5168;&#x6808;&#xFF0C;&#x4E0D;&#x5982;&#x62DB;&#x4E24;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x201D;&#xFF1B;&#x5F53;&#x7136;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x6709;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x4EE5;&#x504F;&#x6982;&#x5168;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x5168;&#x6808;&#x5F00;&#x53D1;&#x518D;&#x8FDB;&#x9636;&#xFF0C;&#x5C31;&#x662F;&#x6280;&#x672F;&#x7ECF;&#x7406;&#x548C;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x662F;&#x597D;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6761;&#x8DEF;&#x662F;&#x53EF;&#x4EE5;&#x8D70;&#x7684;&#x987A;&#x7684;&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x5207;&#x5FCC;&#x8981;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x662F;&#x6709;&#x6DF1;&#x5EA6;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8F6C;&#x4E86;&#x540E;&#x7AEF;&#xFF0C;&#x5C31;&#x8981;&#x8E0F;&#x8E0F;&#x5B9E;&#x5B9E;&#x505A;&#x540E;&#x7AEF;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x628A;&#x6DF1;&#x5EA6;&#x548C;&#x9879;&#x76EE;&#x592F;&#x5B9E;&#xFF0C;&#x4EE5;&#x540E;&#x51FA;&#x53BB;&#x624D;&#x80FD;&#x597D;&#x5439;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x603B;&#x7ED3;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x60F3;&#x8981;&#x6539;&#x53D8;&#xFF0C;&#x5C31;&#x9A6C;&#x4E0A;&#x5C31;&#x53BB;&#x6539;&#x53D8;&#xFF0C;&#x90FD;&#x4E0D;&#x665A;&#x3002;</p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/职业规划/" rel="tag"># 职业规划</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2021/01/30/程序员内卷和保持行业竞争力/" rel="next" title="程序员的焦虑">
                <i class="fa fa-chevron-left"></i> 程序员的焦虑
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2022/06/26/技术人怎么破圈/" rel="prev" title="技术人怎么破圈">
                技术人怎么破圈 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          

  
    <div class="comments" id="comments">
    </div>
  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            Overview
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">huanxingxyz</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">79</span>
                  <span class="site-state-item-name">posts</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                <a href="/tags/index.html">
                  <span class="site-state-item-count">30</span>
                  <span class="site-state-item-name">tags</span>
                </a>
              </div>
            

          </nav>

          

          

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#不转方向，深挖本方向内"><span class="nav-number">1.</span> <span class="nav-text">不转方向，深挖本方向内</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#转方向"><span class="nav-number">2.</span> <span class="nav-text">转方向</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#我的建议"><span class="nav-number">3.</span> <span class="nav-text">我的建议</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2022</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">huanxingxyz</span>

  
</div>


  <div class="powered-by">Powered by <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a></div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">Theme &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.4</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.4"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  










  <script src="//cdn1.lncld.net/static/js/3.0.4/av-min.js"></script>
  <script src="//cdn.jsdelivr.net/npm/valine/dist/Valine.min.js"></script>
  
  <script type="text/javascript">
    var GUEST = ['nick','mail','link'];
    var guest = 'nick,mail,link';
    guest = guest.split(',').filter(item=>{
      return GUEST.indexOf(item)>-1;
    });
    new Valine({
        el: '#comments' ,
        verify: false,
        notify: false,
        appId: 'bYq7Ata5d0bKNhSF3lRbvkSw-gzGzoHsz',
        appKey: 'OkxHrgPHiUDlaiQpzi7J8QDA',
        placeholder: 'Just go go',
        avatar:'mm',
        guest_info:guest,
        pageSize:'10' || 10,
    });
  </script>



  





  

  

  

  
  

  

  

  

</body>
</html>
