<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词 | 田鹏飞的个人博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E00;&amp;#x3001;&amp;#x8D44;&amp;#x6E90;&amp;#x65F6;&amp;#x95F4;&amp;#x662F;&amp;#x5E74;&amp;#x8F7B;&amp;#x4EBA;&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x8D44;&amp;#x6E90;&amp;#x3002;&amp;#x5728;&amp;#x5EA7;&amp;#x5404;&amp;#x4F4D;&amp;#x90FD;&amp;#x662F;&amp;#x7855;&amp;#x58EB;&amp;#x535A;">
<meta name="keywords" content="鸡汤">
<meta property="og:type" content="article">
<meta property="og:title" content="（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词">
<meta property="og:url" content="http://yoursite.com/2017/08/04/（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词/index.html">
<meta property="og:site_name" content="田鹏飞的个人博客">
<meta property="og:description" content="&amp;#x4E00;&amp;#x3001;&amp;#x8D44;&amp;#x6E90;&amp;#x65F6;&amp;#x95F4;&amp;#x662F;&amp;#x5E74;&amp;#x8F7B;&amp;#x4EBA;&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x8D44;&amp;#x6E90;&amp;#x3002;&amp;#x5728;&amp;#x5EA7;&amp;#x5404;&amp;#x4F4D;&amp;#x90FD;&amp;#x662F;&amp;#x7855;&amp;#x58EB;&amp;#x535A;">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2019-12-03T10:09:37.436Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词">
<meta name="twitter:description" content="&amp;#x4E00;&amp;#x3001;&amp;#x8D44;&amp;#x6E90;&amp;#x65F6;&amp;#x95F4;&amp;#x662F;&amp;#x5E74;&amp;#x8F7B;&amp;#x4EBA;&amp;#x6700;&amp;#x5927;&amp;#x7684;&amp;#x8D44;&amp;#x6E90;&amp;#x3002;&amp;#x5728;&amp;#x5EA7;&amp;#x5404;&amp;#x4F4D;&amp;#x90FD;&amp;#x662F;&amp;#x7855;&amp;#x58EB;&amp;#x535A;">
  
    <link rel="alternate" href="/atom.xml" title="田鹏飞的个人博客" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">田鹏飞的个人博客</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">你若盛开，蝴蝶自来</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/08/04/（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词/" class="article-date">
  <time datetime="2017-08-04T03:35:18.000Z" itemprop="datePublished">2017-08-04</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      （转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h3 id="&#x4E00;&#x3001;&#x8D44;&#x6E90;"><a href="#&#x4E00;&#x3001;&#x8D44;&#x6E90;" class="headerlink" title="&#x4E00;&#x3001;&#x8D44;&#x6E90;"></a>&#x4E00;&#x3001;&#x8D44;&#x6E90;</h3><p>&#x65F6;&#x95F4;&#x662F;&#x5E74;&#x8F7B;&#x4EBA;&#x6700;&#x5927;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5728;&#x5EA7;&#x5404;&#x4F4D;&#x90FD;&#x662F;&#x7855;&#x58EB;&#x535A;&#x58EB;&#xFF0C;&#x5B66;&#x5386;&#x90FD;&#x6BD4;&#x6211;&#x9AD8;&#x3002;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x6BD4;&#x5B66;&#x5386;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x662F;&#x672C;&#x79D1;&#x8FD8;&#x662F;&#x535A;&#x58EB;&#xFF0C;&#x5B66;&#x9738;&#x8FD8;&#x662F;&#x5B66;&#x6E23;&#xFF0C;&#x8FDB;&#x5165;&#x5DE5;&#x4F5C;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x8D77;&#x8DD1;&#x7EBF;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x8BFB;&#x5927;&#x5B66;&#x4E5F;&#x5C31;&#x56DB;&#x5E74;&#xFF0C;&#x7855;&#x58EB;&#x535A;&#x58EB;&#x591A;&#x51E0;&#x5E74;&#xFF0C;&#x800C;&#x4F60;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x80FD;&#x8981;40&#x5E74;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x6B63;&#x662F;&#x8FD9;40&#x5E74;&#xFF0C;&#x8BA9;&#x4F60;&#x4EEC;&#x7684;&#x6210;&#x5C31;&#xFF0C;&#x6709;&#x4E86;&#x5929;&#x58E4;&#x4E4B;&#x522B;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x5728;&#x5EA7;&#x5404;&#x4F4D;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x6B64;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x751F;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x6211;&#x4E3A;&#x4F60;&#x4EEC;&#x51C6;&#x5907;&#x4E86;&#x51E0;&#x4E2A;&#x6210;&#x957F;&#x5173;&#x952E;&#x8BCD;&#x3002;</p>
<h3 id="&#x4E8C;&#x3001;&#x7B2C;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x76EE;&#x6807;&#x548C;&#x68A6;&#x60F3;"><a href="#&#x4E8C;&#x3001;&#x7B2C;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x76EE;&#x6807;&#x548C;&#x68A6;&#x60F3;" class="headerlink" title="&#x4E8C;&#x3001;&#x7B2C;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x76EE;&#x6807;&#x548C;&#x68A6;&#x60F3;"></a>&#x4E8C;&#x3001;&#x7B2C;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x76EE;&#x6807;&#x548C;&#x68A6;&#x60F3;</h3><p>&#x6211;&#x8FD1;&#x8DDD;&#x79BB;&#x63A5;&#x89E6;&#x8FC7;&#x5F88;&#x591A;&#x5927;&#x725B;&#xFF0C;&#x4ED6;&#x4EEC;&#x98CE;&#x683C;&#x8FE5;&#x5F02;&#xFF0C;&#x5404;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x6709;&#x7684;&#x4EBA;&#x7279;&#x522B;&#x806A;&#x660E;&#xFF0C;&#x6BD4;&#x5982;&#x5468;&#x9E3F;&#x794E;&#xFF0C;&#x601D;&#x7EF4;&#x8FD0;&#x8F6C;&#x6781;&#x5FEB;&#xFF1B;&#x6709;&#x7684;&#x4EBA;&#x8DDF;&#x4F60;&#x8FDE;&#x7EED;&#x5F00;&#x4F1A;&#x5230;&#x51CC;&#x6668;&#x8FD8;&#x601D;&#x7EF4;&#x9AD8;&#x901F;&#x8FD0;&#x8F6C;&#xFF0C;&#x6BD4;&#x5982;&#x96F7;&#x519B;&#xFF1B;&#x8FD8;&#x6709;&#x7684;&#x4EBA;&#x8BF4;&#x8D77;&#x6765;&#x8BDD;&#x6765;&#xFF0C;&#x603B;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x5B57;&#x4E00;&#x4E2A;&#x5B57;&#x5F80;&#x5916;&#x8E66;&#xFF0C;&#x6BD4;&#x5982;&#x9A6C;&#x5316;&#x817E;&#xFF1B;&#x800C;&#x674E;&#x5F66;&#x5B8F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x4E0D;&#x600E;&#x4E48;&#x8BF4;&#x8BDD;&#x3002;&#x4F46;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x5171;&#x540C;&#x70B9;&#xFF0C;&#x5176;&#x4E2D;&#x7279;&#x522B;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#x5C31;&#x662F;&#x76EE;&#x6807;&#x611F;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4EBA;&#x90FD;&#x662F;&#x76EE;&#x6807;&#x611F;&#x6781;&#x5F3A;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x6211;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x806A;&#x660E;&#x4EBA;&#xFF0C;&#x6700;&#x7EC8;&#x6210;&#x5C31;&#x4E00;&#x822C;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F88;&#x91CD;&#x8981;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x751F;&#x6D3B;&#x5C31;&#x8FD9;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x6D3B;&#x597D;&#x5F53;&#x4E0B;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5F88;&#x65E9;&#x53BB;&#x6811;&#x7ACB;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x4E0D;&#x591F;&#x6E05;&#x6670;&#xFF0C;&#x90FD;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5927;&#x6982;&#x7684;&#x613F;&#x666F;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x50CF;&#x706F;&#x5854;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x6CE2;&#x6D9B;&#x6C79;&#x6D8C;&#x53C8;&#x65E0;&#x8FB9;&#x65E0;&#x9645;&#x7684;&#x5927;&#x6D77;&#x4E0A;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x8981;&#x5F80;&#x54EA;&#x513F;&#x8D70;&#x3002;</p>
<p>&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x5728;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x53EB;3721&#xFF0C;&#x7B14;&#x8BD5;&#x65F6;&#x6709;&#x4E00;&#x9053;&#x9898;&#x95EE;&#x6211;&#xFF0C;&#x4E94;&#x5E74;&#x4E4B;&#x5185;&#x60F3;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x4EBA;&#x3002;&#x6211;&#x5199;&#xFF0C;&#x6211;&#x60F3;&#x6210;&#x4E3A;CEO&#x3002;HR&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x56DE;&#x7B54;&#x65F6;&#xFF0C;&#x5C31;&#x95EE;&#x6211;&#xFF0C;&#x4F60;&#x77E5;&#x9053;CEO&#x662F;&#x5E72;&#x561B;&#x7684;&#x5417;&#xFF1F;&#x6211;&#x8BF4;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x6211;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x505A;&#x7BA1;&#x7406;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x867D;&#x7136;&#x65F6;&#x95F4;&#x6BD4;&#x4E94;&#x5E74;&#x957F;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x4E5F;&#x7B97;&#x662F;&#x6210;&#x4E86;&#x4E00;&#x4E2A;CEO&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x68A6;&#x60F3;&#x548C;&#x76EE;&#x6807;&#xFF0C;&#x4E00;&#x5B9A;&#x7ED5;&#x4E0D;&#x5F00;&#x7F8E;&#x56FD;&#x3002;&#x56DE;&#x60F3;&#xFF0C;&#x6211;&#x8FD9;&#x4E00;&#x4EE3;&#x63A5;&#x53D7;&#x7684;&#x6559;&#x80B2;&#xFF0C;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x201C;&#x4E66;&#x5C71;&#x6709;&#x8DEF;&#x52E4;&#x4E3A;&#x5F84;&#xFF0C;&#x5B66;&#x6D77;&#x65E0;&#x6DAF;&#x82E6;&#x4F5C;&#x821F;&#x201D;&#x3002;&#x53EA;&#x8981;&#x4F60;&#x52AA;&#x529B;&#x5C31;&#x80FD;&#x6210;&#x529F;&#x3002;&#x53EF;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x53BB;&#x7F8E;&#x56FD;&#xFF0C;&#x5C31;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x7AD9;&#x5728;&#x65AF;&#x5766;&#x798F;&#x7684;&#x8349;&#x576A;&#x524D;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x73AF;&#x5883;&#x53C8;&#x597D;&#xFF0C;&#x53C8;&#x53EF;&#x7ECF;&#x5E38;&#x4F11;&#x5047;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x8DD1;&#x6B65;&#xFF0C;&#x6700;&#x540E;&#x5929;&#x5929;&#x8BF4;&#x6211;&#x4EEC;&#x6284;&#x88AD;&#x4ED6;&#xFF0C;&#x8FD9;&#x4E0D;&#x516C;&#x5E73;&#x554A;&#x3002;&#x53EF;&#x6211;&#x53C8;&#x65E0;&#x4ECE;&#x53CD;&#x9A73;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#xFF0C;&#x5F88;&#x591A;&#x4F1F;&#x5927;&#x7684;&#x521B;&#x65B0;&#x786E;&#x5B9E;&#x90FD;&#x4ECE;&#x4ED6;&#x4EEC;&#x90A3;&#x91CC;&#x6765;&#x7684;&#x3002;&#x540E;&#x6765;&#x6211;&#x60F3;&#xFF0C;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x5728;&#x76EE;&#x6807;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x767E;&#x591A;&#x5E74;&#x524D;&#xFF0C;&#x81EA;&#x7531;&#x5973;&#x795E;&#x50CF;&#x521A;&#x521A;&#x5EFA;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x8239;&#x4E0A;&#x8FDC;&#x8FDC;&#x671B;&#x89C1;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x8C61;&#x5F81;&#x7740;&#x81EA;&#x7531;&#x7684;&#x96D5;&#x50CF;&#x7F13;&#x7F13;&#x653E;&#x5927;&#x65F6;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x80FD;&#x611F;&#x53D7;&#x5230;&#x8FD9;&#x7247;&#x571F;&#x5730;&#x5BF9;&#x68A6;&#x60F3;&#x7684;&#x63A8;&#x5D07;&#x3002;&#x5B83;&#x662F;&#x591A;&#x4E48;&#x652F;&#x6301;&#x4F60;&#x53BB;&#x6811;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x524D;&#x51E0;&#x5929;&#xFF0C;&#x730E;&#x8C79;&#x529E;&#x4E86;&#x4E00;&#x573A;&#x65E5;&#x672C;&#x7F51;&#x7EA2;&#x805A;&#x4F1A;&#x3002;&#x6709;&#x4E24;&#x4E2A;&#x7F8E;&#x56FD;&#x7F51;&#x7EA2;&#x4E13;&#x95E8;&#x8D76;&#x6765;&#x52A9;&#x9635;&#x3002;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x5199;&#x6B4C;&#xFF0C;&#x5F39;&#x594F;&#xFF0C;&#x7136;&#x540E;&#x6F14;&#x5531;&#x3002;&#x7F8E;&#x56FD;&#x6709;&#x5927;&#x91CF;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x3002;&#x4ED6;&#x4EEC;&#x8FDE;&#x673A;&#x7968;&#x90FD;&#x4E70;&#x4E0D;&#x8D77;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x592A;&#x5728;&#x4E4E;&#x3002;&#x4ED6;&#x4EEC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FFD;&#x6C42;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x4E5F;&#x662F;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5F00;&#x59CB;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x6211;&#x4EEC;&#x4E2D;&#x56FD;&#x90A3;&#x5957;&#x53EA;&#x5F3A;&#x8C03;&#x52E4;&#x594B;&#x548C;&#x52AA;&#x529B;&#x7684;&#x601D;&#x7EF4;&#x4F53;&#x7CFB;&#x3002;&#x867D;&#x7136;&#x5F53;&#x521D;&#x730E;&#x8C79;&#x4E5F;&#x5F88;&#x5C0F;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x56FD;&#x9645;&#x4E1A;&#x52A1;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x6BEB;&#x65E0;&#x6D77;&#x5916;&#x80CC;&#x666F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x90A3;&#x65F6;&#x5019;&#x5C31;&#x6562;&#x601D;&#x8003;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#x6210;&#x4E00;&#x5BB6;&#x5168;&#x7403;&#x5316;&#x7684;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8BF4;&#x660E;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x4EBA;&#x5148;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x624D;&#x6709;&#x673A;&#x4F1A;&#x9760;&#x8FD1;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x3002;&#x6240;&#x8C13;&#xFF0C;&#x53D6;&#x4E4E;&#x5176;&#x4E0A;&#xFF0C;&#x5F97;&#x4E4E;&#x5176;&#x4E2D;&#xFF1B;&#x53D6;&#x4E4E;&#x5176;&#x4E2D;&#xFF0C;&#x5F97;&#x4E4E;&#x5176;&#x4E0B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6574;&#x4E2A;&#x6559;&#x80B2;&#x7279;&#x522B;&#x7F3A;&#x7684;&#x5C31;&#x662F;&#x76EE;&#x6807;&#x611F;&#x548C;&#x4EBA;&#x751F;&#x68A6;&#x60F3;&#x7684;&#x6559;&#x80B2;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x6559;&#x80B2;&#x90FD;&#x662F;&#x6280;&#x80FD;&#x6559;&#x80B2;&#x3002;&#x53D1;&#x5F20;&#x7B54;&#x9898;&#x5361;&#xFF0C;&#x8C01;&#x586B;&#x5F97;&#x597D;&#xFF0C;&#x8C01;&#x662F;&#x4F18;&#x79C0;&#x5B66;&#x751F;&#x3002;&#x4ECE;&#x6765;&#x6CA1;&#x4EBA;&#x6559;&#x8FC7;&#x4F60;&#xFF0C;&#x8981;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x6216;&#x600E;&#x4E48;&#x53BB;&#x7ED9;&#x81EA;&#x5DF1;&#x6811;&#x7ACB;&#x76EE;&#x6807;&#x611F;&#x3002;&#x6280;&#x80FD;&#x6559;&#x80B2;&#x662F;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x53BB;&#x5BFB;&#x627E;&#x81EA;&#x5DF1;&#xFF0C;&#x53BB;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x9898;&#x76EE;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x8DDF;&#x7B54;&#x9898;&#x7684;&#x96BE;&#x5EA6;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8001;&#x662F;&#x5632;&#x7B11;&#x7F8E;&#x56FD;&#x4EBA;&#x6570;&#x5B66;&#x57FA;&#x672C;&#x529F;&#x90A3;&#x4E48;&#x5DEE;&#xFF0C;&#x4F46;&#x4E3A;&#x4EC0;&#x4E48;&#x6700;&#x597D;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#x8BDE;&#x751F;&#x5728;&#x7F8E;&#x56FD;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x628A;&#x6280;&#x80FD;&#x653E;&#x5728;&#x7B2C;&#x4E00;&#x4F4D;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x5174;&#x8DA3;&#x548C;&#x76EE;&#x6807;&#x653E;&#x5728;&#x7B2C;&#x4E00;&#x4F4D;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x5E38;&#x8BF4;&#xFF0C;&#x5168;&#x6C11;&#x57FA;&#x7840;&#x6570;&#x5B66;&#x80FD;&#x529B;&#xFF0C;&#x4E2D;&#x56FD;&#x4EBA;&#x6BD4;&#x7F8E;&#x56FD;&#x4EBA;&#x5F3A;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x884C;&#x7684;&#x662F;&#x5F3A;&#x5316;&#x6559;&#x80B2;&#xFF0C;&#x800C;&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5B66;&#x751F;&#x5BF9;&#x6570;&#x5B66;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E2D;&#x5B66;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x63A5;&#x53D7;&#x6BD4;&#x672C;&#x79D1;&#x8FD8;&#x8981;&#x6DF1;&#x5F97;&#x591A;&#x7684;&#x6570;&#x5B66;&#x6559;&#x80B2;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4ED6;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53CC;&#x65B9;&#x6574;&#x4E2A;&#x6559;&#x80B2;&#x4F53;&#x7CFB;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#xFF0C;&#x6838;&#x5FC3;&#x5C31;&#x5728;&#x4E8E;&#x4ED6;&#x4EEC;&#x7279;&#x522B;&#x91CD;&#x89C6;&#x57F9;&#x517B;&#x5BFB;&#x627E;&#x76EE;&#x6807;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8BF4;&#xFF0C;&#x624E;&#x514B;&#x4F2F;&#x683C;&#x5927;&#x5B66;&#x8F8D;&#x5B66;&#x4E86;&#xFF0C;&#x6BD4;&#x5C14;&#x76D6;&#x8328;&#x5927;&#x5B66;&#x8F8D;&#x5B66;&#x4E86;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x5927;&#x5B66;&#x4E5F;&#x8F8D;&#x5B66;&#x4E86;&#xFF0C;&#x597D;&#x50CF;&#x53EA;&#x6709;&#x8F8D;&#x5B66;&#x7684;&#x4EBA;&#x624D;&#x80FD;&#x521B;&#x4E1A;&#x6210;&#x529F;&#x3002;&#x4F46;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x4EBA;&#x5BB6;&#x5728;&#x4E2D;&#x5B66;&#x63A5;&#x53D7;&#x7684;&#x6559;&#x80B2;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x5C42;&#x9762;&#x4E0A;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x6211;&#x4EEC;&#x7684;&#x672C;&#x79D1;&#x6559;&#x80B2;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x7684;&#x6559;&#x80B2;&#xFF0C;&#x672C;&#x8D28;&#x90FD;&#x662F;&#x6280;&#x80FD;&#x6559;&#x80B2;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x5C01;&#x95ED;&#x9886;&#x57DF;&#x4E2D;&#x5B8C;&#x6210;&#x4E00;&#x9053;&#x9898;&#x7684;&#x89E3;&#x7B54;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4F46;&#x5728;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x53BB;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x6B63;&#x80FD;&#x8BA9;&#x4F60;&#x53D7;&#x76CA;&#x4E00;&#x751F;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x8981;&#x76F8;&#x4FE1;&#x65F6;&#x52BF;&#x9020;&#x82F1;&#x96C4;&#xFF0C;&#x673A;&#x4F1A;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6CA1;&#x6709;&#x9519;&#x3002;&#x4F46;&#x6293;&#x4F4F;&#x673A;&#x4F1A;&#x7684;&#x4EBA;&#xFF0C;&#x76EE;&#x6807;&#x611F;&#x4E00;&#x5B9A;&#x7279;&#x522B;&#x5F3A;&#x3002;</p>
<h3 id="&#x4E09;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x539F;&#x5219;"><a href="#&#x4E09;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x539F;&#x5219;" class="headerlink" title="&#x4E09;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x539F;&#x5219;"></a>&#x4E09;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x539F;&#x5219;</h3><p>&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x7ACB;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x884C;&#x4E8B;&#x539F;&#x5219;&#x662F;&#x4EF6;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5DF4;&#x83F2;&#x7279;&#x6709;&#x4E00;&#x4E2A;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x53EB;&#x8292;&#x683C;&#xFF0C;&#x4ED6;&#x7684;&#x540D;&#x6C14;&#x5728;&#x4E2D;&#x56FD;&#x4E0D;&#x5982;&#x5DF4;&#x83F2;&#x7279;&#x5927;&#xFF0C;&#x4F46;&#x4ED6;&#x5728;&#x6295;&#x8D44;&#x754C;&#x6709;&#x5DE8;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x662F;&#x5DF4;&#x83F2;&#x7279;&#x975E;&#x5E38;&#x5F3A;&#x608D;&#x7684;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x3002;</p>
<p>&#x8292;&#x683C;&#x66FE;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x80FD;&#x591F;&#x505A;&#x5230;&#x8FD9;&#x4E9B;&#x6210;&#x5C31;&#x65E0;&#x975E;&#x5C31;&#x662F;&#xFF1A;&#x7B2C;&#x4E00;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x6309;&#x7167;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x539F;&#x5219;&#x53BB;&#x4E25;&#x683C;&#x505A;&#x4E8B;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x6700;&#x8FD1;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4E2A;&#x521B;&#x4E1A;&#x8005;&#xFF0C;&#x7F8E;&#x56E2;&#x7B2C;&#x5341;&#x53F7;&#x5458;&#x5DE5;&#xFF0C;&#x4ED6;&#x521B;&#x529E;&#x4E86;&#x6C34;&#x6EF4;&#x4E92;&#x52A9;&#x3002;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4FDD;&#x9669;&#x884C;&#x4E1A;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x6700;&#x5FEB;&#x7684;&#x9879;&#x76EE;&#x4E86;&#x3002;&#x4ED6;&#x8BF4;&#xFF0C;&#x81EA;&#x5DF1;&#x5728;&#x5927;&#x5B66;&#x65F6;&#x5C31;&#x6811;&#x7ACB;&#x4E86;&#x76EE;&#x6807;&#xFF0C;&#x4EE5;&#x540E;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x521B;&#x4E1A;&#x3002;&#x4F46;&#x4ED6;&#x8BA4;&#x4E3A;&#xFF0C;&#x51ED;&#x4ED6;&#x6BD5;&#x4E1A;&#x65F6;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x505A;&#x4E0D;&#x6210;&#x7684;&#x3002;&#x4ED6;&#x5FC5;&#x987B;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x725B;&#x7684;&#x56E2;&#x961F;&#x53BB;&#x5B66;&#x4E60;&#x3002;&#x4E8E;&#x662F;&#x4ED6;&#x60F3;&#x5C3D;&#x529E;&#x6CD5;&#x6700;&#x540E;&#x8FDB;&#x4E86;&#x7F8E;&#x56E2;&#xFF0C;&#x8FDB;&#x53BB;&#x540E;&#xFF0C;&#x73A9;&#x513F;&#x547D;&#x5DE5;&#x4F5C;&#xFF0C;&#x540E;&#x6765;&#x6210;&#x4E3A;&#x7F8E;&#x56E2;&#x6700;&#x5E74;&#x8F7B;&#x7684;&#x5927;&#x533A;&#x7ECF;&#x7406;&#x3002;</p>
<p>&#x4E0D;&#x5DE7;&#x7684;&#x662F;&#xFF0C;&#x7F8E;&#x56E2;&#x4ECE;&#x963F;&#x91CC;&#x6316;&#x6765;&#x4E86;&#x4E00;&#x4E2A;COO&#x3002;&#x89C2;&#x5BDF;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x7ED9;&#x51FA;&#x4ED6;&#x4E24;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x8981;&#x4E48;&#x5E73;&#x79FB;&#x53BB;&#x975E;&#x6838;&#x5FC3;&#x90E8;&#x95E8;&#xFF0C;&#x8981;&#x4E48;&#x8FDE;&#x964D;&#x4E24;&#x7EA7;&#x5411;&#x4ED6;&#x4E4B;&#x524D;&#x7684;&#x4E0B;&#x5C5E;&#x6C47;&#x62A5;&#x3002;&#x4F60;&#x4EEC;&#x77E5;&#x9053;&#x4ED6;&#x9009;&#x62E9;&#x4E86;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#x8FDE;&#x964D;&#x4E24;&#x7EA7;&#x3002;</p>
<p>&#x6211;&#x95EE;&#x4ED6;&#x539F;&#x56E0;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF0C;&#x4ED6;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#x4E3A;&#x521B;&#x4E1A;&#x53BB;&#x5B66;&#x4E60;&#x7ECF;&#x9A8C;&#xFF0C;&#x53BB;&#x78E8;&#x70BC;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x4E2A;COO&#x8BF4;&#x5F97;&#x5BF9;&#xFF0C;&#x6211;&#x7684;&#x4E1A;&#x7EE9;&#x9760;&#x7684;&#x662F;&#x4E2A;&#x4EBA;&#x62FC;&#x547D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9760;&#x56E2;&#x961F;&#x7EC4;&#x7EC7;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4ED6;&#x5B81;&#x53EF;&#x53BB;&#x5B66;&#x4E60;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8EB2;&#x907F;&#x59D4;&#x5C48;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5C0A;&#x5D07;&#x539F;&#x5219;&#x3002;</p>
<p>&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x5728;&#x5F88;&#x65E9;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5F00;&#x59CB;&#x6811;&#x7ACB;&#x539F;&#x5219;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6210;&#x957F;&#x539F;&#x5219;&#x3002;&#x6211;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#x4E0D;&#x8981;&#x592A;&#x5173;&#x6CE8;&#x5F53;&#x4E0B;&#x80FD;&#x53CA;&#x65F6;&#x5F97;&#x5230;&#x7684;&#x56DE;&#x62A5;&#xFF0C;&#x800C;&#x8981;&#x53BB;&#x770B;&#x957F;&#x8FDC;&#x80FD;&#x8FBE;&#x5230;&#x7684;&#x9AD8;&#x5EA6;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x8FFD;&#x6C42;&#x81EA;&#x6211;&#x6210;&#x957F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4ECE;&#x96C5;&#x864E;&#x51FA;&#x6765;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x53BB;&#x4E86;&#x5947;&#x864E;&#xFF0C;&#x5C3D;&#x7BA1;&#x767E;&#x5EA6;&#x7ED9;&#x6211;&#x7684;&#x5F85;&#x9047;&#x6BD4;&#x5947;&#x864E;&#x4F18;&#x539A;&#x5F97;&#x591A;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x6211;&#x6709;&#x673A;&#x4F1A;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x5E76;&#x5168;&#x529B;&#x4EE5;&#x8D74;&#x505A;&#x597D;&#x5B83;&#x3002;&#x540E;&#x6765;&#x5927;&#x5BB6;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x6211;&#x4E00;&#x624B;&#x5E26;&#x8D77;&#x4E86;360&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x5B9A;&#x6709;&#x4EBA;&#x597D;&#x5947;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;360&#x505A;&#x5230;&#x90A3;&#x4E48;&#x5927;&#x6211;&#x53C8;&#x8D70;&#x4E86;&#x5462;&#xFF1F;&#x8FD8;&#x662F;&#x539F;&#x5219;&#x3002;&#x5468;&#x9E3F;&#x794E;&#x8BF4;&#xFF0C;&#x4F60;&#x4E0D;&#x8981;&#x7BA1;&#x4E1A;&#x52A1;&#x4E86;&#xFF0C;&#x5DE5;&#x8D44;&#x6211;&#x4E5F;&#x7ED9;&#x4F60;&#x52A0;&#xFF0C;&#x4E0A;&#x5E02;&#x540E;&#x4F60;&#x4E5F;&#x6709;&#x4E00;&#x5927;&#x7B14;&#x94B1;&#x62FF;&#xFF0C;&#x6211;&#x5F53;&#x7136;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x9009;&#x3002;&#x56E0;&#x4E3A;&#x8FDD;&#x53CD;&#x4E86;&#x6211;&#x7684;&#x6210;&#x957F;&#x539F;&#x5219;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x575A;&#x6301;&#x4E0D;&#x7528;&#x76F4;&#x89C9;&#x5224;&#x65AD;&#x7684;&#x539F;&#x5219;&#x3002;&#x5C31;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x53EF;&#x4EE5;&#x62CD;&#x8111;&#x888B;&#x505A;&#x51B3;&#x5B9A;&#x3002;&#x6211;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#x9047;&#x5230;&#x4E8B;&#x60C5;&#x5FC5;&#x987B;&#x5148;&#x6C89;&#x6DC0;&#xFF0C;&#x7528;&#x6211;&#x7684;&#x903B;&#x8F91;&#x548C;&#x601D;&#x7EF4;&#x6846;&#x67B6;&#x53BB;&#x63A8;&#x6F14;&#x6574;&#x4E2A;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x5219;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x4E0D;&#x88AB;&#x60C5;&#x7EEA;&#x63A7;&#x5236;&#x3002;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x4F24;&#x5BB3;&#x4E86;&#x6211;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x88AB;&#x4F24;&#x5BB3;&#xFF0C;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x8106;&#x5F31;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x76F8;&#x4FE1;&#x6982;&#x7387;&#x8BBA;&#x3002;&#x867D;&#x7136;&#x4F60;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x81EA;&#x5DF1;&#x6BCF;&#x6B21;&#x505A;&#x7684;&#x51B3;&#x5B9A;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x4F60;&#x7EDD;&#x5BF9;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x51B3;&#x5B9A;&#x7684;&#x6982;&#x7387;&#x3002;&#x5982;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x505A;&#x51FA;&#x66F4;&#x8D34;&#x8FD1;&#x4E8B;&#x5B9E;&#x7684;&#x51B3;&#x5B9A;&#xFF0C;&#x7EC8;&#x5C31;&#x80FD;&#x5728;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x4E0A;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x539F;&#x5219;&#x5C31;&#x662F;&#x5C3A;&#x5B50;&#x3002;&#x4F60;&#x591A;&#x7ED9;&#x81EA;&#x5DF1;&#x6811;&#x7ACB;&#x51E0;&#x628A;&#x5C3A;&#x5B50;&#xFF0C;&#x505A;&#x4E8B;&#x60C5;&#x5C31;&#x6709;&#x4E86;&#x89C4;&#x77E9;&#x3002;&#x8FD9;&#x4E9B;&#x89C4;&#x77E9;&#x5C31;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x5E74;&#x8F7B;&#x4EBA;&#x521A;&#x521A;&#x5DE5;&#x4F5C;&#xFF0C;&#x5176;&#x5B9E;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x4E00;&#x6B21;&#x518D;&#x5B66;&#x4E60;&#x3002;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#x5F88;&#x591A;&#x793E;&#x4F1A;&#x77E5;&#x8BC6;&#xFF0C;&#x884C;&#x4E1A;&#x77E5;&#x8BC6;&#xFF0C;&#x4EE5;&#x53CA;&#x5B66;&#x4E60;&#x600E;&#x4E48;&#x505A;&#x597D;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x539F;&#x5219;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x3002;&#x6211;&#x4EEC;&#x62FF;&#x5927;&#x5BB6;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x7684;&#x72B9;&#x8C6B;&#x548C;&#x7EA0;&#x7ED3;&#x8FD9;&#x4E24;&#x4E2A;&#x60C5;&#x7EEA;&#x4E3E;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x4ED4;&#x7EC6;&#x601D;&#x8003;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x6027;&#x683C;&#x95EE;&#x9898;&#xFF0C;&#x672C;&#x8D28;&#x662F;&#x5224;&#x65AD;&#x529B;&#x4E0D;&#x8DB3;&#x7684;&#x8868;&#x73B0;&#x3002;&#x6211;&#x4EEC;&#x603B;&#x5938;&#xFF0C;&#x8C01;&#x8C01;&#x597D;&#x6709;&#x52C7;&#x6C14;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x51B3;&#x5B9A;&#x3002;&#x6211;&#x53D1;&#x73B0;&#x4E0D;&#x5BF9;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x6BD4;&#x522B;&#x4EBA;&#x679C;&#x6562;&#x4E0E;&#x5426;&#xFF0C;&#x800C;&#x662F;&#x662F;&#x5426;&#x517B;&#x6210;&#x4E86;&#x4E00;&#x5957;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5224;&#x65AD;&#x539F;&#x5219;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#x524D;&#x4E94;&#x516D;&#x5E74;&#xFF0C;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x90FD;&#x5F88;&#x4F4E;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x53BB;&#x603B;&#x7ED3;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x3002;&#x76F4;&#x5230;&#x6211;&#x60F3;&#x6E05;&#x695A;&#xFF0C;&#x72B9;&#x8C6B;&#x4E0D;&#x662F;&#x6027;&#x683C;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x4E0D;&#x5177;&#x5907;&#x90A3;&#x79CD;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x60C5;&#x51B5;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x76F4;&#x8BF4;&#x79BB;&#x5F00;&#x96C5;&#x864E;&#xFF0C;&#x53BB;&#x4E86;360&#x662F;&#x6211;&#x6BD4;&#x8F83;&#x5E78;&#x8FD0;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x80CC;&#x540E;&#x4E5F;&#x6709;&#x539F;&#x5219;&#x2014;&#x2014;&#x90A3;&#x5C31;&#x662F;&#x4E0D;&#x80FD;&#x56E0;&#x4E3A;&#x8FFD;&#x6C42;&#x5B89;&#x5168;&#x800C;&#x53BB;&#x505A;&#x4E00;&#x4E2A;&#x770B;&#x4F3C;&#x5B89;&#x5168;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x7ED9;&#x5927;&#x5BB6;&#x7684;&#x5EFA;&#x8BAE;&#x5C31;&#x662F;&#x786E;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x5219;&#x3002;&#x4F60;&#x5C06;&#x6765;&#x4E00;&#x5B9A;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x95EE;&#x9898;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x7528;&#x4F60;&#x7684;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x53BB;&#x68C0;&#x6D4B;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x6B21;&#x6211;&#x8DDF;&#x7F57;&#x6C38;&#x6D69;&#x5403;&#x996D;&#xFF0C;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x521B;&#x4E1A;&#xFF0C;&#x7EDD;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x81EA;&#x5DF1;&#x8FD9;&#x4E48;&#x61D2;&#x6563;&#x7684;&#x4EBA;&#x80FD;&#x53D8;&#x5F97;&#x8FD9;&#x4E48;&#x52E4;&#x594B;&#x3002;&#x52E4;&#x594B;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x8FD8;&#x662F;&#x4ED6;&#x65E9;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#x81EA;&#x5DF1;&#x5DE5;&#x4F5C;&#x7684;&#x539F;&#x5219;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x539F;&#x5219;&#x8FD8;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5C0F;&#x9A6C;&#x8FC7;&#x6CB3;&#x7684;&#x7A98;&#x5883;&#x3002;&#x600E;&#x4E48;&#x8BB2;&#xFF1F;&#x6211;&#x9762;&#x8BD5;&#x4EBA;&#x65F6;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x4EBA;&#x8BF4;&#xFF0C;&#x6211;&#x56DE;&#x53BB;&#x8DDF;&#x8001;&#x5A46;&#x5546;&#x91CF;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x8DDF;&#x7236;&#x6BCD;&#x5546;&#x91CF;&#x4E00;&#x4E0B;&#x3002;&#x6211;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x8003;&#x91CF;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x662F;&#x5426;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E8B;&#x539F;&#x5219;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x8BF4;&#x670D;&#x5BB6;&#x4EBA;&#x3002;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4ED6;&#x4EEC;&#x62FF;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x548C;&#x4F60;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<h3 id="&#x7B2C;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x5B66;&#x4E60;"><a href="#&#x7B2C;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x5B66;&#x4E60;" class="headerlink" title="&#x7B2C;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x5B66;&#x4E60;"></a>&#x7B2C;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x5B66;&#x4E60;</h3><p>&#x4E00;&#x5B9A;&#x8981;&#x62B1;&#x7740;&#x5B66;&#x4E60;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x5F00;&#x59CB;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x4E4B;&#x65C5;&#x3002;&#x8292;&#x683C;80&#x591A;&#x5C81;&#x65F6;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x80FD;&#x6DD8;&#x6C70;&#x81EA;&#x5DF1;&#x4E00;&#x5E74;&#x524D;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x6211;&#x5C31;&#x767D;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x65F6;&#x4EE3;&#x7684;&#x53D8;&#x5316;&#x901F;&#x5EA6;&#xFF0C;&#x6108;&#x53D1;&#x60CA;&#x4EBA;&#x3002;&#x8FD9;&#x6B21;&#x53BB;&#x53F0;&#x5317;&#xFF0C;&#x90A3;&#x91CC;&#x4EBA;&#x544A;&#x8BC9;&#x6211;&#x5F00;&#x59CB;&#x7ECF;&#x5E38;&#x53BB;&#x5317;&#x4EAC;&#xFF0C;&#x4E0D;&#x613F;&#x610F;&#x7559;&#x5728;&#x53F0;&#x5317;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x53BB;&#x5317;&#x4EAC;&#xFF0C;&#x90FD;&#x89C9;&#x5F97;&#x53D8;&#x5316;&#x597D;&#x5927;&#x3002;&#x4E24;&#x4E2A;&#x6708;&#x6CA1;&#x6765;&#xFF0C;&#x5230;&#x5904;&#x90FD;&#x662F;&#x5171;&#x4EAB;&#x5355;&#x8F66;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x771F;&#x7684;&#x8DDF;&#x4EE5;&#x5F80;&#x592A;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4EE5;&#x524D;&#xFF0C;&#x519C;&#x4E1A;&#x6587;&#x660E;&#x65F6;&#x671F;&#xFF0C;&#x5F3A;&#x8C03;&#x719F;&#x80FD;&#x751F;&#x5DE7;&#xFF1B;&#x4E2D;&#x533B;&#x7406;&#x8BBA;&#x5343;&#x5E74;&#x4E0D;&#x53D8;&#xFF0C;&#x8001;&#x4E2D;&#x533B;&#x8D8A;&#x8001;&#x8D8A;&#x503C;&#x94B1;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x4E09;&#x56DB;&#x5E74;&#x524D;&#x7684;&#x77E5;&#x8BC6;&#x5F88;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x5931;&#x6548;&#xFF0C;&#x4E24;&#x4E09;&#x5E74;&#x79EF;&#x7D2F;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x9A6C;&#x4E0A;&#x5C31;&#x4F1A;&#x6CA1;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x6478;&#x7D22;&#x65F6;&#x4EE3;&#x80CC;&#x540E;&#x7684;&#x5927;&#x89C4;&#x5F8B;&#xFF0C;&#x6700;&#x540E;&#x603B;&#x7ED3;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E8B;&#x539F;&#x5219;&#x3002;</p>
<p>&#x6211;&#x8BB0;&#x5F97;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8DDF;&#x5468;&#x9E3F;&#x794E;&#x5F00;&#x4F1A;&#x65F6;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF0C;&#x4F60;&#x505A;&#x4E2A;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#xFF0C;&#x8BB2;&#x4E86;&#x5927;&#x6982;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x800C;&#x90A3;&#x4E2A;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#xFF0C;&#x6211;&#x505A;&#x5230;&#x4E86;&#x534A;&#x591C;&#x4E09;&#x70B9;&#x3002;&#x6211;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x7422;&#x78E8;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4ED6;&#x8981;&#x8FD9;&#x4E48;&#x8BB2;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x60F3;&#xFF0C;&#x53BB;&#x63D0;&#x70BC;&#x3002;&#x56E0;&#x4E3A;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#x9700;&#x8981;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x4E9B;&#x7EB2;&#x9886;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x628A;&#x6574;&#x4E2A;&#x7EAA;&#x8981;&#x7684;&#x8981;&#x9886;&#x5199;&#x6210;&#x4E00;&#x884C;&#x4E00;&#x884C;&#xFF0C;&#x5173;&#x952E;&#x5730;&#x65B9;&#x6807;&#x9ED1;&#xFF0C;&#x5927;&#x70B9;&#x5E95;&#x4E0B;&#x6709;&#x5C0F;&#x70B9;&#xFF0C;&#x4E00;&#x773C;&#x5C31;&#x80FD;&#x770B;&#x5B8C;&#xFF0C;&#x8FD8;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x7684;&#x6458;&#x8981;&#xFF0C;&#x8FD9;&#x6837;&#x4ED6;&#x770B;&#x90AE;&#x4EF6;&#x65F6;&#xFF0C;&#x54EA;&#x6015;&#x4E0D;&#x6253;&#x5F00;&#x9644;&#x4EF6;&#xFF0C;&#x57FA;&#x672C;&#x4E5F;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4F1A;&#x8BAE;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E0D;&#x4EC5;&#x662F;&#x4E3A;&#x4E0A;&#x7EA7;&#x670D;&#x52A1;&#xFF0C;&#x6574;&#x7406;&#x3001;&#x63D0;&#x70BC;&#x3001;&#x53CD;&#x601D;&#x3001;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x7684;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#x5BF9;&#x81EA;&#x5DF1;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x4ECE;&#x6B64;&#x4EE5;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x6709;&#x6211;&#x53C2;&#x52A0;&#x7684;&#x6240;&#x6709;&#x4F1A;&#x8BAE;&#xFF0C;&#x5468;&#x9E3F;&#x794E;&#x90FD;&#x8BA9;&#x6211;&#x505A;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E2A;&#x4F53;&#x529B;&#x6D3B;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x8FD8;&#x6709;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x6211;&#x603B;&#x7ED3;&#x53EB;&#x7A7A;&#x676F;&#x5FC3;&#x6001;&#xFF0C;Stay Foolish&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x771F;&#x628A;&#x81EA;&#x5DF1;&#x770B;&#x5F97;&#x5F88;&#x4F4E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5F88;&#x96BE;&#x3002;</p>
<p>&#x6211;&#x5F53;&#x5E74;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x672C;&#x79D1;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x5F00;&#x59CB;&#x5317;&#x6F02;&#x540E;&#x53C8;&#x9047;&#x5230;&#x5F88;&#x591A;&#x56F0;&#x96BE;&#x3002;&#x56DE;&#x5934;&#x770B;&#xFF0C;&#x8FD9;&#x53CD;&#x800C;&#x6210;&#x4E86;&#x597D;&#x4E8B;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x9047;&#x89C1;&#x4E00;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x4F1A;&#x60F3;&#x8FD9;&#x4EBA;&#x597D;&#x806A;&#x660E;&#xFF0C;&#x8BA4;&#x771F;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x4EBA;&#x592A;&#x50BB;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x600E;&#x4E48;&#x3002;</p>
<p>&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x4EE5;&#x81F4;&#x6BCF;&#x6B21;&#xFF0C;&#x6211;&#x90FD;&#x80FD;&#x4ECE;&#x8DDF;&#x522B;&#x4EBA;&#x7684;&#x4EA4;&#x6D41;&#x4E2D;&#xFF0C;&#x4ECE;&#x4F1A;&#x8BAE;&#x4E2D;&#xFF0C;&#x53BB;&#x503E;&#x542C;&#xFF0C;&#x53BB;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="&#x7B2C;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x884C;&#x52A8;"><a href="#&#x7B2C;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x884C;&#x52A8;" class="headerlink" title="&#x7B2C;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x884C;&#x52A8;"></a>&#x7B2C;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x662F;&#xFF1A;&#x884C;&#x52A8;</h3><p>&#x5F53;&#x4F60;&#x6709;&#x4E86;&#x76EE;&#x6807;&#xFF0C;&#x6811;&#x7ACB;&#x4E86;&#x539F;&#x5219;&#xFF0C;&#x53C8;&#x6709;&#x5B66;&#x4E60;&#x5FC3;&#x6001;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x7528;&#x884C;&#x52A8;&#x6765;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x8BA4;&#x77E5;&#x3002;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7528;&#x5B9E;&#x8DF5;&#x53BB;&#x68C0;&#x9A8C;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x518D;&#x601D;&#x8003;&#x76EE;&#x6807;&#xFF0C;&#x5BA1;&#x89C6;&#x539F;&#x5219;&#xFF0C;&#x6700;&#x7EC8;&#x5C31;&#x4F1A;&#x5F62;&#x6210;&#x4E00;&#x5957;&#x5173;&#x4E8E;&#x81EA;&#x6211;&#x6210;&#x957F;&#x7684;&#x3001;&#x95ED;&#x73AF;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;</p>
<p>&#x60F3;&#x5FC5;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x6700;&#x80D6;&#x65F6;&#x5230;&#x8FC7;190&#x65A4;&#xFF0C;&#x51CF;&#x80A5;&#x51CF;&#x4E86;&#x6709;40&#x65A4;&#xFF0C;&#x4F46;&#x6211;&#x51CF;&#x80A5;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x4E0D;&#x662F;&#x6BC5;&#x529B;&#xFF0C;&#x800C;&#x662F;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;&#x6211;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x6574;&#x5957;&#x51CF;&#x80A5;&#x5927;&#x6CD5;&#xFF0C;&#x4E25;&#x683C;&#x9075;&#x5FAA;&#x80FD;&#x91CF;&#x7406;&#x8BBA;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x5C31;&#x51CF;&#x4E0B;&#x4E86;20&#x65A4;&#x3002;</p>
<p>&#x51CF;&#x80A5;&#x4E4B;&#x540E;&#xFF0C;&#x53C8;&#x60F3;&#x53BB;&#x8DD1;&#x6B65;&#xFF0C;&#x53EF;&#x6211;&#x8DD1;&#x6B65;&#x771F;&#x7684;&#x7279;&#x522B;&#x5DEE;&#xFF0C;1&#x516C;&#x91CC;&#x90FD;&#x8DD1;&#x4E0D;&#x4E0B;&#x6765;&#x3002;&#x5C31;&#x5728;&#x6211;&#x8D28;&#x7591;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x4E0D;&#x9002;&#x5408;&#x8DD1;&#x6B65;&#x65F6;&#xFF0C;&#x5F00;&#x59CB;&#x94BB;&#x7814;&#x8DD1;&#x6B65;&#x7684;&#x4E66;&#x3002;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#xFF0C;&#x4EBA;&#x7C7B;&#x662F;&#x957F;&#x8DD1;&#x4E4B;&#x738B;&#x3002;</p>
<p>&#x636E;&#x8BF4;&#x5F88;&#x4E45;&#x524D;&#xFF0C;&#x4EBA;&#x7C7B;&#x7684;&#x7956;&#x5148;&#x5728;&#x975E;&#x6D32;&#x5927;&#x8349;&#x539F;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x53EA;&#x7F9A;&#x7F8A;&#xFF0C;&#x5C31;&#x53BB;&#x8FFD;&#x5B83;&#xFF0C;&#x4E00;&#x76F4;&#x8FFD;&#x5230;&#x4E86;&#x7F9A;&#x7F8A;&#x5410;&#x8840;&#x800C;&#x6B7B;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x5B83;&#x5403;&#x4E86;&#x3002;&#x800C;&#x4EBA;&#x7C7B;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x6D3B;&#x8FC7;&#x6765;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x51CF;&#x80A5;&#x4E5F;&#x4E00;&#x6837;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x5236;&#x5B9A;&#x8BAD;&#x7EC3;&#x8BA1;&#x5212;&#x540E;&#xFF0C;&#x6700;&#x8FD1;&#x4E00;&#x6B21;&#x534A;&#x9A6C;&#xFF0C;&#x6211;&#x8DD1;&#x8FDB;&#x4E86;2&#x5C0F;&#x65F6;&#x3002;</p>
<p>&#x884C;&#x52A8;&#x8DDF;&#x5174;&#x8DA3;&#x662F;&#x5206;&#x4E0D;&#x5F00;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x6CA1;&#x5174;&#x8DA3;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x77E5;&#x9053;&#x4E50;&#x8DA3;&#x4F55;&#x5728;&#x3002;&#x5F53;&#x4F60;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x7814;&#x7A76;&#x8DB3;&#x591F;&#x6DF1;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x559C;&#x6B22;&#x5B83;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#x3002;</p>
<p>&#x800C;&#x5174;&#x8DA3;&#x4ECD;&#x7136;&#x53EA;&#x662F;&#x5F00;&#x59CB;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x4EF6;&#x4E8B;&#x662F;&#x884C;&#x52A8;&#x7ED5;&#x4E0D;&#x5F00;&#x7684;&#x2014;&#x2014;&#x90A3;&#x5C31;&#x662F;&#x76EE;&#x6807;&#x548C;&#x52E4;&#x594B;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5C0F;&#x7C73;&#xFF0C;&#x8FD8;&#x662F;&#x730E;&#x8C79;&#xFF0C;&#x90FD;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x8270;&#x96BE;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x90FD;&#x662F;&#x4E00;&#x8FB9;&#x62FC;&#x4E00;&#x8FB9;&#x5B66;&#x3002;</p>
<p>&#x5E74;&#x8F7B;&#x4EBA;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x6000;&#x624D;&#x4E0D;&#x9047;&#xFF0C;&#x4F46;&#x6211;&#x9001;&#x5927;&#x5BB6;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x662F;&#x8054;&#x60F3;&#x67F3;&#x4F20;&#x5FD7;&#x5F53;&#x5E74;&#x8BB2;&#x7ED9;&#x6768;&#x5143;&#x5E86;&#x7684;&#x3002;&#x4ED6;&#x8BF4;&#xFF0C;&#x9996;&#x5148;&#x4F60;&#x81EA;&#x5DF1;&#x8981;&#x53D8;&#x5F97;&#x5F88;&#x5F3A;&#x3002;&#x4E24;&#x53EA;&#x5C0F;&#x9E21;&#x76F8;&#x89C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x89C9;&#x5F97;&#x5BF9;&#x65B9;&#x548B;&#x6837;&#x3002;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x5730;&#x9AD8;&#x770B;&#x81EA;&#x5DF1;&#xFF0C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x5730;&#x4F4E;&#x770B;&#x522B;&#x4EBA;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4F60;&#x53D8;&#x6210;&#x9E35;&#x9E1F;&#x90A3;&#x4E48;&#x5927;&#x65F6;&#xFF0C;&#x522B;&#x7684;&#x5C0F;&#x9E21;&#x624D;&#x4F1A;&#x627F;&#x8BA4;&#x4F60;&#x7684;&#x786E;&#x633A;&#x5927;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x505A;&#x51FA;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x662F;&#x552F;&#x4E00;&#x80FD;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#xFF0C;&#x5E76;&#x4F7F;&#x81EA;&#x5DF1;&#x8131;&#x9896;&#x800C;&#x51FA;&#x7684;&#x660E;&#x667A;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x4EBA;&#x90FD;&#x662F;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x7A81;&#x7834;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x5708;&#x8D70;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x5E74;&#x8F7B;&#x4EBA;&#x9996;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x4E70;&#x623F;&#xFF0C;&#x800C;&#x662F;&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x524D;20%&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x524D;&#x63D0;&#x3002;&#x5982;&#x679C;&#x80FD;&#x6210;&#x4E3A;&#x8FD9;20%&#x5F53;&#x4E2D;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x7136;&#x5404;&#x79CD;&#x798F;&#x5229;&#x5C31;&#x6709;&#x673A;&#x4F1A;&#x53BB;&#x4EAB;&#x53D7;&#x3002;</p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4F60;&#x8FD8;&#x8981;&#x8FFD;&#x6C42;&#x7206;&#x53D1;&#x6027;&#x589E;&#x957F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FFD;&#x6C42;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x793E;&#x4F1A;&#x6027;&#x5E73;&#x5747;&#x589E;&#x957F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x4E0D;&#x65AD;&#x83B7;&#x5F97;&#x8DC3;&#x8FC1;&#xFF0C;&#x9996;&#x5148;&#x5C31;&#x8981;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x4E0A;&#x8DB3;&#x591F;&#x51FA;&#x8272;&#x3002;</p>
<p>&#x6211;&#x7ECF;&#x5E38;&#x8DDF;&#x5F88;&#x591A;&#x540C;&#x4E8B;&#x8BB2;&#xFF0C;&#x4E94;&#x5E74;&#x540E;&#x7684;&#x4F60;&#xFF0C;&#x4E0D;&#x662F;&#x5728;&#x8DDF;&#x4ECA;&#x5929;&#x7684;&#x4F60;&#x505A;&#x5BF9;&#x6BD4;&#xFF0C;&#x800C;&#x662F;&#x548C;&#x4F60;&#x7684;&#x90A3;&#x4E9B;&#x540C;&#x9F84;&#x4EBA;&#x4F5C;&#x5BF9;&#x6BD4;&#x3002;&#x53EA;&#x6709;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x5353;&#x5C14;&#x4E0D;&#x7FA4;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x6211;&#x975E;&#x5E38;&#x5E0C;&#x671B;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x673A;&#x4F1A;&#x7ED9;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x975E;&#x5E38;&#x671F;&#x5F85;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x6D8C;&#x73B0;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x516C;&#x53F8;&#x548C;&#x4E2A;&#x4EBA;&#x6700;&#x7EC8;&#x5C31;&#x662F;&#x76F8;&#x4E92;&#x6210;&#x5C31;&#xFF0C;&#x76F8;&#x4E92;&#x6210;&#x957F;&#x3002;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x662F;&#x5C5E;&#x4E8E;&#x516C;&#x53F8;&#xFF0C;&#x4F46;&#x5DE5;&#x4F5C;&#x56DE;&#x9988;&#x7ED9;&#x4F60;&#x7684;&#x662F;&#x96BE;&#x4EE5;&#x590D;&#x5236;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x867D;&#x7136;&#x4F60;&#x4EEC;&#x90FD;&#x5728;&#x4E3A;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x66F4;&#x91CD;&#x8981;&#x662F;&#x5728;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x957F;&#x800C;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x624D;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x52AA;&#x529B;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x524D;&#x63D0;&#x3002;</p>
<hr>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/08/04/（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词/" data-id="ck8zoabdw0049vquoxz1aze8m" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/鸡汤/">鸡汤</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2018/06/25/遇到的小问题/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          遇到的小问题
        
      </div>
    </a>
  
  
    <a href="/2017/06/27/Android ANR和OOM/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Android ANR和OOM</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android/">Android</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-UI/">Android UI</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-Framework/">Android_Framework</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android反编译/">Android反编译</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Http请求流程/">Http请求流程</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/IDE/">IDE</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Java/">Java</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/JavaWeb/">JavaWeb</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Jenkins/">Jenkins</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux-mysql/">Linux mysql</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/idea/">idea</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/mac/">mac</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/互联网/">互联网</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/代理/">代理</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/兴趣/">兴趣</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/区块链和比特币/">区块链和比特币</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/博客/">博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/大牛博客/">大牛博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/学习，师傅/">学习，师傅</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/工具/">工具</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/开源项目/">开源项目</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/微信-Js/">微信 Js</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/自动化测试/">自动化测试</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/自律/">自律</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/计算机运维/">计算机运维</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/鸡汤/">鸡汤</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/黑客攻防/">黑客攻防</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Android/" style="font-size: 18.33px;">Android</a> <a href="/tags/Android-UI/" style="font-size: 10px;">Android UI</a> <a href="/tags/Android-Framework/" style="font-size: 20px;">Android_Framework</a> <a href="/tags/Android反编译/" style="font-size: 10px;">Android反编译</a> <a href="/tags/Http请求流程/" style="font-size: 10px;">Http请求流程</a> <a href="/tags/IDE/" style="font-size: 10px;">IDE</a> <a href="/tags/Java/" style="font-size: 15px;">Java</a> <a href="/tags/JavaWeb/" style="font-size: 16.67px;">JavaWeb</a> <a href="/tags/Jenkins/" style="font-size: 11.67px;">Jenkins</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Linux-mysql/" style="font-size: 10px;">Linux mysql</a> <a href="/tags/Unity3D/" style="font-size: 13.33px;">Unity3D</a> <a href="/tags/idea/" style="font-size: 10px;">idea</a> <a href="/tags/mac/" style="font-size: 10px;">mac</a> <a href="/tags/互联网/" style="font-size: 10px;">互联网</a> <a href="/tags/代理/" style="font-size: 10px;">代理</a> <a href="/tags/兴趣/" style="font-size: 10px;">兴趣</a> <a href="/tags/区块链和比特币/" style="font-size: 10px;">区块链和比特币</a> <a href="/tags/博客/" style="font-size: 11.67px;">博客</a> <a href="/tags/大牛博客/" style="font-size: 10px;">大牛博客</a> <a href="/tags/学习，师傅/" style="font-size: 10px;">学习，师傅</a> <a href="/tags/工具/" style="font-size: 10px;">工具</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/微信-Js/" style="font-size: 10px;">微信 Js</a> <a href="/tags/自动化测试/" style="font-size: 10px;">自动化测试</a> <a href="/tags/自律/" style="font-size: 10px;">自律</a> <a href="/tags/计算机运维/" style="font-size: 10px;">计算机运维</a> <a href="/tags/鸡汤/" style="font-size: 11.67px;">鸡汤</a> <a href="/tags/黑客攻防/" style="font-size: 11.67px;">黑客攻防</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2020/04/">四月 2020</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/10/">十月 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/07/">七月 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/06/">六月 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">八月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/06/">六月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">二月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2020/04/14/自律/">自律方法</a>
          </li>
        
          <li>
            <a href="/2018/10/11/JavaWeb dubbo使用/">JavaWeb Dubbo使用</a>
          </li>
        
          <li>
            <a href="/2018/07/13/使用Gitlab Jenkins Docker建立CI部署方案/">使用Gitlab Jenkins Docker建立CI部署方案</a>
          </li>
        
          <li>
            <a href="/2018/06/25/遇到的小问题/">遇到的小问题</a>
          </li>
        
          <li>
            <a href="/2017/08/04/（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词/">（转载）傅盛：年轻人首要考虑的不应是买房，而是这四个关键词</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2020 huanxingxyz<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>