<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>互联网时代，我眼中的架构变迁 | 田鹏飞的个人博客</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x53D8;&amp;#x8FC1;&amp;#x5355;&amp;#x673A;&amp;#x65F6;&amp;#x4EE3;&amp;#x3001;&amp;#x96C6;&amp;#x7FA4;&amp;#x65F6;&amp;#x4EE3;&amp;#x548C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x65F6;&amp;#x4EE3;&amp;#x3002;">
<meta property="og:type" content="article">
<meta property="og:title" content="互联网时代，我眼中的架构变迁">
<meta property="og:url" content="http://yoursite.com/2017/01/12/互联网时代，我眼中的架构变迁/index.html">
<meta property="og:site_name" content="田鹏飞的个人博客">
<meta property="og:description" content="&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x53D8;&amp;#x8FC1;&amp;#x5355;&amp;#x673A;&amp;#x65F6;&amp;#x4EE3;&amp;#x3001;&amp;#x96C6;&amp;#x7FA4;&amp;#x65F6;&amp;#x4EE3;&amp;#x548C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x65F6;&amp;#x4EE3;&amp;#x3002;">
<meta property="og:updated_time" content="2017-01-16T08:52:26.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="互联网时代，我眼中的架构变迁">
<meta name="twitter:description" content="&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x7684;&amp;#x67B6;&amp;#x6784;&amp;#x7684;&amp;#x53D8;&amp;#x8FC1;&amp;#x5355;&amp;#x673A;&amp;#x65F6;&amp;#x4EE3;&amp;#x3001;&amp;#x96C6;&amp;#x7FA4;&amp;#x65F6;&amp;#x4EE3;&amp;#x548C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x65F6;&amp;#x4EE3;&amp;#x3002;">
  
    <link rel="alternate" href="/atom.xml" title="田鹏飞的个人博客" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">田鹏飞的个人博客</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">你若盛开，蝴蝶自来</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Søk"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-互联网时代，我眼中的架构变迁" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/01/12/互联网时代，我眼中的架构变迁/" class="article-date">
  <time datetime="2017-01-12T08:17:05.000Z" itemprop="datePublished">2017-01-12</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      互联网时代，我眼中的架构变迁
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h3 id="&#x4E92;&#x8054;&#x7F51;&#x7684;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x8FC1;"><a href="#&#x4E92;&#x8054;&#x7F51;&#x7684;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x8FC1;" class="headerlink" title="&#x4E92;&#x8054;&#x7F51;&#x7684;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x8FC1;"></a>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x8FC1;</h3><p>&#x5355;&#x673A;&#x65F6;&#x4EE3;&#x3001;&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;&#x3002;&#x4E09;&#x4E2A;&#x65F6;&#x4EE3;&#x5E76;&#x975E;&#x6309;&#x7167;&#x5386;&#x53F2;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x7531;&#x56E2;&#x961F;&#x6216;&#x4EA7;&#x54C1;&#x6240;&#x5904;&#x7684;&#x65F6;&#x671F;&#x6765;&#x51B3;&#x5B9A;&#x3002;</p>
<h2 id="&#x5355;&#x673A;&#x65F6;&#x4EE3;"><a href="#&#x5355;&#x673A;&#x65F6;&#x4EE3;" class="headerlink" title="&#x5355;&#x673A;&#x65F6;&#x4EE3;"></a>&#x5355;&#x673A;&#x65F6;&#x4EE3;</h2><p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x6574;&#x4F53;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#xFF0C;&#x5177;&#x4F53;&#x683C;&#x5F0F;&#x4F9D;&#x8D56;&#x4E8E;&#x5E94;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x6846;&#x67B6;&#xFF0C;&#x4F8B;&#x5982; Java &#x7684; WAR &#x6587;&#x4EF6;&#x3001;Rails &#x7684;&#x76EE;&#x5F55;&#x6587;&#x4EF6;&#xFF0C;&#x6B64;&#x79CD;&#x67B6;&#x6784;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x3002;</p>
<h3 id="&#x5355;&#x673A;&#x67B6;&#x6784;"><a href="#&#x5355;&#x673A;&#x67B6;&#x6784;" class="headerlink" title="&#x5355;&#x673A;&#x67B6;&#x6784;"></a>&#x5355;&#x673A;&#x67B6;&#x6784;</h3><p>&#x4F18;&#x70B9;&#xFF1A;&#x5982;&#x4E0A;&#x6587;&#x6240;&#x8FF0;&#xFF0C;&#x7B80;&#x5355;&#x5FEB;&#x901F;&#xFF0C;&#x6613;&#x4E8E;&#x5F00;&#x53D1;&#xFF0C;&#x6613;&#x4E8E;&#x6D4B;&#x8BD5;&#xFF0C;&#x6613;&#x4E8E;&#x90E8;&#x7F72;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x4E5F;&#x975E;&#x5E38;&#x663E;&#x8457;&#xFF0C;&#x53EA;&#x9002;&#x5408;&#x65E9;&#x671F;&#x9879;&#x76EE;&#xFF0C;&#x53D8;&#x5927;&#x540E;&#x4E0D;&#x6613;&#x7EF4;&#x62A4;&#xFF0C;&#x4E14;&#x5B58;&#x5728;&#x5355;&#x70B9;&#xFF0C;&#x5347;&#x7EA7;&#x9700;&#x8981;&#x505C;&#x670D;</p>
<h3 id="&#x5206;&#x5C42;&#x67B6;&#x6784;"><a href="#&#x5206;&#x5C42;&#x67B6;&#x6784;" class="headerlink" title="&#x5206;&#x5C42;&#x67B6;&#x6784;"></a>&#x5206;&#x5C42;&#x67B6;&#x6784;</h3><p>&#x660E;&#x773C;&#x7684;&#x4EBA;&#x5F88;&#x5FEB;&#x53D1;&#x73B0;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x663E;&#x5F97;&#x6742;&#x4E71;&#x65E0;&#x7AE0;&#xFF0C;&#x8FD9;&#x5728;&#x65E9;&#x671F;&#x7684; Web &#x5F00;&#x53D1;&#x4E2D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;JSP+JDBC&#xFF0C;ASP+ADO&#xFF0C;&#x4F46;&#x8FD9;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53CB;&#x597D;&#x7684;&#x6807;&#x51C6;&#x67B6;&#x6784;&#xFF0C;&#x4E8E;&#x662F;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x8868;&#x73B0;&#x5C42;&#xFF08;presentation&#xFF09;&#x3001;&#x4E1A;&#x52A1;&#x5C42;&#xFF08;business&#xFF09;&#x3001;&#x6301;&#x4E45;&#x5C42;&#xFF08;persistence&#xFF09;&#x548C;&#x6570;&#x636E;&#x5E93;&#xFF08;database&#xFF09;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;MVC&#x67B6;&#x6784;&#x4E86;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#xFF0C;&#x5206;&#x5DE5;&#x660E;&#x786E;&#xFF0C;&#x5206;&#x5C42;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x4EC0;&#x4E48;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x65F6;&#xFF0C;&#x63A8;&#x8350;&#x7528;&#x5B83;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x6269;&#x5C55;&#x6027;&#x5DEE;&#xFF0C;&#x8FED;&#x4EE3;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x4F4E;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5C42;&#x6B21;&#x8FC7;&#x591A;&#x5BFC;&#x81F4;&#x6D41;&#x7A0B;&#x590D;&#x6742;</p>
<h3 id="&#x6570;&#x636E;&#x5206;&#x79BB;"><a href="#&#x6570;&#x636E;&#x5206;&#x79BB;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x79BB;"></a>&#x6570;&#x636E;&#x5206;&#x79BB;</h3><p>&#x4F18;&#x70B9;&#xFF1A;&#x8D44;&#x6E90;&#x5206;&#x6563;&#xFF0C;&#x63D0;&#x9AD8;&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5BF9;&#x786C;&#x4EF6;&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x65B9;&#x4FBF;&#x7EF4;&#x62A4;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x589E;&#x52A0;&#x4E86;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x548C;&#x7F51;&#x7EDC;&#x5F00;&#x9500;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5B58;&#x5728;&#x5355;&#x70B9;</p>
<h3 id="&#x7F13;&#x5B58;&#x767B;&#x573A;"><a href="#&#x7F13;&#x5B58;&#x767B;&#x573A;" class="headerlink" title="&#x7F13;&#x5B58;&#x767B;&#x573A;"></a>&#x7F13;&#x5B58;&#x767B;&#x573A;</h3><p>&#x4EA7;&#x54C1;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x53E3;&#x7891;&#xFF0C;&#x7528;&#x6237;&#x91CF;&#x6301;&#x7EED;&#x589E;&#x957F;&#xFF0C;&#x8BBF;&#x95EE;&#x5F00;&#x59CB;&#x9891;&#x7E41;&#xFF0C;&#x60F3;&#x63D0;&#x5347;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#xFF0C;&#x7F13;&#x5B58;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#xFF0C;&#x95EA;&#x4EAE;&#x767B;&#x573A;.</p>
<p>&#x670D;&#x52A1;&#x7AEF;&#x7F13;&#x5B58;&#x53C8;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x548C;&#x8FDC;&#x7A0B;&#x7F13;&#x5B58;&#xFF0C;&#x5404;&#x6709;&#x4F18;&#x52A3;&#xFF0C;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x5FEB;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x800C;&#x4E14;&#x540E;&#x7EED;&#x96C6;&#x7FA4;&#x5316;&#x4E0D;&#x65B9;&#x4FBF;&#x5171;&#x4EAB;&#xFF1B;&#x8FDC;&#x7A0B;&#x7F13;&#x5B58;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#xFF0C;&#x53EF;&#x4EE5;&#x96C6;&#x7FA4;&#xFF0C;&#x5BB9;&#x91CF;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x7F13;&#x5B58;&#x66F4;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x7B80;&#x5355;&#x6709;&#x6548;&#xFF0C;&#x51CF;&#x5C11;&#x5BF9; DB &#x7684;&#x67E5;&#x8BE2;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x589E;&#x52A0;&#x903B;&#x8F91;&#x5224;&#x65AD;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x5B58;&#x50A8;&#x5927;&#x5BF9;&#x8C61;&#xFF0C;&#x6B64;&#x67B6;&#x6784;&#x540C;&#x6837;&#x6709;&#x5355;&#x70B9;.</p>
<h3 id="&#x8BFB;&#x5199;&#x5206;&#x79BB;"><a href="#&#x8BFB;&#x5199;&#x5206;&#x79BB;" class="headerlink" title="&#x8BFB;&#x5199;&#x5206;&#x79BB;"></a>&#x8BFB;&#x5199;&#x5206;&#x79BB;</h3><p>&#x5E02;&#x573A;&#x53CD;&#x54CD;&#x4E0D;&#x9519;&#xFF0C;&#x4E1A;&#x52A1;&#x4E5F;&#x5728;&#x6301;&#x7EED;&#x589E;&#x957F;&#xFF0C;&#x4F46;&#x6027;&#x80FD;&#x53C8;&#x6709;&#x6240;&#x4E0B;&#x964D;&#xFF0C;&#x5206;&#x6790;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#xFF0C;&#x53D1;&#x73B0;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x5199;&#x975E;&#x5E38;&#x9891;&#x7E41;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x4E9B;&#x4E1A;&#x52A1;&#xFF0C;&#x8BFB;&#x5927;&#x4E8E;&#x5199;&#xFF0C;&#x5355;&#x53F0;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x53C8;&#x6210;&#x4E86;&#x74F6;&#x9888;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x505A;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#x4E86;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x5E93;&#x5355;&#x53F0;&#x538B;&#x529B;&#xFF0C;&#x4ECE;&#x673A;&#x7684;&#x6570;&#x91CF;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x53D8;&#x66F4;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x67B6;&#x6784;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x7EF4;&#x62A4;&#x96BE;&#x5EA6;&#x52A0;&#x5927;</p>
<h2 id="&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;"><a href="#&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;" class="headerlink" title="&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;"></a>&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;</h2><p>&#x5355;&#x673A;&#x65F6;&#x4EE3;&#xFF0C;&#x505A;&#x4E86;&#x4E0D;&#x5C11;&#x63AA;&#x65BD;&#x6765;&#x7F13;&#x89E3;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5305;&#x62EC;&#x670D;&#x52A1;&#x5668;&#x5206;&#x79BB;&#x3001;&#x5F15;&#x5165;&#x7F13;&#x5B58;&#x3001;&#x6570;&#x636E;&#x5206;&#x79BB;&#x7B49;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x8BBF;&#x95EE;&#x91CF;&#x7684;&#x731B;&#x589E;&#xFF0C;&#x5BF9;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x8981;&#x6C42;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x51CF;&#x8F7B;&#x5E94;&#x7528;&#x5C42;&#x538B;&#x529B;&#x3001;&#x89E3;&#x51B3;&#x5355;&#x70B9;&#x95EE;&#x9898;&#x662F;&#x5F53;&#x52A1;&#x4E4B;&#x6025;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x96C6;&#x7FA4;&#x65F6;&#x4EE3;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h3 id="&#x8D1F;&#x8F7D;&#x5747;&#x8861;"><a href="#&#x8D1F;&#x8F7D;&#x5747;&#x8861;" class="headerlink" title="&#x8D1F;&#x8F7D;&#x5747;&#x8861;"></a>&#x8D1F;&#x8F7D;&#x5747;&#x8861;</h3><p>&#x4EE3;&#x7801;&#x662F;&#x67B6;&#x6784;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4F46;&#x524D;&#x671F;&#x6539;&#x9020;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8F83;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x4EBA;&#x5458;&#x53D8;&#x52A8;&#x9891;&#x7E41;&#xFF0C;&#x90A3;&#x98CE;&#x9669;&#x5C31;&#x66F4;&#x9AD8;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x624B;&#x6BB5;&#x8FD8;&#x662F;&#x5148;&#x5C06;&#x5E94;&#x7528;&#x96C6;&#x7FA4;&#x5316;&#xFF0C;&#x505A;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x53BB;&#x9664;&#x5E94;&#x7528;&#x5C42;&#x5355;&#x70B9;&#xFF0C;&#x53EF;&#x7528;&#x6027;&#x5F97;&#x5230;&#x4FDD;&#x8BC1;&#xFF0C;&#x6027;&#x80FD;&#x6709;&#x6240;&#x63D0;&#x9AD8;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x8FD9;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x5E94;&#x7528;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x7F13;&#x5B58;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x5BF9;Session&#x7684;&#x5B58;&#x50A8;</p>
<h3 id="&#x52A8;&#x9759;&#x5206;&#x79BB;"><a href="#&#x52A8;&#x9759;&#x5206;&#x79BB;" class="headerlink" title="&#x52A8;&#x9759;&#x5206;&#x79BB;"></a>&#x52A8;&#x9759;&#x5206;&#x79BB;</h3><p>&#x5E0C;&#x671B;&#x8FDB;&#x4E00;&#x6B65;&#x964D;&#x4F4E;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x52A8;&#x9759;&#x5206;&#x79BB;&#x6280;&#x672F;&#x3002;</p>
<p>&#x52A8;&#x9759;&#x5206;&#x79BB;&#x662F;&#x8BA9;&#x52A8;&#x6001;&#x7F51;&#x7AD9;&#x91CC;&#x7684;&#x52A8;&#x6001;&#x7F51;&#x9875;&#xFF0C;&#x6839;&#x636E;&#x4E00;&#x5B9A;&#x89C4;&#x5219;&#x628A;&#x4E0D;&#x53D8;&#x7684;&#x8D44;&#x6E90;&#x548C;&#x7ECF;&#x5E38;&#x53D8;&#x7684;&#x8D44;&#x6E90;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x52A8;&#x9759;&#x8D44;&#x6E90;&#x505A;&#x597D;&#x4E86;&#x62C6;&#x5206;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x7684;&#x7279;&#x70B9;&#x5C06;&#x5176;&#x505A;&#x7F13;&#x5B58;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x52A0;&#x5FEB;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x676D;&#x7814;&#x5185;&#x90E8;&#xFF0C;&#x5E38;&#x7528;&#x505A;&#x6CD5;&#x8FD8;&#x4F1A;&#x5C06;&#x524D;&#x540E;&#x7AEF;&#x5206;&#x79BB;&#xFF0C;&#x540E;&#x7AEF;&#x5E94;&#x7528;&#x63D0;&#x4F9B;API&#xFF0C;&#x6839;&#x636E;&#x524D;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x5C06;&#x5904;&#x7406;&#x7ED3;&#x679C;&#x901A;&#x8FC7;JSON&#x683C;&#x5F0F;&#x8FD4;&#x56DE;&#x81F3;&#x524D;&#x7AEF;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x51CF;&#x8F7B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x538B;&#x529B;&#xFF0C;&#x7F13;&#x5B58;&#x9759;&#x6001;&#x6587;&#x4EF6;&#xFF0C;&#x52A0;&#x5FEB;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#xFF0C;&#x524D;&#x540E;&#x7AEF;&#x5206;&#x79BB;&#xFF0C;&#x5F00;&#x53D1;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x3002;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x7F13;&#x5B58;&#x66F4;&#x65B0;&#x5931;&#x6548;&#x95EE;&#x9898;&#xFF0C;&#x524D;&#x540E;&#x7AEF;&#x6C9F;&#x901A;&#x6210;&#x672C;&#x63D0;&#x9AD8;</p>
<h3 id="CDN-&#x52A0;&#x901F;"><a href="#CDN-&#x52A0;&#x901F;" class="headerlink" title="CDN &#x52A0;&#x901F;"></a>CDN &#x52A0;&#x901F;</h3><p>&#x5185;&#x5BB9;&#x5206;&#x53D1;&#x7F51;&#x7EDC;&#xFF08;Content Delivery Network&#xFF09;&#xFF0C;&#x7B80;&#x79F0; CDN&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x5FEB;&#x7F51;&#x7AD9;&#x76F8;&#x5E94;&#xFF0C;&#x5176;&#x539F;&#x7406;&#x662F;&#x5C06;&#x6E90;&#x5185;&#x5BB9;&#x540C;&#x6B65;&#x5230;&#x5168;&#x56FD;&#x5404;&#x8FB9;&#x7F18;&#x8282;&#x70B9;&#xFF0C;&#x914D;&#x5408;&#x7CBE;&#x51C6;&#x7684;&#x8C03;&#x5EA6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x5206;&#x914D;&#x81F3;&#x6700;&#x9002;&#x5408;&#x4ED6;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4EE5;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x53D6;&#x5F97;&#x4ED6;&#x6240;&#x9700;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x89E3;&#x51B3;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x5C0F;&#x3001;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x91CF;&#x5927;&#x3001;&#x7F51;&#x70B9;&#x5206;&#x5E03;&#x4E0D;&#x5747;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x7684;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#xFF0C;&#x51CF;&#x8F7B;&#x5E94;&#x7528;&#x8D1F;&#x8F7D;&#x538B;&#x529B;&#x3002;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x663E;&#x7136;&#x6210;&#x672C;&#x4E0A;&#x53BB;&#x4E86;&#xFF0C;CDN&#x670D;&#x52A1;&#x4E00;&#x822C;&#x662F;&#x6309;&#x6D41;&#x91CF;&#x8BA1;&#x8D39;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5B58;&#x5728;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x7F13;&#x5B58;&#x66F4;&#x65B0;&#x5931;&#x6548;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x5197;&#x4F59;&#x96C6;&#x7FA4;"><a href="#&#x5197;&#x4F59;&#x96C6;&#x7FA4;" class="headerlink" title="&#x5197;&#x4F59;&#x96C6;&#x7FA4;"></a>&#x5197;&#x4F59;&#x96C6;&#x7FA4;</h3><p>&#x4EE5;&#x4E0A;&#x4E00;&#x4E2A;&#x4E2D;&#x578B;&#x7F51;&#x7AD9;&#x67B6;&#x6784;&#x57FA;&#x672C;&#x6210;&#x578B;&#x3002;&#x5F53;&#x4E2D;&#x578B;&#x7F51;&#x7AD9;&#x7EE7;&#x7EED;&#x5411;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x6F14;&#x8FDB;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8981;&#x4FDD;&#x8BC1;&#x201C;&#x4E09;&#x9AD8;&#x201D;&#xFF1A;&#x9AD8;&#x5E76;&#x53D1;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x4EE5;&#x4E0A;&#x67B6;&#x6784;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x6027;&#x80FD;&#x9700;&#x6C42;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5173;&#x6CE8;&#x201C;&#x9AD8;&#x53EF;&#x7528;&#x201D;&#xFF0C;&#x786E;&#x4FDD;&#x201C;&#x65E0;&#x5355;&#x70B9;&#x201D;&#x3002;</p>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x5C31;&#x8981;&#x5BF9;&#x5173;&#x952E;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x505A;&#x5197;&#x4F59;&#x96C6;&#x7FA4;&#x8D1F;&#x8F7D;&#x3002;</p>
<p>&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x4E0B;&#x670D;&#x52A1;/&#x5E94;&#x7528;&#x90FD;&#x96C6;&#x7FA4;&#x5316;&#xFF1A;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x96C6;&#x7FA4;</p>
<p>&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x96C6;&#x7FA4;</p>
<p>&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x96C6;&#x7FA4;</p>
<p>&#x5E94;&#x7528;&#x670D;&#x52A1;&#x96C6;&#x7FA4;</p>
<p>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x8C03;&#x5EA6;&#x5668;&#x96C6;&#x7FA4;</p>
<p>&#x9759;&#x6001;&#x5185;&#x5BB9;&#x670D;&#x52A1;&#x96C6;&#x7FA4;</p>
<p>CDN&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x53BB;&#x5355;&#x70B9;&#xFF0C;&#x9AD8;&#x53EF;&#x7528;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x6570;&#x636E;&#x6709;&#x72B6;&#x6001;&#x95EE;&#x9898;&#x3001;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x8D44;&#x6E90;&#x6210;&#x672C;&#x3001;&#x4EBA;&#x529B;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x90FD;&#x4E0A;&#x53BB;&#x4E86;</p>
<p>&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x67B6;&#x6784;&#x4E5F;&#x57FA;&#x672C;&#x6210;&#x578B;&#x4E86;&#xFF0C;&#x80FD;&#x201C;&#x52A0;&#x673A;&#x5668;&#x201D;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x52A0;&#x5B8C;&#x4E86;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x7EC8;&#x7ED3;&#xFF1F;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#xFF01;&#x4F34;&#x968F;&#x7740;DT/&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x5927;&#x6D41;&#x91CF;&#x548C;&#x5927;&#x6570;&#x636E;&#x7684;&#x573A;&#x666F;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x5BF9;&#x5E94;&#x7528;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x5200;&#x4E86;&#x3002;</p>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;"><a href="#&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;" class="headerlink" title="&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;"></a>&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x4EE3;</h2><h3 id="&#x5E94;&#x7528;&#x62C6;&#x5206;"><a href="#&#x5E94;&#x7528;&#x62C6;&#x5206;" class="headerlink" title="&#x5E94;&#x7528;&#x62C6;&#x5206;"></a>&#x5E94;&#x7528;&#x62C6;&#x5206;</h3><p>&#x5728;&#x521B;&#x4E1A;&#x521D;&#x671F;&#x6216;&#x4EA7;&#x54C1;&#x524D;&#x671F;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;&#x867D;&#x7136;&#x5E94;&#x7528;&#x4E5F;&#x505A;&#x4E86;&#x96C6;&#x7FA4;&#x548C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5C42;&#x9762;&#x8FD8;&#x662F;&#x201C;&#x96C6;&#x4E2D;&#x5F0F;&#x201D;&#x7684;&#x3002;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x529F;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5E94;&#x7528;&#x62C6;&#x5206;&#x52BF;&#x5728;&#x5FC5;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x5E94;&#x7528;&#x89E3;&#x8026;&#xFF0C;&#x5206;&#x62C6;&#x56E2;&#x961F;&#x8D1F;&#x8D23;&#xFF0C;&#x5206;&#x800C;&#x6CBB;&#x4E4B;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x67B6;&#x6784;&#x53D8;&#x590D;&#x6742;</p>
<p>&#x5E94;&#x7528;&#x62C6;&#x5206;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x4F34;&#x968F;&#x7740;&#x4E00;&#x4E2A;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x3001;&#x516C;&#x5171;&#x6A21;&#x5757;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x903B;&#x8F91;&#x6216;&#x529F;&#x80FD;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x8FD9;&#x4E9B;&#x5171;&#x7528;&#x7684;&#x670D;&#x52A1;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#xFF0C;&#x7EDF;&#x4E00;&#x6CBB;&#x7406;&#xFF0C;&#x63D0;&#x9AD8;&#x91CD;&#x7528;&#x5EA6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#xFF08;service-oriented architecture&#xFF0C;&#x7F29;&#x5199; SOA&#xFF09;&#x4E86;&#x3002;</p>
<h3 id="&#x6D88;&#x606F;&#x961F;&#x5217;"><a href="#&#x6D88;&#x606F;&#x961F;&#x5217;" class="headerlink" title="&#x6D88;&#x606F;&#x961F;&#x5217;"></a>&#x6D88;&#x606F;&#x961F;&#x5217;</h3><p>&#x5E94;&#x7528;&#x62C6;&#x5206;&#x3001;&#x670D;&#x52A1;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x901A;&#x4FE1;&#x6216;&#x4F9D;&#x8D56;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF0C;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x5F02;&#x6B65;&#x3001;&#x89E3;&#x8026;&#xFF0C;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x5EF6;&#x8FDF;&#x7B49;&#x95EE;&#x9898;</p>
<h3 id="&#x6570;&#x636E;&#x5206;&#x5E93;"><a href="#&#x6570;&#x636E;&#x5206;&#x5E93;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x5E93;"></a>&#x6570;&#x636E;&#x5206;&#x5E93;</h3><p>&#x5E94;&#x7528;&#x62C6;&#x5206;&#x4E4B;&#x540E;&#xFF0C;DB&#x5206;&#x5E93;&#x7406;&#x6240;&#x5F53;&#x7136;&#xFF0C;&#x5426;&#x5219;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x8FDE;&#x63A5;&#x5728;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#xFF0C;&#x8FDE;&#x63A5;&#x6570;&#x3001;QPS&#x3001;TPS&#x3001;I/O&#x5904;&#x7406;&#x80FD;&#x529B;&#x90FD;&#x975E;&#x5E38;&#x6709;&#x9650;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;DB&#x5206;&#x538B;&#xFF0C;&#x964D;&#x4F4E;&#x8026;&#x5408;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5757;&#x5197;&#x4F59;&#x3001;&#x590D;&#x6742;</p>
<p>&#x63D0;&#x5230;&#x5206;&#x5E93;&#xFF0C;&#x4E0D;&#x5C11;&#x4EBA;&#x4F1A;&#x60F3;&#x5230;&#x5206;&#x8868;&#xFF0C;&#x8FD9;&#x4E00;&#x5757;&#x6211;&#x5E76;&#x672A;&#x5B9E;&#x8DF5;&#x8FC7;&#xFF0C;&#x4E0D;&#x597D;&#x4E0B;&#x7B14;&#x3002;&#x4F46;&#x60F3;&#x6765;&#x4F1A;&#x5F15;&#x5165;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x5E02;&#x9762;&#x8EAB;&#x4E0A;&#x6210;&#x719F;&#x5F00;&#x6E90;&#x7684;&#x5206;&#x5E93;&#x5206;&#x8868;&#x65B9;&#x6848;&#x5E76;&#x6CA1;&#x6709;&#xFF0C;&#x4FDD;&#x4E0D;&#x51C6;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x6DF1;&#x5751;&#x3002;&#x62C6;&#x6216;&#x4E0D;&#x62C6;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;"><a href="#&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;" class="headerlink" title="&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;"></a>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;</h3><p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7531;&#x591A;&#x4E2A;&#x5FAE;&#x5C0F;&#x670D;&#x52A1;&#x6784;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x53EF;&#x90E8;&#x7F72;&#x5355;&#x5143;&#x6216;&#x7EC4;&#x4EF6;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#xFF0C;&#x76F8;&#x4E92;&#x89E3;&#x8026;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDC;&#x7A0B;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF08;&#x6BD4;&#x5982;REST&#xFF09;&#x6765;&#x4EA4;&#x4E92;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x6027;&#x7684;&#x3002;&#x5B83;&#x7684;&#x7279;&#x5F81;&#x662F;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#x3001;&#x5FAE;&#x5C0F;&#x3001;&#x8F7B;&#x91CF;&#x3001;&#x677E;&#x8026;&#x5408;&#xFF0C;&#x53C8;&#x80FD;&#x65B9;&#x4FBF;&#x7684;&#x7EC4;&#x5408;&#x548C;&#x91CD;&#x6784;&#xFF0C;&#x72B9;&#x5982;&#x300A;&#x8D85;&#x80FD;&#x9646;&#x6218;&#x961F;&#x300B;&#x4E2D;&#x7684;&#x5FAE;&#x578B;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x4E2A;&#x4F53;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5A01;&#x529B;&#x5F3A;&#x5927;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x6269;&#x5C55;&#x6027;&#x597D;&#xFF0C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8026;&#x5408;&#x6027;&#x4F4E;&#xFF0C;&#x670D;&#x52A1;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x5BB9;&#x6613;&#x90E8;&#x7F72;&#xFF0C;&#x6613;&#x4E8E;&#x5F00;&#x53D1;&#xFF0C;&#x65B9;&#x4FBF;&#x6D4B;&#x8BD5;&#x6BCF;&#x4E00;&#x4E2A;&#x670D;&#x52A1;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x5BB9;&#x6613;&#x8FC7;&#x5EA6;&#x5173;&#x6CE8;&#x670D;&#x52A1;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x53EF;&#x80FD;&#x62C6;&#x5206;&#x7684;&#x5F88;&#x7EC6;&#xFF0C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#x4E5F;&#x4F1A;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x7CFB;&#x7EDF;&#x96C6;&#x6210;&#x590D;&#x6742;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x5F88;&#x96BE;&#x5B9E;&#x73B0;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x4E48;&#x706B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;Docker&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x5B83;&#x8BA9;&#x5FAE;&#x670D;&#x52A1;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5B8C;&#x7F8E;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF0C;Docker &#x7684;&#x72EC;&#x7ACB;&#x6027;&#x548C;&#x7EC6;&#x7C92;&#x5EA6;&#x975E;&#x5E38;&#x5339;&#x914D;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x7406;&#x5FF5;&#xFF0C;Docker&#x7684;&#x4F18;&#x79C0;&#x6027;&#x80FD;&#x548C;&#x4E30;&#x5BCC;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x5BF9;&#x5FAE;&#x670D;&#x52A1;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6982;&#x62EC;&#x6765;&#x8BF4; Docker &#x6709;&#x5982;&#x4E0B;&#x56DB;&#x70B9;&#x9002;&#x5408;&#x5FAE;&#x670D;&#x52A1;&#xFF1A;</p>
<p>&#x72EC;&#x7ACB;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x4E0D;&#x4F9D;&#x8D56;&#x5916;&#x90E8;&#x4EFB;&#x4F55;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x7EC6;&#x7C92;&#x5EA6;&#xFF1A;&#x4E00;&#x53F0;&#x7269;&#x7406;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x4E2A;&#x5BB9;&#x5668;&#x3002;&#x5176;&#x8BA1;&#x7B97;&#x7C92;&#x5EA6;&#x8DB3;&#x591F;&#x7684;&#x5C0F;&#x3002;</p>
<p>&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF1A;&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x79D2;&#x7EA7;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x670D;&#x52A1;&#x7684;&#x5FEB;&#x901F;&#x6784;&#x5EFA;&#x548C;&#x91CD;&#x7EC4;&#x3002;</p>
<p>&#x5B8C;&#x5584;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF1A;&#x6570;&#x91CF;&#x4F17;&#x591A;&#x7684;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x7684;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x5408;&#x548C;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x597D;&#x7684;&#x67B6;&#x6784;&#x548C;&#x6280;&#x672F;&#xFF0C;&#x8981;&#x5E94;&#x7528;&#x4E8E;&#x5B9E;&#x8DF5;&#x3001;&#x8BA9;&#x7528;&#x6237;&#x8BA4;&#x53EF;&#x624D;&#x884C;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x548C; Docker &#x6280;&#x672F;&#x4E4B;&#x4E0A;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x573A;&#x666F;&#x5316;&#x5E94;&#x7528;&#x3002;&#x7F51;&#x6613;&#x8702;&#x5DE2;&#x4E5F;&#x5728;&#x79EF;&#x6781;&#x63A2;&#x7D22;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x548C;&#x5BB9;&#x5668;&#x4E91;&#x5E73;&#x53F0;&#x7684;&#x573A;&#x666F;&#x5316;&#x670D;&#x52A1;&#xFF0C;&#x6B22;&#x8FCE;&#x4E00;&#x8D77;&#x6765;&#x5B9E;&#x8DF5;&#x843D;&#x5730;&#x3002;</p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x67B6;&#x6784;&#x53D8;&#x8FC1;&#x7684;&#x4E09;&#x4E2A;&#x65F6;&#x4EE3;&#x4ECB;&#x7ECD;&#x5B8C;&#x6210;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#x67B6;&#x6784;&#x4E0D;&#x662F;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x4E0D;&#x505C;&#xFF0C;&#x8FDB;&#x6B65;&#x4E0D;&#x6B62;&#xFF0C;&#x4EBA;&#x5982;&#x6B64;&#xFF0C;&#x67B6;&#x6784;&#x4F9D;&#x7136;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/01/12/互联网时代，我眼中的架构变迁/" data-id="ciy2bxreu003iw9uoi569usbd" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/互联网/">互联网</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2017/01/12/Android jar包导出资源的问题/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Android jar包导出资源的问题
        
      </div>
    </a>
  
  
    <a href="/2017/01/12/Android 文件上传下载/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Android 文件上传下载</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android/">Android</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android-UI/">Android UI</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Android反编译/">Android反编译</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/IDE/">IDE</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Java/">Java</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/JavaWeb/">JavaWeb</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Jenkins/">Jenkins</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Linux/">Linux</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity3D/">Unity3D</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Unity3D-游戏/">Unity3D,游戏</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/idea/">idea</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/互联网/">互联网</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/兴趣/">兴趣</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/博客/">博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/大牛博客/">大牛博客</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/学习，师傅/">学习，师傅</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/开源项目/">开源项目</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/微信-Js/">微信 Js</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/心情/">心情</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/感触一波/">感触一波</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/简历/">简历</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/面试/">面试</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/Android/" style="font-size: 20px;">Android</a> <a href="/tags/Android-UI/" style="font-size: 10px;">Android UI</a> <a href="/tags/Android反编译/" style="font-size: 10px;">Android反编译</a> <a href="/tags/IDE/" style="font-size: 10px;">IDE</a> <a href="/tags/Java/" style="font-size: 15px;">Java</a> <a href="/tags/JavaWeb/" style="font-size: 17.5px;">JavaWeb</a> <a href="/tags/Jenkins/" style="font-size: 10px;">Jenkins</a> <a href="/tags/Linux/" style="font-size: 12.5px;">Linux</a> <a href="/tags/Unity3D/" style="font-size: 10px;">Unity3D</a> <a href="/tags/Unity3D-游戏/" style="font-size: 10px;">Unity3D,游戏</a> <a href="/tags/idea/" style="font-size: 10px;">idea</a> <a href="/tags/互联网/" style="font-size: 10px;">互联网</a> <a href="/tags/兴趣/" style="font-size: 10px;">兴趣</a> <a href="/tags/博客/" style="font-size: 12.5px;">博客</a> <a href="/tags/大牛博客/" style="font-size: 10px;">大牛博客</a> <a href="/tags/学习，师傅/" style="font-size: 10px;">学习，师傅</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/微信-Js/" style="font-size: 10px;">微信 Js</a> <a href="/tags/心情/" style="font-size: 10px;">心情</a> <a href="/tags/感触一波/" style="font-size: 10px;">感触一波</a> <a href="/tags/简历/" style="font-size: 10px;">简历</a> <a href="/tags/面试/" style="font-size: 12.5px;">面试</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Arkiv</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Siste innlegg</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/01/18/AS的Intent Run的几种方式/">AS的Intent Run的几种方式</a>
          </li>
        
          <li>
            <a href="/2017/01/12/情商低的男生在感情中有哪些表现/">情商低的男生在感情中有哪些表现</a>
          </li>
        
          <li>
            <a href="/2017/01/12/Android jar包class修改重新打包/">Android jar包class修改重新打包</a>
          </li>
        
          <li>
            <a href="/2017/01/12/Android jar包导出资源的问题/">Android jar包导出资源的问题</a>
          </li>
        
          <li>
            <a href="/2017/01/12/互联网时代，我眼中的架构变迁/">互联网时代，我眼中的架构变迁</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 huanxingxyz<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>